virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/*
 * Component description for LCDC
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-06-28T09:00:02Z */
#ifndef _SAMA5D2_LCDC_COMPONENT_H_
#define _SAMA5D2_LCDC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR LCDC                                         */
/* ************************************************************************** */

/* -------- LCDC_LCDCFG0 : (LCDC Offset: 0x00) (R/W 32) LCD Controller Configuration Register 0 -------- */
#define LCDC_LCDCFG0_CLKPOL_Pos               _U_(0)                                               /**< (LCDC_LCDCFG0) LCD Controller Clock Polarity Position */
#define LCDC_LCDCFG0_CLKPOL_Msk               (_U_(0x1) << LCDC_LCDCFG0_CLKPOL_Pos)                /**< (LCDC_LCDCFG0) LCD Controller Clock Polarity Mask */
#define LCDC_LCDCFG0_CLKPOL(value)            (LCDC_LCDCFG0_CLKPOL_Msk & ((value) << LCDC_LCDCFG0_CLKPOL_Pos))
#define LCDC_LCDCFG0_CLKSEL_Pos               _U_(2)                                               /**< (LCDC_LCDCFG0) LCD Controller Clock Source Selection Position */
#define LCDC_LCDCFG0_CLKSEL_Msk               (_U_(0x1) << LCDC_LCDCFG0_CLKSEL_Pos)                /**< (LCDC_LCDCFG0) LCD Controller Clock Source Selection Mask */
#define LCDC_LCDCFG0_CLKSEL(value)            (LCDC_LCDCFG0_CLKSEL_Msk & ((value) << LCDC_LCDCFG0_CLKSEL_Pos))
#define LCDC_LCDCFG0_CLKPWMSEL_Pos            _U_(3)                                               /**< (LCDC_LCDCFG0) LCD Controller PWM Clock Source Selection Position */
#define LCDC_LCDCFG0_CLKPWMSEL_Msk            (_U_(0x1) << LCDC_LCDCFG0_CLKPWMSEL_Pos)             /**< (LCDC_LCDCFG0) LCD Controller PWM Clock Source Selection Mask */
#define LCDC_LCDCFG0_CLKPWMSEL(value)         (LCDC_LCDCFG0_CLKPWMSEL_Msk & ((value) << LCDC_LCDCFG0_CLKPWMSEL_Pos))
#define LCDC_LCDCFG0_CGDISBASE_Pos            _U_(8)                                               /**< (LCDC_LCDCFG0) Clock Gating Disable Control for the Base Layer Position */
#define LCDC_LCDCFG0_CGDISBASE_Msk            (_U_(0x1) << LCDC_LCDCFG0_CGDISBASE_Pos)             /**< (LCDC_LCDCFG0) Clock Gating Disable Control for the Base Layer Mask */
#define LCDC_LCDCFG0_CGDISBASE(value)         (LCDC_LCDCFG0_CGDISBASE_Msk & ((value) << LCDC_LCDCFG0_CGDISBASE_Pos))
#define LCDC_LCDCFG0_CGDISOVR1_Pos            _U_(9)                                               /**< (LCDC_LCDCFG0) Clock Gating Disable Control for the Overlay 1 Layer Position */
#define LCDC_LCDCFG0_CGDISOVR1_Msk            (_U_(0x1) << LCDC_LCDCFG0_CGDISOVR1_Pos)             /**< (LCDC_LCDCFG0) Clock Gating Disable Control for the Overlay 1 Layer Mask */
#define LCDC_LCDCFG0_CGDISOVR1(value)         (LCDC_LCDCFG0_CGDISOVR1_Msk & ((value) << LCDC_LCDCFG0_CGDISOVR1_Pos))
#define LCDC_LCDCFG0_CGDISOVR2_Pos            _U_(10)                                              /**< (LCDC_LCDCFG0) Clock Gating Disable Control for the Overlay 2 Layer Position */
#define LCDC_LCDCFG0_CGDISOVR2_Msk            (_U_(0x1) << LCDC_LCDCFG0_CGDISOVR2_Pos)             /**< (LCDC_LCDCFG0) Clock Gating Disable Control for the Overlay 2 Layer Mask */
#define LCDC_LCDCFG0_CGDISOVR2(value)         (LCDC_LCDCFG0_CGDISOVR2_Msk & ((value) << LCDC_LCDCFG0_CGDISOVR2_Pos))
#define LCDC_LCDCFG0_CGDISHEO_Pos             _U_(11)                                              /**< (LCDC_LCDCFG0) Clock Gating Disable Control for the High-End Overlay Position */
#define LCDC_LCDCFG0_CGDISHEO_Msk             (_U_(0x1) << LCDC_LCDCFG0_CGDISHEO_Pos)              /**< (LCDC_LCDCFG0) Clock Gating Disable Control for the High-End Overlay Mask */
#define LCDC_LCDCFG0_CGDISHEO(value)          (LCDC_LCDCFG0_CGDISHEO_Msk & ((value) << LCDC_LCDCFG0_CGDISHEO_Pos))
#define LCDC_LCDCFG0_CGDISPP_Pos              _U_(13)                                              /**< (LCDC_LCDCFG0) Clock Gating Disable Control for the Post Processing Layer Position */
#define LCDC_LCDCFG0_CGDISPP_Msk              (_U_(0x1) << LCDC_LCDCFG0_CGDISPP_Pos)               /**< (LCDC_LCDCFG0) Clock Gating Disable Control for the Post Processing Layer Mask */
#define LCDC_LCDCFG0_CGDISPP(value)           (LCDC_LCDCFG0_CGDISPP_Msk & ((value) << LCDC_LCDCFG0_CGDISPP_Pos))
#define LCDC_LCDCFG0_CLKDIV_Pos               _U_(16)                                              /**< (LCDC_LCDCFG0) LCD Controller Clock Divider Position */
#define LCDC_LCDCFG0_CLKDIV_Msk               (_U_(0xFF) << LCDC_LCDCFG0_CLKDIV_Pos)               /**< (LCDC_LCDCFG0) LCD Controller Clock Divider Mask */
#define LCDC_LCDCFG0_CLKDIV(value)            (LCDC_LCDCFG0_CLKDIV_Msk & ((value) << LCDC_LCDCFG0_CLKDIV_Pos))
#define LCDC_LCDCFG0_Msk                      _U_(0x00FF2F0D)                                      /**< (LCDC_LCDCFG0) Register Mask  */

