virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
#define LCDC_LCDCFG0_CGDISOVR_Pos             _U_(9)                                               /**< (LCDC_LCDCFG0 Position) Clock Gating Disable Control for the Overlay x Layer */
#define LCDC_LCDCFG0_CGDISOVR_Msk             (_U_(0x3) << LCDC_LCDCFG0_CGDISOVR_Pos)              /**< (LCDC_LCDCFG0 Mask) CGDISOVR */
#define LCDC_LCDCFG0_CGDISOVR(value)          (LCDC_LCDCFG0_CGDISOVR_Msk & ((value) << LCDC_LCDCFG0_CGDISOVR_Pos)) 

/* -------- LCDC_LCDCFG1 : (LCDC Offset: 0x04) (R/W 32) LCD Controller Configuration Register 1 -------- */
#define LCDC_LCDCFG1_HSPW_Pos                 _U_(0)                                               /**< (LCDC_LCDCFG1) Horizontal Synchronization Pulse Width Position */
#define LCDC_LCDCFG1_HSPW_Msk                 (_U_(0x3FF) << LCDC_LCDCFG1_HSPW_Pos)                /**< (LCDC_LCDCFG1) Horizontal Synchronization Pulse Width Mask */
#define LCDC_LCDCFG1_HSPW(value)              (LCDC_LCDCFG1_HSPW_Msk & ((value) << LCDC_LCDCFG1_HSPW_Pos))
#define LCDC_LCDCFG1_VSPW_Pos                 _U_(16)                                              /**< (LCDC_LCDCFG1) Vertical Synchronization Pulse Width Position */
#define LCDC_LCDCFG1_VSPW_Msk                 (_U_(0x3FF) << LCDC_LCDCFG1_VSPW_Pos)                /**< (LCDC_LCDCFG1) Vertical Synchronization Pulse Width Mask */
#define LCDC_LCDCFG1_VSPW(value)              (LCDC_LCDCFG1_VSPW_Msk & ((value) << LCDC_LCDCFG1_VSPW_Pos))
#define LCDC_LCDCFG1_Msk                      _U_(0x03FF03FF)                                      /**< (LCDC_LCDCFG1) Register Mask  */


/* -------- LCDC_LCDCFG2 : (LCDC Offset: 0x08) (R/W 32) LCD Controller Configuration Register 2 -------- */
#define LCDC_LCDCFG2_VFPW_Pos                 _U_(0)                                               /**< (LCDC_LCDCFG2) Vertical Front Porch Width Position */
#define LCDC_LCDCFG2_VFPW_Msk                 (_U_(0x3FF) << LCDC_LCDCFG2_VFPW_Pos)                /**< (LCDC_LCDCFG2) Vertical Front Porch Width Mask */
#define LCDC_LCDCFG2_VFPW(value)              (LCDC_LCDCFG2_VFPW_Msk & ((value) << LCDC_LCDCFG2_VFPW_Pos))
#define LCDC_LCDCFG2_VBPW_Pos                 _U_(16)                                              /**< (LCDC_LCDCFG2) Vertical Back Porch Width Position */
#define LCDC_LCDCFG2_VBPW_Msk                 (_U_(0x3FF) << LCDC_LCDCFG2_VBPW_Pos)                /**< (LCDC_LCDCFG2) Vertical Back Porch Width Mask */
#define LCDC_LCDCFG2_VBPW(value)              (LCDC_LCDCFG2_VBPW_Msk & ((value) << LCDC_LCDCFG2_VBPW_Pos))
#define LCDC_LCDCFG2_Msk                      _U_(0x03FF03FF)                                      /**< (LCDC_LCDCFG2) Register Mask  */


/* -------- LCDC_LCDCFG3 : (LCDC Offset: 0x0C) (R/W 32) LCD Controller Configuration Register 3 -------- */
#define LCDC_LCDCFG3_HFPW_Pos                 _U_(0)                                               /**< (LCDC_LCDCFG3) Horizontal Front Porch Width Position */
#define LCDC_LCDCFG3_HFPW_Msk                 (_U_(0x3FF) << LCDC_LCDCFG3_HFPW_Pos)                /**< (LCDC_LCDCFG3) Horizontal Front Porch Width Mask */
#define LCDC_LCDCFG3_HFPW(value)              (LCDC_LCDCFG3_HFPW_Msk & ((value) << LCDC_LCDCFG3_HFPW_Pos))
#define LCDC_LCDCFG3_HBPW_Pos                 _U_(16)                                              /**< (LCDC_LCDCFG3) Horizontal Back Porch Width Position */
#define LCDC_LCDCFG3_HBPW_Msk                 (_U_(0x3FF) << LCDC_LCDCFG3_HBPW_Pos)                /**< (LCDC_LCDCFG3) Horizontal Back Porch Width Mask */
#define LCDC_LCDCFG3_HBPW(value)              (LCDC_LCDCFG3_HBPW_Msk & ((value) << LCDC_LCDCFG3_HBPW_Pos))
#define LCDC_LCDCFG3_Msk                      _U_(0x03FF03FF)                                      /**< (LCDC_LCDCFG3) Register Mask  */


/* -------- LCDC_LCDCFG4 : (LCDC Offset: 0x10) (R/W 32) LCD Controller Configuration Register 4 -------- */
#define LCDC_LCDCFG4_PPL_Pos                  _U_(0)                                               /**< (LCDC_LCDCFG4) Number of Pixels Per Line Position */
#define LCDC_LCDCFG4_PPL_Msk                  (_U_(0x7FF) << LCDC_LCDCFG4_PPL_Pos)                 /**< (LCDC_LCDCFG4) Number of Pixels Per Line Mask */
#define LCDC_LCDCFG4_PPL(value)               (LCDC_LCDCFG4_PPL_Msk & ((value) << LCDC_LCDCFG4_PPL_Pos))
#define LCDC_LCDCFG4_RPF_Pos                  _U_(16)                                              /**< (LCDC_LCDCFG4) Number of Active Row Per Frame Position */
#define LCDC_LCDCFG4_RPF_Msk                  (_U_(0x7FF) << LCDC_LCDCFG4_RPF_Pos)                 /**< (LCDC_LCDCFG4) Number of Active Row Per Frame Mask */
#define LCDC_LCDCFG4_RPF(value)               (LCDC_LCDCFG4_RPF_Msk & ((value) << LCDC_LCDCFG4_RPF_Pos))
#define LCDC_LCDCFG4_Msk                      _U_(0x07FF07FF)                                      /**< (LCDC_LCDCFG4) Register Mask  */


/* -------- LCDC_LCDCFG5 : (LCDC Offset: 0x14) (R/W 32) LCD Controller Configuration Register 5 -------- */
#define LCDC_LCDCFG5_HSPOL_Pos                _U_(0)                                               /**< (LCDC_LCDCFG5) Horizontal Synchronization Pulse Polarity Position */
#define LCDC_LCDCFG5_HSPOL_Msk                (_U_(0x1) << LCDC_LCDCFG5_HSPOL_Pos)                 /**< (LCDC_LCDCFG5) Horizontal Synchronization Pulse Polarity Mask */
#define LCDC_LCDCFG5_HSPOL(value)             (LCDC_LCDCFG5_HSPOL_Msk & ((value) << LCDC_LCDCFG5_HSPOL_Pos))
#define LCDC_LCDCFG5_VSPOL_Pos                _U_(1)                                               /**< (LCDC_LCDCFG5) Vertical Synchronization Pulse Polarity Position */
#define LCDC_LCDCFG5_VSPOL_Msk                (_U_(0x1) << LCDC_LCDCFG5_VSPOL_Pos)                 /**< (LCDC_LCDCFG5) Vertical Synchronization Pulse Polarity Mask */
#define LCDC_LCDCFG5_VSPOL(value)             (LCDC_LCDCFG5_VSPOL_Msk & ((value) << LCDC_LCDCFG5_VSPOL_Pos))
#define LCDC_LCDCFG5_VSPDLYS_Pos              _U_(2)                                               /**< (LCDC_LCDCFG5) Vertical Synchronization Pulse Start Position */
#define LCDC_LCDCFG5_VSPDLYS_Msk              (_U_(0x1) << LCDC_LCDCFG5_VSPDLYS_Pos)               /**< (LCDC_LCDCFG5) Vertical Synchronization Pulse Start Mask */
#define LCDC_LCDCFG5_VSPDLYS(value)           (LCDC_LCDCFG5_VSPDLYS_Msk & ((value) << LCDC_LCDCFG5_VSPDLYS_Pos))
#define LCDC_LCDCFG5_VSPDLYE_Pos              _U_(3)                                               /**< (LCDC_LCDCFG5) Vertical Synchronization Pulse End Position */
#define LCDC_LCDCFG5_VSPDLYE_Msk              (_U_(0x1) << LCDC_LCDCFG5_VSPDLYE_Pos)               /**< (LCDC_LCDCFG5) Vertical Synchronization Pulse End Mask */
#define LCDC_LCDCFG5_VSPDLYE(value)           (LCDC_LCDCFG5_VSPDLYE_Msk & ((value) << LCDC_LCDCFG5_VSPDLYE_Pos))
#define LCDC_LCDCFG5_DISPPOL_Pos              _U_(4)                                               /**< (LCDC_LCDCFG5) Display Signal Polarity Position */
#define LCDC_LCDCFG5_DISPPOL_Msk              (_U_(0x1) << LCDC_LCDCFG5_DISPPOL_Pos)               /**< (LCDC_LCDCFG5) Display Signal Polarity Mask */
#define LCDC_LCDCFG5_DISPPOL(value)           (LCDC_LCDCFG5_DISPPOL_Msk & ((value) << LCDC_LCDCFG5_DISPPOL_Pos))
#define LCDC_LCDCFG5_DITHER_Pos               _U_(6)                                               /**< (LCDC_LCDCFG5) LCD Controller Dithering Position */
#define LCDC_LCDCFG5_DITHER_Msk               (_U_(0x1) << LCDC_LCDCFG5_DITHER_Pos)                /**< (LCDC_LCDCFG5) LCD Controller Dithering Mask */
#define LCDC_LCDCFG5_DITHER(value)            (LCDC_LCDCFG5_DITHER_Msk & ((value) << LCDC_LCDCFG5_DITHER_Pos))
#define LCDC_LCDCFG5_DISPDLY_Pos              _U_(7)                                               /**< (LCDC_LCDCFG5) LCD Controller Display Power Signal Synchronization Position */
#define LCDC_LCDCFG5_DISPDLY_Msk              (_U_(0x1) << LCDC_LCDCFG5_DISPDLY_Pos)               /**< (LCDC_LCDCFG5) LCD Controller Display Power Signal Synchronization Mask */
#define LCDC_LCDCFG5_DISPDLY(value)           (LCDC_LCDCFG5_DISPDLY_Msk & ((value) << LCDC_LCDCFG5_DISPDLY_Pos))
#define LCDC_LCDCFG5_MODE_Pos                 _U_(8)                                               /**< (LCDC_LCDCFG5) LCD Controller Output Mode Position */
#define LCDC_LCDCFG5_MODE_Msk                 (_U_(0x3) << LCDC_LCDCFG5_MODE_Pos)                  /**< (LCDC_LCDCFG5) LCD Controller Output Mode Mask */
#define LCDC_LCDCFG5_MODE(value)              (LCDC_LCDCFG5_MODE_Msk & ((value) << LCDC_LCDCFG5_MODE_Pos))
#define   LCDC_LCDCFG5_MODE_OUTPUT_12BPP_Val  _U_(0x0)                                             /**< (LCDC_LCDCFG5) LCD Output mode is set to 12 bits per pixel  */
#define   LCDC_LCDCFG5_MODE_OUTPUT_16BPP_Val  _U_(0x1)                                             /**< (LCDC_LCDCFG5) LCD Output mode is set to 16 bits per pixel  */
#define   LCDC_LCDCFG5_MODE_OUTPUT_18BPP_Val  _U_(0x2)                                             /**< (LCDC_LCDCFG5) LCD Output mode is set to 18 bits per pixel  */
#define   LCDC_LCDCFG5_MODE_OUTPUT_24BPP_Val  _U_(0x3)                                             /**< (LCDC_LCDCFG5) LCD Output mode is set to 24 bits per pixel  */
#define LCDC_LCDCFG5_MODE_OUTPUT_12BPP        (LCDC_LCDCFG5_MODE_OUTPUT_12BPP_Val << LCDC_LCDCFG5_MODE_Pos) /**< (LCDC_LCDCFG5) LCD Output mode is set to 12 bits per pixel Position  */
#define LCDC_LCDCFG5_MODE_OUTPUT_16BPP        (LCDC_LCDCFG5_MODE_OUTPUT_16BPP_Val << LCDC_LCDCFG5_MODE_Pos) /**< (LCDC_LCDCFG5) LCD Output mode is set to 16 bits per pixel Position  */
#define LCDC_LCDCFG5_MODE_OUTPUT_18BPP        (LCDC_LCDCFG5_MODE_OUTPUT_18BPP_Val << LCDC_LCDCFG5_MODE_Pos) /**< (LCDC_LCDCFG5) LCD Output mode is set to 18 bits per pixel Position  */
#define LCDC_LCDCFG5_MODE_OUTPUT_24BPP        (LCDC_LCDCFG5_MODE_OUTPUT_24BPP_Val << LCDC_LCDCFG5_MODE_Pos) /**< (LCDC_LCDCFG5) LCD Output mode is set to 24 bits per pixel Position  */
#define LCDC_LCDCFG5_PP_Pos                   _U_(10)                                              /**< (LCDC_LCDCFG5) Post Processing Enable Position */
#define LCDC_LCDCFG5_PP_Msk                   (_U_(0x1) << LCDC_LCDCFG5_PP_Pos)                    /**< (LCDC_LCDCFG5) Post Processing Enable Mask */
#define LCDC_LCDCFG5_PP(value)                (LCDC_LCDCFG5_PP_Msk & ((value) << LCDC_LCDCFG5_PP_Pos))
#define LCDC_LCDCFG5_VSPSU_Pos                _U_(12)                                              /**< (LCDC_LCDCFG5) LCD Controller Vertical synchronization Pulse Setup Configuration Position */
#define LCDC_LCDCFG5_VSPSU_Msk                (_U_(0x1) << LCDC_LCDCFG5_VSPSU_Pos)                 /**< (LCDC_LCDCFG5) LCD Controller Vertical synchronization Pulse Setup Configuration Mask */
#define LCDC_LCDCFG5_VSPSU(value)             (LCDC_LCDCFG5_VSPSU_Msk & ((value) << LCDC_LCDCFG5_VSPSU_Pos))
#define LCDC_LCDCFG5_VSPHO_Pos                _U_(13)                                              /**< (LCDC_LCDCFG5) LCD Controller Vertical synchronization Pulse Hold Configuration Position */
#define LCDC_LCDCFG5_VSPHO_Msk                (_U_(0x1) << LCDC_LCDCFG5_VSPHO_Pos)                 /**< (LCDC_LCDCFG5) LCD Controller Vertical synchronization Pulse Hold Configuration Mask */
#define LCDC_LCDCFG5_VSPHO(value)             (LCDC_LCDCFG5_VSPHO_Msk & ((value) << LCDC_LCDCFG5_VSPHO_Pos))
#define LCDC_LCDCFG5_GUARDTIME_Pos            _U_(16)                                              /**< (LCDC_LCDCFG5) LCD DISPLAY Guard Time Position */
#define LCDC_LCDCFG5_GUARDTIME_Msk            (_U_(0xFF) << LCDC_LCDCFG5_GUARDTIME_Pos)            /**< (LCDC_LCDCFG5) LCD DISPLAY Guard Time Mask */
#define LCDC_LCDCFG5_GUARDTIME(value)         (LCDC_LCDCFG5_GUARDTIME_Msk & ((value) << LCDC_LCDCFG5_GUARDTIME_Pos))
#define LCDC_LCDCFG5_Msk                      _U_(0x00FF37DF)                                      /**< (LCDC_LCDCFG5) Register Mask  */


/* -------- LCDC_LCDCFG6 : (LCDC Offset: 0x18) (R/W 32) LCD Controller Configuration Register 6 -------- */
#define LCDC_LCDCFG6_PWMPS_Pos                _U_(0)                                               /**< (LCDC_LCDCFG6) PWM Clock Prescaler Position */
#define LCDC_LCDCFG6_PWMPS_Msk                (_U_(0x7) << LCDC_LCDCFG6_PWMPS_Pos)                 /**< (LCDC_LCDCFG6) PWM Clock Prescaler Mask */
#define LCDC_LCDCFG6_PWMPS(value)             (LCDC_LCDCFG6_PWMPS_Msk & ((value) << LCDC_LCDCFG6_PWMPS_Pos))
#define   LCDC_LCDCFG6_PWMPS_DIV_1_Val        _U_(0x0)                                             /**< (LCDC_LCDCFG6) The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK  */
#define   LCDC_LCDCFG6_PWMPS_DIV_2_Val        _U_(0x1)                                             /**< (LCDC_LCDCFG6) The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/2  */
#define   LCDC_LCDCFG6_PWMPS_DIV_4_Val        _U_(0x2)                                             /**< (LCDC_LCDCFG6) The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/4  */
#define   LCDC_LCDCFG6_PWMPS_DIV_8_Val        _U_(0x3)                                             /**< (LCDC_LCDCFG6) The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/8  */
#define   LCDC_LCDCFG6_PWMPS_DIV_16_Val       _U_(0x4)                                             /**< (LCDC_LCDCFG6) The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/16  */
#define   LCDC_LCDCFG6_PWMPS_DIV_32_Val       _U_(0x5)                                             /**< (LCDC_LCDCFG6) The counter advances at a of rate fCOUNTER = fPWM_SELECTED_CLOCK/32  */
#define   LCDC_LCDCFG6_PWMPS_DIV_64_Val       _U_(0x6)                                             /**< (LCDC_LCDCFG6) The counter advances at a of rate fCOUNTER = fPWM_SELECTED_CLOCK/64  */
#define LCDC_LCDCFG6_PWMPS_DIV_1              (LCDC_LCDCFG6_PWMPS_DIV_1_Val << LCDC_LCDCFG6_PWMPS_Pos) /**< (LCDC_LCDCFG6) The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK Position  */
#define LCDC_LCDCFG6_PWMPS_DIV_2              (LCDC_LCDCFG6_PWMPS_DIV_2_Val << LCDC_LCDCFG6_PWMPS_Pos) /**< (LCDC_LCDCFG6) The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/2 Position  */
#define LCDC_LCDCFG6_PWMPS_DIV_4              (LCDC_LCDCFG6_PWMPS_DIV_4_Val << LCDC_LCDCFG6_PWMPS_Pos) /**< (LCDC_LCDCFG6) The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/4 Position  */
#define LCDC_LCDCFG6_PWMPS_DIV_8              (LCDC_LCDCFG6_PWMPS_DIV_8_Val << LCDC_LCDCFG6_PWMPS_Pos) /**< (LCDC_LCDCFG6) The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/8 Position  */
#define LCDC_LCDCFG6_PWMPS_DIV_16             (LCDC_LCDCFG6_PWMPS_DIV_16_Val << LCDC_LCDCFG6_PWMPS_Pos) /**< (LCDC_LCDCFG6) The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/16 Position  */
#define LCDC_LCDCFG6_PWMPS_DIV_32             (LCDC_LCDCFG6_PWMPS_DIV_32_Val << LCDC_LCDCFG6_PWMPS_Pos) /**< (LCDC_LCDCFG6) The counter advances at a of rate fCOUNTER = fPWM_SELECTED_CLOCK/32 Position  */
#define LCDC_LCDCFG6_PWMPS_DIV_64             (LCDC_LCDCFG6_PWMPS_DIV_64_Val << LCDC_LCDCFG6_PWMPS_Pos) /**< (LCDC_LCDCFG6) The counter advances at a of rate fCOUNTER = fPWM_SELECTED_CLOCK/64 Position  */
#define LCDC_LCDCFG6_PWMPOL_Pos               _U_(4)                                               /**< (LCDC_LCDCFG6) LCD Controller PWM Signal Polarity Position */
#define LCDC_LCDCFG6_PWMPOL_Msk               (_U_(0x1) << LCDC_LCDCFG6_PWMPOL_Pos)                /**< (LCDC_LCDCFG6) LCD Controller PWM Signal Polarity Mask */
#define LCDC_LCDCFG6_PWMPOL(value)            (LCDC_LCDCFG6_PWMPOL_Msk & ((value) << LCDC_LCDCFG6_PWMPOL_Pos))
#define LCDC_LCDCFG6_PWMCVAL_Pos              _U_(8)                                               /**< (LCDC_LCDCFG6) LCD Controller PWM Compare Value Position */
#define LCDC_LCDCFG6_PWMCVAL_Msk              (_U_(0xFF) << LCDC_LCDCFG6_PWMCVAL_Pos)              /**< (LCDC_LCDCFG6) LCD Controller PWM Compare Value Mask */
#define LCDC_LCDCFG6_PWMCVAL(value)           (LCDC_LCDCFG6_PWMCVAL_Msk & ((value) << LCDC_LCDCFG6_PWMCVAL_Pos))
#define LCDC_LCDCFG6_Msk                      _U_(0x0000FF17)                                      /**< (LCDC_LCDCFG6) Register Mask  */


