virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_LCDIDR : (LCDC Offset: 0x30) ( /W 32) LCD Controller Interrupt Disable Register -------- */
#define LCDC_LCDIDR_SOFID_Pos                 _U_(0)                                               /**< (LCDC_LCDIDR) Start of Frame Interrupt Disable Position */
#define LCDC_LCDIDR_SOFID_Msk                 (_U_(0x1) << LCDC_LCDIDR_SOFID_Pos)                  /**< (LCDC_LCDIDR) Start of Frame Interrupt Disable Mask */
#define LCDC_LCDIDR_SOFID(value)              (LCDC_LCDIDR_SOFID_Msk & ((value) << LCDC_LCDIDR_SOFID_Pos))
#define LCDC_LCDIDR_DISID_Pos                 _U_(1)                                               /**< (LCDC_LCDIDR) LCD Disable Interrupt Disable Position */
#define LCDC_LCDIDR_DISID_Msk                 (_U_(0x1) << LCDC_LCDIDR_DISID_Pos)                  /**< (LCDC_LCDIDR) LCD Disable Interrupt Disable Mask */
#define LCDC_LCDIDR_DISID(value)              (LCDC_LCDIDR_DISID_Msk & ((value) << LCDC_LCDIDR_DISID_Pos))
#define LCDC_LCDIDR_DISPID_Pos                _U_(2)                                               /**< (LCDC_LCDIDR) Powerup/Powerdown Sequence Terminated Interrupt Disable Position */
#define LCDC_LCDIDR_DISPID_Msk                (_U_(0x1) << LCDC_LCDIDR_DISPID_Pos)                 /**< (LCDC_LCDIDR) Powerup/Powerdown Sequence Terminated Interrupt Disable Mask */
#define LCDC_LCDIDR_DISPID(value)             (LCDC_LCDIDR_DISPID_Msk & ((value) << LCDC_LCDIDR_DISPID_Pos))
#define LCDC_LCDIDR_FIFOERRID_Pos             _U_(4)                                               /**< (LCDC_LCDIDR) Output FIFO Error Interrupt Disable Position */
#define LCDC_LCDIDR_FIFOERRID_Msk             (_U_(0x1) << LCDC_LCDIDR_FIFOERRID_Pos)              /**< (LCDC_LCDIDR) Output FIFO Error Interrupt Disable Mask */
#define LCDC_LCDIDR_FIFOERRID(value)          (LCDC_LCDIDR_FIFOERRID_Msk & ((value) << LCDC_LCDIDR_FIFOERRID_Pos))
#define LCDC_LCDIDR_BASEID_Pos                _U_(8)                                               /**< (LCDC_LCDIDR) Base Layer Interrupt Disable Position */
#define LCDC_LCDIDR_BASEID_Msk                (_U_(0x1) << LCDC_LCDIDR_BASEID_Pos)                 /**< (LCDC_LCDIDR) Base Layer Interrupt Disable Mask */
#define LCDC_LCDIDR_BASEID(value)             (LCDC_LCDIDR_BASEID_Msk & ((value) << LCDC_LCDIDR_BASEID_Pos))
#define LCDC_LCDIDR_OVR1ID_Pos                _U_(9)                                               /**< (LCDC_LCDIDR) Overlay 1 Interrupt Disable Position */
#define LCDC_LCDIDR_OVR1ID_Msk                (_U_(0x1) << LCDC_LCDIDR_OVR1ID_Pos)                 /**< (LCDC_LCDIDR) Overlay 1 Interrupt Disable Mask */
#define LCDC_LCDIDR_OVR1ID(value)             (LCDC_LCDIDR_OVR1ID_Msk & ((value) << LCDC_LCDIDR_OVR1ID_Pos))
#define LCDC_LCDIDR_OVR2ID_Pos                _U_(10)                                              /**< (LCDC_LCDIDR) Overlay 2 Interrupt Disable Position */
#define LCDC_LCDIDR_OVR2ID_Msk                (_U_(0x1) << LCDC_LCDIDR_OVR2ID_Pos)                 /**< (LCDC_LCDIDR) Overlay 2 Interrupt Disable Mask */
#define LCDC_LCDIDR_OVR2ID(value)             (LCDC_LCDIDR_OVR2ID_Msk & ((value) << LCDC_LCDIDR_OVR2ID_Pos))
#define LCDC_LCDIDR_HEOID_Pos                 _U_(11)                                              /**< (LCDC_LCDIDR) High-End Overlay Interrupt Disable Position */
#define LCDC_LCDIDR_HEOID_Msk                 (_U_(0x1) << LCDC_LCDIDR_HEOID_Pos)                  /**< (LCDC_LCDIDR) High-End Overlay Interrupt Disable Mask */
#define LCDC_LCDIDR_HEOID(value)              (LCDC_LCDIDR_HEOID_Msk & ((value) << LCDC_LCDIDR_HEOID_Pos))
#define LCDC_LCDIDR_PPID_Pos                  _U_(13)                                              /**< (LCDC_LCDIDR) Post Processing Interrupt Disable Position */
#define LCDC_LCDIDR_PPID_Msk                  (_U_(0x1) << LCDC_LCDIDR_PPID_Pos)                   /**< (LCDC_LCDIDR) Post Processing Interrupt Disable Mask */
#define LCDC_LCDIDR_PPID(value)               (LCDC_LCDIDR_PPID_Msk & ((value) << LCDC_LCDIDR_PPID_Pos))
#define LCDC_LCDIDR_Msk                       _U_(0x00002F17)                                      /**< (LCDC_LCDIDR) Register Mask  */


/* -------- LCDC_LCDIMR : (LCDC Offset: 0x34) ( R/ 32) LCD Controller Interrupt Mask Register -------- */
#define LCDC_LCDIMR_SOFIM_Pos                 _U_(0)                                               /**< (LCDC_LCDIMR) Start of Frame Interrupt Mask Position */
#define LCDC_LCDIMR_SOFIM_Msk                 (_U_(0x1) << LCDC_LCDIMR_SOFIM_Pos)                  /**< (LCDC_LCDIMR) Start of Frame Interrupt Mask Mask */
#define LCDC_LCDIMR_SOFIM(value)              (LCDC_LCDIMR_SOFIM_Msk & ((value) << LCDC_LCDIMR_SOFIM_Pos))
#define LCDC_LCDIMR_DISIM_Pos                 _U_(1)                                               /**< (LCDC_LCDIMR) LCD Disable Interrupt Mask Position */
#define LCDC_LCDIMR_DISIM_Msk                 (_U_(0x1) << LCDC_LCDIMR_DISIM_Pos)                  /**< (LCDC_LCDIMR) LCD Disable Interrupt Mask Mask */
#define LCDC_LCDIMR_DISIM(value)              (LCDC_LCDIMR_DISIM_Msk & ((value) << LCDC_LCDIMR_DISIM_Pos))
#define LCDC_LCDIMR_DISPIM_Pos                _U_(2)                                               /**< (LCDC_LCDIMR) Powerup/Powerdown Sequence Terminated Interrupt Mask Position */
#define LCDC_LCDIMR_DISPIM_Msk                (_U_(0x1) << LCDC_LCDIMR_DISPIM_Pos)                 /**< (LCDC_LCDIMR) Powerup/Powerdown Sequence Terminated Interrupt Mask Mask */
#define LCDC_LCDIMR_DISPIM(value)             (LCDC_LCDIMR_DISPIM_Msk & ((value) << LCDC_LCDIMR_DISPIM_Pos))
#define LCDC_LCDIMR_FIFOERRIM_Pos             _U_(4)                                               /**< (LCDC_LCDIMR) Output FIFO Error Interrupt Mask Position */
#define LCDC_LCDIMR_FIFOERRIM_Msk             (_U_(0x1) << LCDC_LCDIMR_FIFOERRIM_Pos)              /**< (LCDC_LCDIMR) Output FIFO Error Interrupt Mask Mask */
#define LCDC_LCDIMR_FIFOERRIM(value)          (LCDC_LCDIMR_FIFOERRIM_Msk & ((value) << LCDC_LCDIMR_FIFOERRIM_Pos))
#define LCDC_LCDIMR_BASEIM_Pos                _U_(8)                                               /**< (LCDC_LCDIMR) Base Layer Interrupt Mask Position */
#define LCDC_LCDIMR_BASEIM_Msk                (_U_(0x1) << LCDC_LCDIMR_BASEIM_Pos)                 /**< (LCDC_LCDIMR) Base Layer Interrupt Mask Mask */
#define LCDC_LCDIMR_BASEIM(value)             (LCDC_LCDIMR_BASEIM_Msk & ((value) << LCDC_LCDIMR_BASEIM_Pos))
#define LCDC_LCDIMR_OVR1IM_Pos                _U_(9)                                               /**< (LCDC_LCDIMR) Overlay 1 Interrupt Mask Position */
#define LCDC_LCDIMR_OVR1IM_Msk                (_U_(0x1) << LCDC_LCDIMR_OVR1IM_Pos)                 /**< (LCDC_LCDIMR) Overlay 1 Interrupt Mask Mask */
#define LCDC_LCDIMR_OVR1IM(value)             (LCDC_LCDIMR_OVR1IM_Msk & ((value) << LCDC_LCDIMR_OVR1IM_Pos))
#define LCDC_LCDIMR_OVR2IM_Pos                _U_(10)                                              /**< (LCDC_LCDIMR) Overlay 2 Interrupt Mask Position */
#define LCDC_LCDIMR_OVR2IM_Msk                (_U_(0x1) << LCDC_LCDIMR_OVR2IM_Pos)                 /**< (LCDC_LCDIMR) Overlay 2 Interrupt Mask Mask */
#define LCDC_LCDIMR_OVR2IM(value)             (LCDC_LCDIMR_OVR2IM_Msk & ((value) << LCDC_LCDIMR_OVR2IM_Pos))
#define LCDC_LCDIMR_HEOIM_Pos                 _U_(11)                                              /**< (LCDC_LCDIMR) High-End Overlay Interrupt Mask Position */
#define LCDC_LCDIMR_HEOIM_Msk                 (_U_(0x1) << LCDC_LCDIMR_HEOIM_Pos)                  /**< (LCDC_LCDIMR) High-End Overlay Interrupt Mask Mask */
#define LCDC_LCDIMR_HEOIM(value)              (LCDC_LCDIMR_HEOIM_Msk & ((value) << LCDC_LCDIMR_HEOIM_Pos))
#define LCDC_LCDIMR_PPIM_Pos                  _U_(13)                                              /**< (LCDC_LCDIMR) Post Processing Interrupt Mask Position */
#define LCDC_LCDIMR_PPIM_Msk                  (_U_(0x1) << LCDC_LCDIMR_PPIM_Pos)                   /**< (LCDC_LCDIMR) Post Processing Interrupt Mask Mask */
#define LCDC_LCDIMR_PPIM(value)               (LCDC_LCDIMR_PPIM_Msk & ((value) << LCDC_LCDIMR_PPIM_Pos))
#define LCDC_LCDIMR_Msk                       _U_(0x00002F17)                                      /**< (LCDC_LCDIMR) Register Mask  */


