virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_LCDISR : (LCDC Offset: 0x38) ( R/ 32) LCD Controller Interrupt Status Register -------- */
#define LCDC_LCDISR_SOF_Pos                   _U_(0)                                               /**< (LCDC_LCDISR) Start of Frame Interrupt Status Position */
#define LCDC_LCDISR_SOF_Msk                   (_U_(0x1) << LCDC_LCDISR_SOF_Pos)                    /**< (LCDC_LCDISR) Start of Frame Interrupt Status Mask */
#define LCDC_LCDISR_SOF(value)                (LCDC_LCDISR_SOF_Msk & ((value) << LCDC_LCDISR_SOF_Pos))
#define LCDC_LCDISR_DIS_Pos                   _U_(1)                                               /**< (LCDC_LCDISR) LCD Disable Interrupt Status Position */
#define LCDC_LCDISR_DIS_Msk                   (_U_(0x1) << LCDC_LCDISR_DIS_Pos)                    /**< (LCDC_LCDISR) LCD Disable Interrupt Status Mask */
#define LCDC_LCDISR_DIS(value)                (LCDC_LCDISR_DIS_Msk & ((value) << LCDC_LCDISR_DIS_Pos))
#define LCDC_LCDISR_DISP_Pos                  _U_(2)                                               /**< (LCDC_LCDISR) Powerup/Powerdown Sequence Terminated Interrupt Status Position */
#define LCDC_LCDISR_DISP_Msk                  (_U_(0x1) << LCDC_LCDISR_DISP_Pos)                   /**< (LCDC_LCDISR) Powerup/Powerdown Sequence Terminated Interrupt Status Mask */
#define LCDC_LCDISR_DISP(value)               (LCDC_LCDISR_DISP_Msk & ((value) << LCDC_LCDISR_DISP_Pos))
#define LCDC_LCDISR_FIFOERR_Pos               _U_(4)                                               /**< (LCDC_LCDISR) Output FIFO Error Position */
#define LCDC_LCDISR_FIFOERR_Msk               (_U_(0x1) << LCDC_LCDISR_FIFOERR_Pos)                /**< (LCDC_LCDISR) Output FIFO Error Mask */
#define LCDC_LCDISR_FIFOERR(value)            (LCDC_LCDISR_FIFOERR_Msk & ((value) << LCDC_LCDISR_FIFOERR_Pos))
#define LCDC_LCDISR_BASE_Pos                  _U_(8)                                               /**< (LCDC_LCDISR) Base Layer Raw Interrupt Status Position */
#define LCDC_LCDISR_BASE_Msk                  (_U_(0x1) << LCDC_LCDISR_BASE_Pos)                   /**< (LCDC_LCDISR) Base Layer Raw Interrupt Status Mask */
#define LCDC_LCDISR_BASE(value)               (LCDC_LCDISR_BASE_Msk & ((value) << LCDC_LCDISR_BASE_Pos))
#define LCDC_LCDISR_OVR1_Pos                  _U_(9)                                               /**< (LCDC_LCDISR) Overlay 1 Raw Interrupt Status Position */
#define LCDC_LCDISR_OVR1_Msk                  (_U_(0x1) << LCDC_LCDISR_OVR1_Pos)                   /**< (LCDC_LCDISR) Overlay 1 Raw Interrupt Status Mask */
#define LCDC_LCDISR_OVR1(value)               (LCDC_LCDISR_OVR1_Msk & ((value) << LCDC_LCDISR_OVR1_Pos))
#define LCDC_LCDISR_OVR2_Pos                  _U_(10)                                              /**< (LCDC_LCDISR) Overlay 2 Raw Interrupt Status Position */
#define LCDC_LCDISR_OVR2_Msk                  (_U_(0x1) << LCDC_LCDISR_OVR2_Pos)                   /**< (LCDC_LCDISR) Overlay 2 Raw Interrupt Status Mask */
#define LCDC_LCDISR_OVR2(value)               (LCDC_LCDISR_OVR2_Msk & ((value) << LCDC_LCDISR_OVR2_Pos))
#define LCDC_LCDISR_HEO_Pos                   _U_(11)                                              /**< (LCDC_LCDISR) High-End Overlay Raw Interrupt Status Position */
#define LCDC_LCDISR_HEO_Msk                   (_U_(0x1) << LCDC_LCDISR_HEO_Pos)                    /**< (LCDC_LCDISR) High-End Overlay Raw Interrupt Status Mask */
#define LCDC_LCDISR_HEO(value)                (LCDC_LCDISR_HEO_Msk & ((value) << LCDC_LCDISR_HEO_Pos))
#define LCDC_LCDISR_PP_Pos                    _U_(13)                                              /**< (LCDC_LCDISR) Post Processing Raw Interrupt Status Position */
#define LCDC_LCDISR_PP_Msk                    (_U_(0x1) << LCDC_LCDISR_PP_Pos)                     /**< (LCDC_LCDISR) Post Processing Raw Interrupt Status Mask */
#define LCDC_LCDISR_PP(value)                 (LCDC_LCDISR_PP_Msk & ((value) << LCDC_LCDISR_PP_Pos))
#define LCDC_LCDISR_Msk                       _U_(0x00002F17)                                      /**< (LCDC_LCDISR) Register Mask  */

#define LCDC_LCDISR_OVR_Pos                   _U_(9)                                               /**< (LCDC_LCDISR Position) Overlay x Raw Interrupt Status */
#define LCDC_LCDISR_OVR_Msk                   (_U_(0x3) << LCDC_LCDISR_OVR_Pos)                    /**< (LCDC_LCDISR Mask) OVR */
#define LCDC_LCDISR_OVR(value)                (LCDC_LCDISR_OVR_Msk & ((value) << LCDC_LCDISR_OVR_Pos)) 

/* -------- LCDC_ATTR : (LCDC Offset: 0x3C) ( /W 32) LCD Controller Attribute Register -------- */
#define LCDC_ATTR_BASE_Pos                    _U_(0)                                               /**< (LCDC_ATTR) Base Layer Update Attribute Position */
#define LCDC_ATTR_BASE_Msk                    (_U_(0x1) << LCDC_ATTR_BASE_Pos)                     /**< (LCDC_ATTR) Base Layer Update Attribute Mask */
#define LCDC_ATTR_BASE(value)                 (LCDC_ATTR_BASE_Msk & ((value) << LCDC_ATTR_BASE_Pos))
#define LCDC_ATTR_OVR1_Pos                    _U_(1)                                               /**< (LCDC_ATTR) Overlay 1 Update Attribute Position */
#define LCDC_ATTR_OVR1_Msk                    (_U_(0x1) << LCDC_ATTR_OVR1_Pos)                     /**< (LCDC_ATTR) Overlay 1 Update Attribute Mask */
#define LCDC_ATTR_OVR1(value)                 (LCDC_ATTR_OVR1_Msk & ((value) << LCDC_ATTR_OVR1_Pos))
#define LCDC_ATTR_OVR2_Pos                    _U_(2)                                               /**< (LCDC_ATTR) Overlay 2 Update Attribute Position */
#define LCDC_ATTR_OVR2_Msk                    (_U_(0x1) << LCDC_ATTR_OVR2_Pos)                     /**< (LCDC_ATTR) Overlay 2 Update Attribute Mask */
#define LCDC_ATTR_OVR2(value)                 (LCDC_ATTR_OVR2_Msk & ((value) << LCDC_ATTR_OVR2_Pos))
#define LCDC_ATTR_HEO_Pos                     _U_(3)                                               /**< (LCDC_ATTR) High-End Overlay Update Attribute Position */
#define LCDC_ATTR_HEO_Msk                     (_U_(0x1) << LCDC_ATTR_HEO_Pos)                      /**< (LCDC_ATTR) High-End Overlay Update Attribute Mask */
#define LCDC_ATTR_HEO(value)                  (LCDC_ATTR_HEO_Msk & ((value) << LCDC_ATTR_HEO_Pos))
#define LCDC_ATTR_PP_Pos                      _U_(5)                                               /**< (LCDC_ATTR) Post-Processing Update Attribute Position */
#define LCDC_ATTR_PP_Msk                      (_U_(0x1) << LCDC_ATTR_PP_Pos)                       /**< (LCDC_ATTR) Post-Processing Update Attribute Mask */
#define LCDC_ATTR_PP(value)                   (LCDC_ATTR_PP_Msk & ((value) << LCDC_ATTR_PP_Pos))  
#define LCDC_ATTR_BASEA2Q_Pos                 _U_(8)                                               /**< (LCDC_ATTR) Base Layer Update Add To Queue Position */
#define LCDC_ATTR_BASEA2Q_Msk                 (_U_(0x1) << LCDC_ATTR_BASEA2Q_Pos)                  /**< (LCDC_ATTR) Base Layer Update Add To Queue Mask */
#define LCDC_ATTR_BASEA2Q(value)              (LCDC_ATTR_BASEA2Q_Msk & ((value) << LCDC_ATTR_BASEA2Q_Pos))
#define LCDC_ATTR_OVR1A2Q_Pos                 _U_(9)                                               /**< (LCDC_ATTR) Overlay 1 Update Add To Queue Position */
#define LCDC_ATTR_OVR1A2Q_Msk                 (_U_(0x1) << LCDC_ATTR_OVR1A2Q_Pos)                  /**< (LCDC_ATTR) Overlay 1 Update Add To Queue Mask */
#define LCDC_ATTR_OVR1A2Q(value)              (LCDC_ATTR_OVR1A2Q_Msk & ((value) << LCDC_ATTR_OVR1A2Q_Pos))
#define LCDC_ATTR_OVR2A2Q_Pos                 _U_(10)                                              /**< (LCDC_ATTR) Overlay 2 Update Add to Queue Position */
#define LCDC_ATTR_OVR2A2Q_Msk                 (_U_(0x1) << LCDC_ATTR_OVR2A2Q_Pos)                  /**< (LCDC_ATTR) Overlay 2 Update Add to Queue Mask */
#define LCDC_ATTR_OVR2A2Q(value)              (LCDC_ATTR_OVR2A2Q_Msk & ((value) << LCDC_ATTR_OVR2A2Q_Pos))
#define LCDC_ATTR_HEOA2Q_Pos                  _U_(11)                                              /**< (LCDC_ATTR) High-End Overlay Update Add To Queue Position */
#define LCDC_ATTR_HEOA2Q_Msk                  (_U_(0x1) << LCDC_ATTR_HEOA2Q_Pos)                   /**< (LCDC_ATTR) High-End Overlay Update Add To Queue Mask */
#define LCDC_ATTR_HEOA2Q(value)               (LCDC_ATTR_HEOA2Q_Msk & ((value) << LCDC_ATTR_HEOA2Q_Pos))
#define LCDC_ATTR_PPA2Q_Pos                   _U_(13)                                              /**< (LCDC_ATTR) Post-Processing Update Add To Queue Position */
#define LCDC_ATTR_PPA2Q_Msk                   (_U_(0x1) << LCDC_ATTR_PPA2Q_Pos)                    /**< (LCDC_ATTR) Post-Processing Update Add To Queue Mask */
#define LCDC_ATTR_PPA2Q(value)                (LCDC_ATTR_PPA2Q_Msk & ((value) << LCDC_ATTR_PPA2Q_Pos))
#define LCDC_ATTR_Msk                         _U_(0x00002F2F)                                      /**< (LCDC_ATTR) Register Mask  */

#define LCDC_ATTR_OVR_Pos                     _U_(1)                                               /**< (LCDC_ATTR Position) Overlay x Update Attribute */
#define LCDC_ATTR_OVR_Msk                     (_U_(0x3) << LCDC_ATTR_OVR_Pos)                      /**< (LCDC_ATTR Mask) OVR */
#define LCDC_ATTR_OVR(value)                  (LCDC_ATTR_OVR_Msk & ((value) << LCDC_ATTR_OVR_Pos)) 

/* -------- LCDC_BASECHER : (LCDC Offset: 0x40) ( /W 32) Base Layer Channel Enable Register -------- */
#define LCDC_BASECHER_CHEN_Pos                _U_(0)                                               /**< (LCDC_BASECHER) Channel Enable Position */
#define LCDC_BASECHER_CHEN_Msk                (_U_(0x1) << LCDC_BASECHER_CHEN_Pos)                 /**< (LCDC_BASECHER) Channel Enable Mask */
#define LCDC_BASECHER_CHEN(value)             (LCDC_BASECHER_CHEN_Msk & ((value) << LCDC_BASECHER_CHEN_Pos))
#define LCDC_BASECHER_UPDATEEN_Pos            _U_(1)                                               /**< (LCDC_BASECHER) Update Overlay Attributes Enable Position */
#define LCDC_BASECHER_UPDATEEN_Msk            (_U_(0x1) << LCDC_BASECHER_UPDATEEN_Pos)             /**< (LCDC_BASECHER) Update Overlay Attributes Enable Mask */
#define LCDC_BASECHER_UPDATEEN(value)         (LCDC_BASECHER_UPDATEEN_Msk & ((value) << LCDC_BASECHER_UPDATEEN_Pos))
#define LCDC_BASECHER_A2QEN_Pos               _U_(2)                                               /**< (LCDC_BASECHER) Add To Queue Enable Position */
#define LCDC_BASECHER_A2QEN_Msk               (_U_(0x1) << LCDC_BASECHER_A2QEN_Pos)                /**< (LCDC_BASECHER) Add To Queue Enable Mask */
#define LCDC_BASECHER_A2QEN(value)            (LCDC_BASECHER_A2QEN_Msk & ((value) << LCDC_BASECHER_A2QEN_Pos))
#define LCDC_BASECHER_Msk                     _U_(0x00000007)                                      /**< (LCDC_BASECHER) Register Mask  */


