virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_BASECHDR : (LCDC Offset: 0x44) ( /W 32) Base Layer Channel Disable Register -------- */
#define LCDC_BASECHDR_CHDIS_Pos               _U_(0)                                               /**< (LCDC_BASECHDR) Channel Disable Position */
#define LCDC_BASECHDR_CHDIS_Msk               (_U_(0x1) << LCDC_BASECHDR_CHDIS_Pos)                /**< (LCDC_BASECHDR) Channel Disable Mask */
#define LCDC_BASECHDR_CHDIS(value)            (LCDC_BASECHDR_CHDIS_Msk & ((value) << LCDC_BASECHDR_CHDIS_Pos))
#define LCDC_BASECHDR_CHRST_Pos               _U_(8)                                               /**< (LCDC_BASECHDR) Channel Reset Position */
#define LCDC_BASECHDR_CHRST_Msk               (_U_(0x1) << LCDC_BASECHDR_CHRST_Pos)                /**< (LCDC_BASECHDR) Channel Reset Mask */
#define LCDC_BASECHDR_CHRST(value)            (LCDC_BASECHDR_CHRST_Msk & ((value) << LCDC_BASECHDR_CHRST_Pos))
#define LCDC_BASECHDR_Msk                     _U_(0x00000101)                                      /**< (LCDC_BASECHDR) Register Mask  */


/* -------- LCDC_BASECHSR : (LCDC Offset: 0x48) ( R/ 32) Base Layer Channel Status Register -------- */
#define LCDC_BASECHSR_CHSR_Pos                _U_(0)                                               /**< (LCDC_BASECHSR) Channel Status Position */
#define LCDC_BASECHSR_CHSR_Msk                (_U_(0x1) << LCDC_BASECHSR_CHSR_Pos)                 /**< (LCDC_BASECHSR) Channel Status Mask */
#define LCDC_BASECHSR_CHSR(value)             (LCDC_BASECHSR_CHSR_Msk & ((value) << LCDC_BASECHSR_CHSR_Pos))
#define LCDC_BASECHSR_UPDATESR_Pos            _U_(1)                                               /**< (LCDC_BASECHSR) Update Overlay Attributes In Progress Status Position */
#define LCDC_BASECHSR_UPDATESR_Msk            (_U_(0x1) << LCDC_BASECHSR_UPDATESR_Pos)             /**< (LCDC_BASECHSR) Update Overlay Attributes In Progress Status Mask */
#define LCDC_BASECHSR_UPDATESR(value)         (LCDC_BASECHSR_UPDATESR_Msk & ((value) << LCDC_BASECHSR_UPDATESR_Pos))
#define LCDC_BASECHSR_A2QSR_Pos               _U_(2)                                               /**< (LCDC_BASECHSR) Add To Queue Status Position */
#define LCDC_BASECHSR_A2QSR_Msk               (_U_(0x1) << LCDC_BASECHSR_A2QSR_Pos)                /**< (LCDC_BASECHSR) Add To Queue Status Mask */
#define LCDC_BASECHSR_A2QSR(value)            (LCDC_BASECHSR_A2QSR_Msk & ((value) << LCDC_BASECHSR_A2QSR_Pos))
#define LCDC_BASECHSR_Msk                     _U_(0x00000007)                                      /**< (LCDC_BASECHSR) Register Mask  */


/* -------- LCDC_BASEIER : (LCDC Offset: 0x4C) ( /W 32) Base Layer Interrupt Enable Register -------- */
#define LCDC_BASEIER_DMA_Pos                  _U_(2)                                               /**< (LCDC_BASEIER) End of DMA Transfer Interrupt Enable Position */
#define LCDC_BASEIER_DMA_Msk                  (_U_(0x1) << LCDC_BASEIER_DMA_Pos)                   /**< (LCDC_BASEIER) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_BASEIER_DMA(value)               (LCDC_BASEIER_DMA_Msk & ((value) << LCDC_BASEIER_DMA_Pos))
#define LCDC_BASEIER_DSCR_Pos                 _U_(3)                                               /**< (LCDC_BASEIER) Descriptor Loaded Interrupt Enable Position */
#define LCDC_BASEIER_DSCR_Msk                 (_U_(0x1) << LCDC_BASEIER_DSCR_Pos)                  /**< (LCDC_BASEIER) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_BASEIER_DSCR(value)              (LCDC_BASEIER_DSCR_Msk & ((value) << LCDC_BASEIER_DSCR_Pos))
#define LCDC_BASEIER_ADD_Pos                  _U_(4)                                               /**< (LCDC_BASEIER) Head Descriptor Loaded Interrupt Enable Position */
#define LCDC_BASEIER_ADD_Msk                  (_U_(0x1) << LCDC_BASEIER_ADD_Pos)                   /**< (LCDC_BASEIER) Head Descriptor Loaded Interrupt Enable Mask */
#define LCDC_BASEIER_ADD(value)               (LCDC_BASEIER_ADD_Msk & ((value) << LCDC_BASEIER_ADD_Pos))
#define LCDC_BASEIER_DONE_Pos                 _U_(5)                                               /**< (LCDC_BASEIER) End of List Interrupt Enable Position */
#define LCDC_BASEIER_DONE_Msk                 (_U_(0x1) << LCDC_BASEIER_DONE_Pos)                  /**< (LCDC_BASEIER) End of List Interrupt Enable Mask */
#define LCDC_BASEIER_DONE(value)              (LCDC_BASEIER_DONE_Msk & ((value) << LCDC_BASEIER_DONE_Pos))
#define LCDC_BASEIER_OVR_Pos                  _U_(6)                                               /**< (LCDC_BASEIER) Overflow Interrupt Enable Position */
#define LCDC_BASEIER_OVR_Msk                  (_U_(0x1) << LCDC_BASEIER_OVR_Pos)                   /**< (LCDC_BASEIER) Overflow Interrupt Enable Mask */
#define LCDC_BASEIER_OVR(value)               (LCDC_BASEIER_OVR_Msk & ((value) << LCDC_BASEIER_OVR_Pos))
#define LCDC_BASEIER_Msk                      _U_(0x0000007C)                                      /**< (LCDC_BASEIER) Register Mask  */


/* -------- LCDC_BASEIDR : (LCDC Offset: 0x50) ( /W 32) Base Layer Interrupt Disabled Register -------- */
#define LCDC_BASEIDR_DMA_Pos                  _U_(2)                                               /**< (LCDC_BASEIDR) End of DMA Transfer Interrupt Disable Position */
#define LCDC_BASEIDR_DMA_Msk                  (_U_(0x1) << LCDC_BASEIDR_DMA_Pos)                   /**< (LCDC_BASEIDR) End of DMA Transfer Interrupt Disable Mask */
#define LCDC_BASEIDR_DMA(value)               (LCDC_BASEIDR_DMA_Msk & ((value) << LCDC_BASEIDR_DMA_Pos))
#define LCDC_BASEIDR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_BASEIDR) Descriptor Loaded Interrupt Disable Position */
#define LCDC_BASEIDR_DSCR_Msk                 (_U_(0x1) << LCDC_BASEIDR_DSCR_Pos)                  /**< (LCDC_BASEIDR) Descriptor Loaded Interrupt Disable Mask */
#define LCDC_BASEIDR_DSCR(value)              (LCDC_BASEIDR_DSCR_Msk & ((value) << LCDC_BASEIDR_DSCR_Pos))
#define LCDC_BASEIDR_ADD_Pos                  _U_(4)                                               /**< (LCDC_BASEIDR) Head Descriptor Loaded Interrupt Disable Position */
#define LCDC_BASEIDR_ADD_Msk                  (_U_(0x1) << LCDC_BASEIDR_ADD_Pos)                   /**< (LCDC_BASEIDR) Head Descriptor Loaded Interrupt Disable Mask */
#define LCDC_BASEIDR_ADD(value)               (LCDC_BASEIDR_ADD_Msk & ((value) << LCDC_BASEIDR_ADD_Pos))
#define LCDC_BASEIDR_DONE_Pos                 _U_(5)                                               /**< (LCDC_BASEIDR) End of List Interrupt Disable Position */
#define LCDC_BASEIDR_DONE_Msk                 (_U_(0x1) << LCDC_BASEIDR_DONE_Pos)                  /**< (LCDC_BASEIDR) End of List Interrupt Disable Mask */
#define LCDC_BASEIDR_DONE(value)              (LCDC_BASEIDR_DONE_Msk & ((value) << LCDC_BASEIDR_DONE_Pos))
#define LCDC_BASEIDR_OVR_Pos                  _U_(6)                                               /**< (LCDC_BASEIDR) Overflow Interrupt Disable Position */
#define LCDC_BASEIDR_OVR_Msk                  (_U_(0x1) << LCDC_BASEIDR_OVR_Pos)                   /**< (LCDC_BASEIDR) Overflow Interrupt Disable Mask */
#define LCDC_BASEIDR_OVR(value)               (LCDC_BASEIDR_OVR_Msk & ((value) << LCDC_BASEIDR_OVR_Pos))
#define LCDC_BASEIDR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_BASEIDR) Register Mask  */


/* -------- LCDC_BASEIMR : (LCDC Offset: 0x54) ( R/ 32) Base Layer Interrupt Mask Register -------- */
#define LCDC_BASEIMR_DMA_Pos                  _U_(2)                                               /**< (LCDC_BASEIMR) End of DMA Transfer Interrupt Mask Position */
#define LCDC_BASEIMR_DMA_Msk                  (_U_(0x1) << LCDC_BASEIMR_DMA_Pos)                   /**< (LCDC_BASEIMR) End of DMA Transfer Interrupt Mask Mask */
#define LCDC_BASEIMR_DMA(value)               (LCDC_BASEIMR_DMA_Msk & ((value) << LCDC_BASEIMR_DMA_Pos))
#define LCDC_BASEIMR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_BASEIMR) Descriptor Loaded Interrupt Mask Position */
#define LCDC_BASEIMR_DSCR_Msk                 (_U_(0x1) << LCDC_BASEIMR_DSCR_Pos)                  /**< (LCDC_BASEIMR) Descriptor Loaded Interrupt Mask Mask */
#define LCDC_BASEIMR_DSCR(value)              (LCDC_BASEIMR_DSCR_Msk & ((value) << LCDC_BASEIMR_DSCR_Pos))
#define LCDC_BASEIMR_ADD_Pos                  _U_(4)                                               /**< (LCDC_BASEIMR) Head Descriptor Loaded Interrupt Mask Position */
#define LCDC_BASEIMR_ADD_Msk                  (_U_(0x1) << LCDC_BASEIMR_ADD_Pos)                   /**< (LCDC_BASEIMR) Head Descriptor Loaded Interrupt Mask Mask */
#define LCDC_BASEIMR_ADD(value)               (LCDC_BASEIMR_ADD_Msk & ((value) << LCDC_BASEIMR_ADD_Pos))
#define LCDC_BASEIMR_DONE_Pos                 _U_(5)                                               /**< (LCDC_BASEIMR) End of List Interrupt Mask Position */
#define LCDC_BASEIMR_DONE_Msk                 (_U_(0x1) << LCDC_BASEIMR_DONE_Pos)                  /**< (LCDC_BASEIMR) End of List Interrupt Mask Mask */
#define LCDC_BASEIMR_DONE(value)              (LCDC_BASEIMR_DONE_Msk & ((value) << LCDC_BASEIMR_DONE_Pos))
#define LCDC_BASEIMR_OVR_Pos                  _U_(6)                                               /**< (LCDC_BASEIMR) Overflow Interrupt Mask Position */
#define LCDC_BASEIMR_OVR_Msk                  (_U_(0x1) << LCDC_BASEIMR_OVR_Pos)                   /**< (LCDC_BASEIMR) Overflow Interrupt Mask Mask */
#define LCDC_BASEIMR_OVR(value)               (LCDC_BASEIMR_OVR_Msk & ((value) << LCDC_BASEIMR_OVR_Pos))
#define LCDC_BASEIMR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_BASEIMR) Register Mask  */


/* -------- LCDC_BASEISR : (LCDC Offset: 0x58) ( R/ 32) Base Layer Interrupt Status Register -------- */
#define LCDC_BASEISR_DMA_Pos                  _U_(2)                                               /**< (LCDC_BASEISR) End of DMA Transfer Position */
#define LCDC_BASEISR_DMA_Msk                  (_U_(0x1) << LCDC_BASEISR_DMA_Pos)                   /**< (LCDC_BASEISR) End of DMA Transfer Mask */
#define LCDC_BASEISR_DMA(value)               (LCDC_BASEISR_DMA_Msk & ((value) << LCDC_BASEISR_DMA_Pos))
#define LCDC_BASEISR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_BASEISR) DMA Descriptor Loaded Position */
#define LCDC_BASEISR_DSCR_Msk                 (_U_(0x1) << LCDC_BASEISR_DSCR_Pos)                  /**< (LCDC_BASEISR) DMA Descriptor Loaded Mask */
#define LCDC_BASEISR_DSCR(value)              (LCDC_BASEISR_DSCR_Msk & ((value) << LCDC_BASEISR_DSCR_Pos))
#define LCDC_BASEISR_ADD_Pos                  _U_(4)                                               /**< (LCDC_BASEISR) Head Descriptor Loaded Position */
#define LCDC_BASEISR_ADD_Msk                  (_U_(0x1) << LCDC_BASEISR_ADD_Pos)                   /**< (LCDC_BASEISR) Head Descriptor Loaded Mask */
#define LCDC_BASEISR_ADD(value)               (LCDC_BASEISR_ADD_Msk & ((value) << LCDC_BASEISR_ADD_Pos))
#define LCDC_BASEISR_DONE_Pos                 _U_(5)                                               /**< (LCDC_BASEISR) End of List Detected Position */
#define LCDC_BASEISR_DONE_Msk                 (_U_(0x1) << LCDC_BASEISR_DONE_Pos)                  /**< (LCDC_BASEISR) End of List Detected Mask */
#define LCDC_BASEISR_DONE(value)              (LCDC_BASEISR_DONE_Msk & ((value) << LCDC_BASEISR_DONE_Pos))
#define LCDC_BASEISR_OVR_Pos                  _U_(6)                                               /**< (LCDC_BASEISR) Overflow Detected Position */
#define LCDC_BASEISR_OVR_Msk                  (_U_(0x1) << LCDC_BASEISR_OVR_Pos)                   /**< (LCDC_BASEISR) Overflow Detected Mask */
#define LCDC_BASEISR_OVR(value)               (LCDC_BASEISR_OVR_Msk & ((value) << LCDC_BASEISR_OVR_Pos))
#define LCDC_BASEISR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_BASEISR) Register Mask  */


/* -------- LCDC_BASEHEAD : (LCDC Offset: 0x5C) (R/W 32) Base DMA Head Register -------- */
#define LCDC_BASEHEAD_HEAD_Pos                _U_(2)                                               /**< (LCDC_BASEHEAD) DMA Head Pointer Position */
#define LCDC_BASEHEAD_HEAD_Msk                (_U_(0x3FFFFFFF) << LCDC_BASEHEAD_HEAD_Pos)          /**< (LCDC_BASEHEAD) DMA Head Pointer Mask */
#define LCDC_BASEHEAD_HEAD(value)             (LCDC_BASEHEAD_HEAD_Msk & ((value) << LCDC_BASEHEAD_HEAD_Pos))
#define LCDC_BASEHEAD_Msk                     _U_(0xFFFFFFFC)                                      /**< (LCDC_BASEHEAD) Register Mask  */


/* -------- LCDC_BASEADDR : (LCDC Offset: 0x60) (R/W 32) Base DMA Address Register -------- */
#define LCDC_BASEADDR_ADDR_Pos                _U_(0)                                               /**< (LCDC_BASEADDR) DMA Transfer Start Address Position */
#define LCDC_BASEADDR_ADDR_Msk                (_U_(0xFFFFFFFF) << LCDC_BASEADDR_ADDR_Pos)          /**< (LCDC_BASEADDR) DMA Transfer Start Address Mask */
#define LCDC_BASEADDR_ADDR(value)             (LCDC_BASEADDR_ADDR_Msk & ((value) << LCDC_BASEADDR_ADDR_Pos))
#define LCDC_BASEADDR_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_BASEADDR) Register Mask  */


/* -------- LCDC_BASECTRL : (LCDC Offset: 0x64) (R/W 32) Base DMA Control Register -------- */
#define LCDC_BASECTRL_DFETCH_Pos              _U_(0)                                               /**< (LCDC_BASECTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_BASECTRL_DFETCH_Msk              (_U_(0x1) << LCDC_BASECTRL_DFETCH_Pos)               /**< (LCDC_BASECTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_BASECTRL_DFETCH(value)           (LCDC_BASECTRL_DFETCH_Msk & ((value) << LCDC_BASECTRL_DFETCH_Pos))
#define LCDC_BASECTRL_LFETCH_Pos              _U_(1)                                               /**< (LCDC_BASECTRL) Lookup Table Fetch Enable Position */
#define LCDC_BASECTRL_LFETCH_Msk              (_U_(0x1) << LCDC_BASECTRL_LFETCH_Pos)               /**< (LCDC_BASECTRL) Lookup Table Fetch Enable Mask */
#define LCDC_BASECTRL_LFETCH(value)           (LCDC_BASECTRL_LFETCH_Msk & ((value) << LCDC_BASECTRL_LFETCH_Pos))
#define LCDC_BASECTRL_DMAIEN_Pos              _U_(2)                                               /**< (LCDC_BASECTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_BASECTRL_DMAIEN_Msk              (_U_(0x1) << LCDC_BASECTRL_DMAIEN_Pos)               /**< (LCDC_BASECTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_BASECTRL_DMAIEN(value)           (LCDC_BASECTRL_DMAIEN_Msk & ((value) << LCDC_BASECTRL_DMAIEN_Pos))
#define LCDC_BASECTRL_DSCRIEN_Pos             _U_(3)                                               /**< (LCDC_BASECTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_BASECTRL_DSCRIEN_Msk             (_U_(0x1) << LCDC_BASECTRL_DSCRIEN_Pos)              /**< (LCDC_BASECTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_BASECTRL_DSCRIEN(value)          (LCDC_BASECTRL_DSCRIEN_Msk & ((value) << LCDC_BASECTRL_DSCRIEN_Pos))
#define LCDC_BASECTRL_ADDIEN_Pos              _U_(4)                                               /**< (LCDC_BASECTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_BASECTRL_ADDIEN_Msk              (_U_(0x1) << LCDC_BASECTRL_ADDIEN_Pos)               /**< (LCDC_BASECTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_BASECTRL_ADDIEN(value)           (LCDC_BASECTRL_ADDIEN_Msk & ((value) << LCDC_BASECTRL_ADDIEN_Pos))
#define LCDC_BASECTRL_DONEIEN_Pos             _U_(5)                                               /**< (LCDC_BASECTRL) End of List Interrupt Enable Position */
#define LCDC_BASECTRL_DONEIEN_Msk             (_U_(0x1) << LCDC_BASECTRL_DONEIEN_Pos)              /**< (LCDC_BASECTRL) End of List Interrupt Enable Mask */
#define LCDC_BASECTRL_DONEIEN(value)          (LCDC_BASECTRL_DONEIEN_Msk & ((value) << LCDC_BASECTRL_DONEIEN_Pos))
#define LCDC_BASECTRL_Msk                     _U_(0x0000003F)                                      /**< (LCDC_BASECTRL) Register Mask  */


/* -------- LCDC_BASENEXT : (LCDC Offset: 0x68) (R/W 32) Base DMA Next Register -------- */
#define LCDC_BASENEXT_NEXT_Pos                _U_(0)                                               /**< (LCDC_BASENEXT) DMA Descriptor Next Address Position */
#define LCDC_BASENEXT_NEXT_Msk                (_U_(0xFFFFFFFF) << LCDC_BASENEXT_NEXT_Pos)          /**< (LCDC_BASENEXT) DMA Descriptor Next Address Mask */
#define LCDC_BASENEXT_NEXT(value)             (LCDC_BASENEXT_NEXT_Msk & ((value) << LCDC_BASENEXT_NEXT_Pos))
#define LCDC_BASENEXT_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_BASENEXT) Register Mask  */


/* -------- LCDC_BASECFG0 : (LCDC Offset: 0x6C) (R/W 32) Base Layer Configuration Register 0 -------- */
#define LCDC_BASECFG0_SIF_Pos                 _U_(0)                                               /**< (LCDC_BASECFG0) Source Interface Position */
#define LCDC_BASECFG0_SIF_Msk                 (_U_(0x1) << LCDC_BASECFG0_SIF_Pos)                  /**< (LCDC_BASECFG0) Source Interface Mask */
#define LCDC_BASECFG0_SIF(value)              (LCDC_BASECFG0_SIF_Msk & ((value) << LCDC_BASECFG0_SIF_Pos))
#define LCDC_BASECFG0_BLEN_Pos                _U_(4)                                               /**< (LCDC_BASECFG0) AHB Burst Length Position */
#define LCDC_BASECFG0_BLEN_Msk                (_U_(0x3) << LCDC_BASECFG0_BLEN_Pos)                 /**< (LCDC_BASECFG0) AHB Burst Length Mask */
#define LCDC_BASECFG0_BLEN(value)             (LCDC_BASECFG0_BLEN_Msk & ((value) << LCDC_BASECFG0_BLEN_Pos))
#define   LCDC_BASECFG0_BLEN_AHB_SINGLE_Val   _U_(0x0)                                             /**< (LCDC_BASECFG0) AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_BASECFG0_BLEN_AHB_INCR4_Val    _U_(0x1)                                             /**< (LCDC_BASECFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_BASECFG0_BLEN_AHB_INCR8_Val    _U_(0x2)                                             /**< (LCDC_BASECFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_BASECFG0_BLEN_AHB_INCR16_Val   _U_(0x3)                                             /**< (LCDC_BASECFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define LCDC_BASECFG0_BLEN_AHB_SINGLE         (LCDC_BASECFG0_BLEN_AHB_SINGLE_Val << LCDC_BASECFG0_BLEN_Pos) /**< (LCDC_BASECFG0) AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_BASECFG0_BLEN_AHB_INCR4          (LCDC_BASECFG0_BLEN_AHB_INCR4_Val << LCDC_BASECFG0_BLEN_Pos) /**< (LCDC_BASECFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_BASECFG0_BLEN_AHB_INCR8          (LCDC_BASECFG0_BLEN_AHB_INCR8_Val << LCDC_BASECFG0_BLEN_Pos) /**< (LCDC_BASECFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_BASECFG0_BLEN_AHB_INCR16         (LCDC_BASECFG0_BLEN_AHB_INCR16_Val << LCDC_BASECFG0_BLEN_Pos) /**< (LCDC_BASECFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_BASECFG0_DLBO_Pos                _U_(8)                                               /**< (LCDC_BASECFG0) Defined Length Burst Only For Channel Bus Transaction Position */
#define LCDC_BASECFG0_DLBO_Msk                (_U_(0x1) << LCDC_BASECFG0_DLBO_Pos)                 /**< (LCDC_BASECFG0) Defined Length Burst Only For Channel Bus Transaction Mask */
#define LCDC_BASECFG0_DLBO(value)             (LCDC_BASECFG0_DLBO_Msk & ((value) << LCDC_BASECFG0_DLBO_Pos))
#define LCDC_BASECFG0_Msk                     _U_(0x00000131)                                      /**< (LCDC_BASECFG0) Register Mask  */


