virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_BASECFG4 : (LCDC Offset: 0x7C) (R/W 32) Base Layer Configuration Register 4 -------- */
#define LCDC_BASECFG4_DMA_Pos                 _U_(8)                                               /**< (LCDC_BASECFG4) Use DMA Data Path Position */
#define LCDC_BASECFG4_DMA_Msk                 (_U_(0x1) << LCDC_BASECFG4_DMA_Pos)                  /**< (LCDC_BASECFG4) Use DMA Data Path Mask */
#define LCDC_BASECFG4_DMA(value)              (LCDC_BASECFG4_DMA_Msk & ((value) << LCDC_BASECFG4_DMA_Pos))
#define LCDC_BASECFG4_REP_Pos                 _U_(9)                                               /**< (LCDC_BASECFG4) Use Replication logic to expand RGB color to 24 bits Position */
#define LCDC_BASECFG4_REP_Msk                 (_U_(0x1) << LCDC_BASECFG4_REP_Pos)                  /**< (LCDC_BASECFG4) Use Replication logic to expand RGB color to 24 bits Mask */
#define LCDC_BASECFG4_REP(value)              (LCDC_BASECFG4_REP_Msk & ((value) << LCDC_BASECFG4_REP_Pos))
#define LCDC_BASECFG4_DISCEN_Pos              _U_(11)                                              /**< (LCDC_BASECFG4) Discard Area Enable Position */
#define LCDC_BASECFG4_DISCEN_Msk              (_U_(0x1) << LCDC_BASECFG4_DISCEN_Pos)               /**< (LCDC_BASECFG4) Discard Area Enable Mask */
#define LCDC_BASECFG4_DISCEN(value)           (LCDC_BASECFG4_DISCEN_Msk & ((value) << LCDC_BASECFG4_DISCEN_Pos))
#define LCDC_BASECFG4_Msk                     _U_(0x00000B00)                                      /**< (LCDC_BASECFG4) Register Mask  */


/* -------- LCDC_BASECFG5 : (LCDC Offset: 0x80) (R/W 32) Base Layer Configuration Register 5 -------- */
#define LCDC_BASECFG5_DISCXPOS_Pos            _U_(0)                                               /**< (LCDC_BASECFG5) Discard Area Horizontal Coordinate Position */
#define LCDC_BASECFG5_DISCXPOS_Msk            (_U_(0x7FF) << LCDC_BASECFG5_DISCXPOS_Pos)           /**< (LCDC_BASECFG5) Discard Area Horizontal Coordinate Mask */
#define LCDC_BASECFG5_DISCXPOS(value)         (LCDC_BASECFG5_DISCXPOS_Msk & ((value) << LCDC_BASECFG5_DISCXPOS_Pos))
#define LCDC_BASECFG5_DISCYPOS_Pos            _U_(16)                                              /**< (LCDC_BASECFG5) Discard Area Vertical Coordinate Position */
#define LCDC_BASECFG5_DISCYPOS_Msk            (_U_(0x7FF) << LCDC_BASECFG5_DISCYPOS_Pos)           /**< (LCDC_BASECFG5) Discard Area Vertical Coordinate Mask */
#define LCDC_BASECFG5_DISCYPOS(value)         (LCDC_BASECFG5_DISCYPOS_Msk & ((value) << LCDC_BASECFG5_DISCYPOS_Pos))
#define LCDC_BASECFG5_Msk                     _U_(0x07FF07FF)                                      /**< (LCDC_BASECFG5) Register Mask  */


/* -------- LCDC_BASECFG6 : (LCDC Offset: 0x84) (R/W 32) Base Layer Configuration Register 6 -------- */
#define LCDC_BASECFG6_DISCXSIZE_Pos           _U_(0)                                               /**< (LCDC_BASECFG6) Discard Area Horizontal Size Position */
#define LCDC_BASECFG6_DISCXSIZE_Msk           (_U_(0x7FF) << LCDC_BASECFG6_DISCXSIZE_Pos)          /**< (LCDC_BASECFG6) Discard Area Horizontal Size Mask */
#define LCDC_BASECFG6_DISCXSIZE(value)        (LCDC_BASECFG6_DISCXSIZE_Msk & ((value) << LCDC_BASECFG6_DISCXSIZE_Pos))
#define LCDC_BASECFG6_DISCYSIZE_Pos           _U_(16)                                              /**< (LCDC_BASECFG6) Discard Area Vertical Size Position */
#define LCDC_BASECFG6_DISCYSIZE_Msk           (_U_(0x7FF) << LCDC_BASECFG6_DISCYSIZE_Pos)          /**< (LCDC_BASECFG6) Discard Area Vertical Size Mask */
#define LCDC_BASECFG6_DISCYSIZE(value)        (LCDC_BASECFG6_DISCYSIZE_Msk & ((value) << LCDC_BASECFG6_DISCYSIZE_Pos))
#define LCDC_BASECFG6_Msk                     _U_(0x07FF07FF)                                      /**< (LCDC_BASECFG6) Register Mask  */


/* -------- LCDC_OVR1CHER : (LCDC Offset: 0x140) ( /W 32) Overlay 1 Channel Enable Register -------- */
#define LCDC_OVR1CHER_CHEN_Pos                _U_(0)                                               /**< (LCDC_OVR1CHER) Channel Enable Position */
#define LCDC_OVR1CHER_CHEN_Msk                (_U_(0x1) << LCDC_OVR1CHER_CHEN_Pos)                 /**< (LCDC_OVR1CHER) Channel Enable Mask */
#define LCDC_OVR1CHER_CHEN(value)             (LCDC_OVR1CHER_CHEN_Msk & ((value) << LCDC_OVR1CHER_CHEN_Pos))
#define LCDC_OVR1CHER_UPDATEEN_Pos            _U_(1)                                               /**< (LCDC_OVR1CHER) Update Overlay Attributes Enable Position */
#define LCDC_OVR1CHER_UPDATEEN_Msk            (_U_(0x1) << LCDC_OVR1CHER_UPDATEEN_Pos)             /**< (LCDC_OVR1CHER) Update Overlay Attributes Enable Mask */
#define LCDC_OVR1CHER_UPDATEEN(value)         (LCDC_OVR1CHER_UPDATEEN_Msk & ((value) << LCDC_OVR1CHER_UPDATEEN_Pos))
#define LCDC_OVR1CHER_A2QEN_Pos               _U_(2)                                               /**< (LCDC_OVR1CHER) Add To Queue Enable Position */
#define LCDC_OVR1CHER_A2QEN_Msk               (_U_(0x1) << LCDC_OVR1CHER_A2QEN_Pos)                /**< (LCDC_OVR1CHER) Add To Queue Enable Mask */
#define LCDC_OVR1CHER_A2QEN(value)            (LCDC_OVR1CHER_A2QEN_Msk & ((value) << LCDC_OVR1CHER_A2QEN_Pos))
#define LCDC_OVR1CHER_Msk                     _U_(0x00000007)                                      /**< (LCDC_OVR1CHER) Register Mask  */


/* -------- LCDC_OVR1CHDR : (LCDC Offset: 0x144) ( /W 32) Overlay 1 Channel Disable Register -------- */
#define LCDC_OVR1CHDR_CHDIS_Pos               _U_(0)                                               /**< (LCDC_OVR1CHDR) Channel Disable Position */
#define LCDC_OVR1CHDR_CHDIS_Msk               (_U_(0x1) << LCDC_OVR1CHDR_CHDIS_Pos)                /**< (LCDC_OVR1CHDR) Channel Disable Mask */
#define LCDC_OVR1CHDR_CHDIS(value)            (LCDC_OVR1CHDR_CHDIS_Msk & ((value) << LCDC_OVR1CHDR_CHDIS_Pos))
#define LCDC_OVR1CHDR_CHRST_Pos               _U_(8)                                               /**< (LCDC_OVR1CHDR) Channel Reset Position */
#define LCDC_OVR1CHDR_CHRST_Msk               (_U_(0x1) << LCDC_OVR1CHDR_CHRST_Pos)                /**< (LCDC_OVR1CHDR) Channel Reset Mask */
#define LCDC_OVR1CHDR_CHRST(value)            (LCDC_OVR1CHDR_CHRST_Msk & ((value) << LCDC_OVR1CHDR_CHRST_Pos))
#define LCDC_OVR1CHDR_Msk                     _U_(0x00000101)                                      /**< (LCDC_OVR1CHDR) Register Mask  */


/* -------- LCDC_OVR1CHSR : (LCDC Offset: 0x148) ( R/ 32) Overlay 1 Channel Status Register -------- */
#define LCDC_OVR1CHSR_CHSR_Pos                _U_(0)                                               /**< (LCDC_OVR1CHSR) Channel Status Position */
#define LCDC_OVR1CHSR_CHSR_Msk                (_U_(0x1) << LCDC_OVR1CHSR_CHSR_Pos)                 /**< (LCDC_OVR1CHSR) Channel Status Mask */
#define LCDC_OVR1CHSR_CHSR(value)             (LCDC_OVR1CHSR_CHSR_Msk & ((value) << LCDC_OVR1CHSR_CHSR_Pos))
#define LCDC_OVR1CHSR_UPDATESR_Pos            _U_(1)                                               /**< (LCDC_OVR1CHSR) Update Overlay Attributes In Progress Status Position */
#define LCDC_OVR1CHSR_UPDATESR_Msk            (_U_(0x1) << LCDC_OVR1CHSR_UPDATESR_Pos)             /**< (LCDC_OVR1CHSR) Update Overlay Attributes In Progress Status Mask */
#define LCDC_OVR1CHSR_UPDATESR(value)         (LCDC_OVR1CHSR_UPDATESR_Msk & ((value) << LCDC_OVR1CHSR_UPDATESR_Pos))
#define LCDC_OVR1CHSR_A2QSR_Pos               _U_(2)                                               /**< (LCDC_OVR1CHSR) Add To Queue Status Position */
#define LCDC_OVR1CHSR_A2QSR_Msk               (_U_(0x1) << LCDC_OVR1CHSR_A2QSR_Pos)                /**< (LCDC_OVR1CHSR) Add To Queue Status Mask */
#define LCDC_OVR1CHSR_A2QSR(value)            (LCDC_OVR1CHSR_A2QSR_Msk & ((value) << LCDC_OVR1CHSR_A2QSR_Pos))
#define LCDC_OVR1CHSR_Msk                     _U_(0x00000007)                                      /**< (LCDC_OVR1CHSR) Register Mask  */


