virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_OVR1IER : (LCDC Offset: 0x14C) ( /W 32) Overlay 1 Interrupt Enable Register -------- */
#define LCDC_OVR1IER_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR1IER) End of DMA Transfer Interrupt Enable Position */
#define LCDC_OVR1IER_DMA_Msk                  (_U_(0x1) << LCDC_OVR1IER_DMA_Pos)                   /**< (LCDC_OVR1IER) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_OVR1IER_DMA(value)               (LCDC_OVR1IER_DMA_Msk & ((value) << LCDC_OVR1IER_DMA_Pos))
#define LCDC_OVR1IER_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR1IER) Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR1IER_DSCR_Msk                 (_U_(0x1) << LCDC_OVR1IER_DSCR_Pos)                  /**< (LCDC_OVR1IER) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR1IER_DSCR(value)              (LCDC_OVR1IER_DSCR_Msk & ((value) << LCDC_OVR1IER_DSCR_Pos))
#define LCDC_OVR1IER_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR1IER) Head Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR1IER_ADD_Msk                  (_U_(0x1) << LCDC_OVR1IER_ADD_Pos)                   /**< (LCDC_OVR1IER) Head Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR1IER_ADD(value)               (LCDC_OVR1IER_ADD_Msk & ((value) << LCDC_OVR1IER_ADD_Pos))
#define LCDC_OVR1IER_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR1IER) End of List Interrupt Enable Position */
#define LCDC_OVR1IER_DONE_Msk                 (_U_(0x1) << LCDC_OVR1IER_DONE_Pos)                  /**< (LCDC_OVR1IER) End of List Interrupt Enable Mask */
#define LCDC_OVR1IER_DONE(value)              (LCDC_OVR1IER_DONE_Msk & ((value) << LCDC_OVR1IER_DONE_Pos))
#define LCDC_OVR1IER_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR1IER) Overflow Interrupt Enable Position */
#define LCDC_OVR1IER_OVR_Msk                  (_U_(0x1) << LCDC_OVR1IER_OVR_Pos)                   /**< (LCDC_OVR1IER) Overflow Interrupt Enable Mask */
#define LCDC_OVR1IER_OVR(value)               (LCDC_OVR1IER_OVR_Msk & ((value) << LCDC_OVR1IER_OVR_Pos))
#define LCDC_OVR1IER_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR1IER) Register Mask  */


/* -------- LCDC_OVR1IDR : (LCDC Offset: 0x150) ( /W 32) Overlay 1 Interrupt Disable Register -------- */
#define LCDC_OVR1IDR_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR1IDR) End of DMA Transfer Interrupt Disable Position */
#define LCDC_OVR1IDR_DMA_Msk                  (_U_(0x1) << LCDC_OVR1IDR_DMA_Pos)                   /**< (LCDC_OVR1IDR) End of DMA Transfer Interrupt Disable Mask */
#define LCDC_OVR1IDR_DMA(value)               (LCDC_OVR1IDR_DMA_Msk & ((value) << LCDC_OVR1IDR_DMA_Pos))
#define LCDC_OVR1IDR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR1IDR) Descriptor Loaded Interrupt Disable Position */
#define LCDC_OVR1IDR_DSCR_Msk                 (_U_(0x1) << LCDC_OVR1IDR_DSCR_Pos)                  /**< (LCDC_OVR1IDR) Descriptor Loaded Interrupt Disable Mask */
#define LCDC_OVR1IDR_DSCR(value)              (LCDC_OVR1IDR_DSCR_Msk & ((value) << LCDC_OVR1IDR_DSCR_Pos))
#define LCDC_OVR1IDR_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR1IDR) Head Descriptor Loaded Interrupt Disable Position */
#define LCDC_OVR1IDR_ADD_Msk                  (_U_(0x1) << LCDC_OVR1IDR_ADD_Pos)                   /**< (LCDC_OVR1IDR) Head Descriptor Loaded Interrupt Disable Mask */
#define LCDC_OVR1IDR_ADD(value)               (LCDC_OVR1IDR_ADD_Msk & ((value) << LCDC_OVR1IDR_ADD_Pos))
#define LCDC_OVR1IDR_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR1IDR) End of List Interrupt Disable Position */
#define LCDC_OVR1IDR_DONE_Msk                 (_U_(0x1) << LCDC_OVR1IDR_DONE_Pos)                  /**< (LCDC_OVR1IDR) End of List Interrupt Disable Mask */
#define LCDC_OVR1IDR_DONE(value)              (LCDC_OVR1IDR_DONE_Msk & ((value) << LCDC_OVR1IDR_DONE_Pos))
#define LCDC_OVR1IDR_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR1IDR) Overflow Interrupt Disable Position */
#define LCDC_OVR1IDR_OVR_Msk                  (_U_(0x1) << LCDC_OVR1IDR_OVR_Pos)                   /**< (LCDC_OVR1IDR) Overflow Interrupt Disable Mask */
#define LCDC_OVR1IDR_OVR(value)               (LCDC_OVR1IDR_OVR_Msk & ((value) << LCDC_OVR1IDR_OVR_Pos))
#define LCDC_OVR1IDR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR1IDR) Register Mask  */


/* -------- LCDC_OVR1IMR : (LCDC Offset: 0x154) ( R/ 32) Overlay 1 Interrupt Mask Register -------- */
#define LCDC_OVR1IMR_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR1IMR) End of DMA Transfer Interrupt Mask Position */
#define LCDC_OVR1IMR_DMA_Msk                  (_U_(0x1) << LCDC_OVR1IMR_DMA_Pos)                   /**< (LCDC_OVR1IMR) End of DMA Transfer Interrupt Mask Mask */
#define LCDC_OVR1IMR_DMA(value)               (LCDC_OVR1IMR_DMA_Msk & ((value) << LCDC_OVR1IMR_DMA_Pos))
#define LCDC_OVR1IMR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR1IMR) Descriptor Loaded Interrupt Mask Position */
#define LCDC_OVR1IMR_DSCR_Msk                 (_U_(0x1) << LCDC_OVR1IMR_DSCR_Pos)                  /**< (LCDC_OVR1IMR) Descriptor Loaded Interrupt Mask Mask */
#define LCDC_OVR1IMR_DSCR(value)              (LCDC_OVR1IMR_DSCR_Msk & ((value) << LCDC_OVR1IMR_DSCR_Pos))
#define LCDC_OVR1IMR_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR1IMR) Head Descriptor Loaded Interrupt Mask Position */
#define LCDC_OVR1IMR_ADD_Msk                  (_U_(0x1) << LCDC_OVR1IMR_ADD_Pos)                   /**< (LCDC_OVR1IMR) Head Descriptor Loaded Interrupt Mask Mask */
#define LCDC_OVR1IMR_ADD(value)               (LCDC_OVR1IMR_ADD_Msk & ((value) << LCDC_OVR1IMR_ADD_Pos))
#define LCDC_OVR1IMR_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR1IMR) End of List Interrupt Mask Position */
#define LCDC_OVR1IMR_DONE_Msk                 (_U_(0x1) << LCDC_OVR1IMR_DONE_Pos)                  /**< (LCDC_OVR1IMR) End of List Interrupt Mask Mask */
#define LCDC_OVR1IMR_DONE(value)              (LCDC_OVR1IMR_DONE_Msk & ((value) << LCDC_OVR1IMR_DONE_Pos))
#define LCDC_OVR1IMR_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR1IMR) Overflow Interrupt Mask Position */
#define LCDC_OVR1IMR_OVR_Msk                  (_U_(0x1) << LCDC_OVR1IMR_OVR_Pos)                   /**< (LCDC_OVR1IMR) Overflow Interrupt Mask Mask */
#define LCDC_OVR1IMR_OVR(value)               (LCDC_OVR1IMR_OVR_Msk & ((value) << LCDC_OVR1IMR_OVR_Pos))
#define LCDC_OVR1IMR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR1IMR) Register Mask  */


/* -------- LCDC_OVR1ISR : (LCDC Offset: 0x158) ( R/ 32) Overlay 1 Interrupt Status Register -------- */
#define LCDC_OVR1ISR_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR1ISR) End of DMA Transfer Position */
#define LCDC_OVR1ISR_DMA_Msk                  (_U_(0x1) << LCDC_OVR1ISR_DMA_Pos)                   /**< (LCDC_OVR1ISR) End of DMA Transfer Mask */
#define LCDC_OVR1ISR_DMA(value)               (LCDC_OVR1ISR_DMA_Msk & ((value) << LCDC_OVR1ISR_DMA_Pos))
#define LCDC_OVR1ISR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR1ISR) DMA Descriptor Loaded Position */
#define LCDC_OVR1ISR_DSCR_Msk                 (_U_(0x1) << LCDC_OVR1ISR_DSCR_Pos)                  /**< (LCDC_OVR1ISR) DMA Descriptor Loaded Mask */
#define LCDC_OVR1ISR_DSCR(value)              (LCDC_OVR1ISR_DSCR_Msk & ((value) << LCDC_OVR1ISR_DSCR_Pos))
#define LCDC_OVR1ISR_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR1ISR) Head Descriptor Loaded Position */
#define LCDC_OVR1ISR_ADD_Msk                  (_U_(0x1) << LCDC_OVR1ISR_ADD_Pos)                   /**< (LCDC_OVR1ISR) Head Descriptor Loaded Mask */
#define LCDC_OVR1ISR_ADD(value)               (LCDC_OVR1ISR_ADD_Msk & ((value) << LCDC_OVR1ISR_ADD_Pos))
#define LCDC_OVR1ISR_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR1ISR) End of List Detected Position */
#define LCDC_OVR1ISR_DONE_Msk                 (_U_(0x1) << LCDC_OVR1ISR_DONE_Pos)                  /**< (LCDC_OVR1ISR) End of List Detected Mask */
#define LCDC_OVR1ISR_DONE(value)              (LCDC_OVR1ISR_DONE_Msk & ((value) << LCDC_OVR1ISR_DONE_Pos))
#define LCDC_OVR1ISR_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR1ISR) Overflow Detected Position */
#define LCDC_OVR1ISR_OVR_Msk                  (_U_(0x1) << LCDC_OVR1ISR_OVR_Pos)                   /**< (LCDC_OVR1ISR) Overflow Detected Mask */
#define LCDC_OVR1ISR_OVR(value)               (LCDC_OVR1ISR_OVR_Msk & ((value) << LCDC_OVR1ISR_OVR_Pos))
#define LCDC_OVR1ISR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR1ISR) Register Mask  */


/* -------- LCDC_OVR1HEAD : (LCDC Offset: 0x15C) (R/W 32) Overlay 1 DMA Head Register -------- */
#define LCDC_OVR1HEAD_HEAD_Pos                _U_(2)                                               /**< (LCDC_OVR1HEAD) DMA Head Pointer Position */
#define LCDC_OVR1HEAD_HEAD_Msk                (_U_(0x3FFFFFFF) << LCDC_OVR1HEAD_HEAD_Pos)          /**< (LCDC_OVR1HEAD) DMA Head Pointer Mask */
#define LCDC_OVR1HEAD_HEAD(value)             (LCDC_OVR1HEAD_HEAD_Msk & ((value) << LCDC_OVR1HEAD_HEAD_Pos))
#define LCDC_OVR1HEAD_Msk                     _U_(0xFFFFFFFC)                                      /**< (LCDC_OVR1HEAD) Register Mask  */


/* -------- LCDC_OVR1ADDR : (LCDC Offset: 0x160) (R/W 32) Overlay 1 DMA Address Register -------- */
#define LCDC_OVR1ADDR_ADDR_Pos                _U_(0)                                               /**< (LCDC_OVR1ADDR) DMA Transfer Overlay 1 Address Position */
#define LCDC_OVR1ADDR_ADDR_Msk                (_U_(0xFFFFFFFF) << LCDC_OVR1ADDR_ADDR_Pos)          /**< (LCDC_OVR1ADDR) DMA Transfer Overlay 1 Address Mask */
#define LCDC_OVR1ADDR_ADDR(value)             (LCDC_OVR1ADDR_ADDR_Msk & ((value) << LCDC_OVR1ADDR_ADDR_Pos))
#define LCDC_OVR1ADDR_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_OVR1ADDR) Register Mask  */


