virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_OVR1CFG3 : (LCDC Offset: 0x178) (R/W 32) Overlay 1 Configuration Register 3 -------- */
#define LCDC_OVR1CFG3_XSIZE_Pos               _U_(0)                                               /**< (LCDC_OVR1CFG3) Horizontal Window Size Position */
#define LCDC_OVR1CFG3_XSIZE_Msk               (_U_(0x7FF) << LCDC_OVR1CFG3_XSIZE_Pos)              /**< (LCDC_OVR1CFG3) Horizontal Window Size Mask */
#define LCDC_OVR1CFG3_XSIZE(value)            (LCDC_OVR1CFG3_XSIZE_Msk & ((value) << LCDC_OVR1CFG3_XSIZE_Pos))
#define LCDC_OVR1CFG3_YSIZE_Pos               _U_(16)                                              /**< (LCDC_OVR1CFG3) Vertical Window Size Position */
#define LCDC_OVR1CFG3_YSIZE_Msk               (_U_(0x7FF) << LCDC_OVR1CFG3_YSIZE_Pos)              /**< (LCDC_OVR1CFG3) Vertical Window Size Mask */
#define LCDC_OVR1CFG3_YSIZE(value)            (LCDC_OVR1CFG3_YSIZE_Msk & ((value) << LCDC_OVR1CFG3_YSIZE_Pos))
#define LCDC_OVR1CFG3_Msk                     _U_(0x07FF07FF)                                      /**< (LCDC_OVR1CFG3) Register Mask  */


/* -------- LCDC_OVR1CFG4 : (LCDC Offset: 0x17C) (R/W 32) Overlay 1 Configuration Register 4 -------- */
#define LCDC_OVR1CFG4_XSTRIDE_Pos             _U_(0)                                               /**< (LCDC_OVR1CFG4) Horizontal Stride Position */
#define LCDC_OVR1CFG4_XSTRIDE_Msk             (_U_(0xFFFFFFFF) << LCDC_OVR1CFG4_XSTRIDE_Pos)       /**< (LCDC_OVR1CFG4) Horizontal Stride Mask */
#define LCDC_OVR1CFG4_XSTRIDE(value)          (LCDC_OVR1CFG4_XSTRIDE_Msk & ((value) << LCDC_OVR1CFG4_XSTRIDE_Pos))
#define LCDC_OVR1CFG4_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_OVR1CFG4) Register Mask  */


/* -------- LCDC_OVR1CFG5 : (LCDC Offset: 0x180) (R/W 32) Overlay 1 Configuration Register 5 -------- */
#define LCDC_OVR1CFG5_PSTRIDE_Pos             _U_(0)                                               /**< (LCDC_OVR1CFG5) Pixel Stride Position */
#define LCDC_OVR1CFG5_PSTRIDE_Msk             (_U_(0xFFFFFFFF) << LCDC_OVR1CFG5_PSTRIDE_Pos)       /**< (LCDC_OVR1CFG5) Pixel Stride Mask */
#define LCDC_OVR1CFG5_PSTRIDE(value)          (LCDC_OVR1CFG5_PSTRIDE_Msk & ((value) << LCDC_OVR1CFG5_PSTRIDE_Pos))
#define LCDC_OVR1CFG5_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_OVR1CFG5) Register Mask  */


/* -------- LCDC_OVR1CFG6 : (LCDC Offset: 0x184) (R/W 32) Overlay 1 Configuration Register 6 -------- */
#define LCDC_OVR1CFG6_BDEF_Pos                _U_(0)                                               /**< (LCDC_OVR1CFG6) Blue Default Position */
#define LCDC_OVR1CFG6_BDEF_Msk                (_U_(0xFF) << LCDC_OVR1CFG6_BDEF_Pos)                /**< (LCDC_OVR1CFG6) Blue Default Mask */
#define LCDC_OVR1CFG6_BDEF(value)             (LCDC_OVR1CFG6_BDEF_Msk & ((value) << LCDC_OVR1CFG6_BDEF_Pos))
#define LCDC_OVR1CFG6_GDEF_Pos                _U_(8)                                               /**< (LCDC_OVR1CFG6) Green Default Position */
#define LCDC_OVR1CFG6_GDEF_Msk                (_U_(0xFF) << LCDC_OVR1CFG6_GDEF_Pos)                /**< (LCDC_OVR1CFG6) Green Default Mask */
#define LCDC_OVR1CFG6_GDEF(value)             (LCDC_OVR1CFG6_GDEF_Msk & ((value) << LCDC_OVR1CFG6_GDEF_Pos))
#define LCDC_OVR1CFG6_RDEF_Pos                _U_(16)                                              /**< (LCDC_OVR1CFG6) Red Default Position */
#define LCDC_OVR1CFG6_RDEF_Msk                (_U_(0xFF) << LCDC_OVR1CFG6_RDEF_Pos)                /**< (LCDC_OVR1CFG6) Red Default Mask */
#define LCDC_OVR1CFG6_RDEF(value)             (LCDC_OVR1CFG6_RDEF_Msk & ((value) << LCDC_OVR1CFG6_RDEF_Pos))
#define LCDC_OVR1CFG6_Msk                     _U_(0x00FFFFFF)                                      /**< (LCDC_OVR1CFG6) Register Mask  */


/* -------- LCDC_OVR1CFG7 : (LCDC Offset: 0x188) (R/W 32) Overlay 1 Configuration Register 7 -------- */
#define LCDC_OVR1CFG7_BKEY_Pos                _U_(0)                                               /**< (LCDC_OVR1CFG7) Blue Color Component Chroma Key Position */
#define LCDC_OVR1CFG7_BKEY_Msk                (_U_(0xFF) << LCDC_OVR1CFG7_BKEY_Pos)                /**< (LCDC_OVR1CFG7) Blue Color Component Chroma Key Mask */
#define LCDC_OVR1CFG7_BKEY(value)             (LCDC_OVR1CFG7_BKEY_Msk & ((value) << LCDC_OVR1CFG7_BKEY_Pos))
#define LCDC_OVR1CFG7_GKEY_Pos                _U_(8)                                               /**< (LCDC_OVR1CFG7) Green Color Component Chroma Key Position */
#define LCDC_OVR1CFG7_GKEY_Msk                (_U_(0xFF) << LCDC_OVR1CFG7_GKEY_Pos)                /**< (LCDC_OVR1CFG7) Green Color Component Chroma Key Mask */
#define LCDC_OVR1CFG7_GKEY(value)             (LCDC_OVR1CFG7_GKEY_Msk & ((value) << LCDC_OVR1CFG7_GKEY_Pos))
#define LCDC_OVR1CFG7_RKEY_Pos                _U_(16)                                              /**< (LCDC_OVR1CFG7) Red Color Component Chroma Key Position */
#define LCDC_OVR1CFG7_RKEY_Msk                (_U_(0xFF) << LCDC_OVR1CFG7_RKEY_Pos)                /**< (LCDC_OVR1CFG7) Red Color Component Chroma Key Mask */
#define LCDC_OVR1CFG7_RKEY(value)             (LCDC_OVR1CFG7_RKEY_Msk & ((value) << LCDC_OVR1CFG7_RKEY_Pos))
#define LCDC_OVR1CFG7_Msk                     _U_(0x00FFFFFF)                                      /**< (LCDC_OVR1CFG7) Register Mask  */


/* -------- LCDC_OVR1CFG8 : (LCDC Offset: 0x18C) (R/W 32) Overlay 1 Configuration Register 8 -------- */
#define LCDC_OVR1CFG8_BMASK_Pos               _U_(0)                                               /**< (LCDC_OVR1CFG8) Blue Color Component Chroma Key Mask Position */
#define LCDC_OVR1CFG8_BMASK_Msk               (_U_(0xFF) << LCDC_OVR1CFG8_BMASK_Pos)               /**< (LCDC_OVR1CFG8) Blue Color Component Chroma Key Mask Mask */
#define LCDC_OVR1CFG8_BMASK(value)            (LCDC_OVR1CFG8_BMASK_Msk & ((value) << LCDC_OVR1CFG8_BMASK_Pos))
#define LCDC_OVR1CFG8_GMASK_Pos               _U_(8)                                               /**< (LCDC_OVR1CFG8) Green Color Component Chroma Key Mask Position */
#define LCDC_OVR1CFG8_GMASK_Msk               (_U_(0xFF) << LCDC_OVR1CFG8_GMASK_Pos)               /**< (LCDC_OVR1CFG8) Green Color Component Chroma Key Mask Mask */
#define LCDC_OVR1CFG8_GMASK(value)            (LCDC_OVR1CFG8_GMASK_Msk & ((value) << LCDC_OVR1CFG8_GMASK_Pos))
#define LCDC_OVR1CFG8_RMASK_Pos               _U_(16)                                              /**< (LCDC_OVR1CFG8) Red Color Component Chroma Key Mask Position */
#define LCDC_OVR1CFG8_RMASK_Msk               (_U_(0xFF) << LCDC_OVR1CFG8_RMASK_Pos)               /**< (LCDC_OVR1CFG8) Red Color Component Chroma Key Mask Mask */
#define LCDC_OVR1CFG8_RMASK(value)            (LCDC_OVR1CFG8_RMASK_Msk & ((value) << LCDC_OVR1CFG8_RMASK_Pos))
#define LCDC_OVR1CFG8_Msk                     _U_(0x00FFFFFF)                                      /**< (LCDC_OVR1CFG8) Register Mask  */


/* -------- LCDC_OVR1CFG9 : (LCDC Offset: 0x190) (R/W 32) Overlay 1 Configuration Register 9 -------- */
#define LCDC_OVR1CFG9_CRKEY_Pos               _U_(0)                                               /**< (LCDC_OVR1CFG9) Blender Chroma Key Enable Position */
#define LCDC_OVR1CFG9_CRKEY_Msk               (_U_(0x1) << LCDC_OVR1CFG9_CRKEY_Pos)                /**< (LCDC_OVR1CFG9) Blender Chroma Key Enable Mask */
#define LCDC_OVR1CFG9_CRKEY(value)            (LCDC_OVR1CFG9_CRKEY_Msk & ((value) << LCDC_OVR1CFG9_CRKEY_Pos))
#define LCDC_OVR1CFG9_INV_Pos                 _U_(1)                                               /**< (LCDC_OVR1CFG9) Blender Inverted Blender Output Enable Position */
#define LCDC_OVR1CFG9_INV_Msk                 (_U_(0x1) << LCDC_OVR1CFG9_INV_Pos)                  /**< (LCDC_OVR1CFG9) Blender Inverted Blender Output Enable Mask */
#define LCDC_OVR1CFG9_INV(value)              (LCDC_OVR1CFG9_INV_Msk & ((value) << LCDC_OVR1CFG9_INV_Pos))
#define LCDC_OVR1CFG9_ITER2BL_Pos             _U_(2)                                               /**< (LCDC_OVR1CFG9) Blender Iterated Color Enable Position */
#define LCDC_OVR1CFG9_ITER2BL_Msk             (_U_(0x1) << LCDC_OVR1CFG9_ITER2BL_Pos)              /**< (LCDC_OVR1CFG9) Blender Iterated Color Enable Mask */
#define LCDC_OVR1CFG9_ITER2BL(value)          (LCDC_OVR1CFG9_ITER2BL_Msk & ((value) << LCDC_OVR1CFG9_ITER2BL_Pos))
#define LCDC_OVR1CFG9_ITER_Pos                _U_(3)                                               /**< (LCDC_OVR1CFG9) Blender Use Iterated Color Position */
#define LCDC_OVR1CFG9_ITER_Msk                (_U_(0x1) << LCDC_OVR1CFG9_ITER_Pos)                 /**< (LCDC_OVR1CFG9) Blender Use Iterated Color Mask */
#define LCDC_OVR1CFG9_ITER(value)             (LCDC_OVR1CFG9_ITER_Msk & ((value) << LCDC_OVR1CFG9_ITER_Pos))
#define LCDC_OVR1CFG9_REVALPHA_Pos            _U_(4)                                               /**< (LCDC_OVR1CFG9) Blender Reverse Alpha Position */
#define LCDC_OVR1CFG9_REVALPHA_Msk            (_U_(0x1) << LCDC_OVR1CFG9_REVALPHA_Pos)             /**< (LCDC_OVR1CFG9) Blender Reverse Alpha Mask */
#define LCDC_OVR1CFG9_REVALPHA(value)         (LCDC_OVR1CFG9_REVALPHA_Msk & ((value) << LCDC_OVR1CFG9_REVALPHA_Pos))
#define LCDC_OVR1CFG9_GAEN_Pos                _U_(5)                                               /**< (LCDC_OVR1CFG9) Blender Global Alpha Enable Position */
#define LCDC_OVR1CFG9_GAEN_Msk                (_U_(0x1) << LCDC_OVR1CFG9_GAEN_Pos)                 /**< (LCDC_OVR1CFG9) Blender Global Alpha Enable Mask */
#define LCDC_OVR1CFG9_GAEN(value)             (LCDC_OVR1CFG9_GAEN_Msk & ((value) << LCDC_OVR1CFG9_GAEN_Pos))
#define LCDC_OVR1CFG9_LAEN_Pos                _U_(6)                                               /**< (LCDC_OVR1CFG9) Blender Local Alpha Enable Position */
#define LCDC_OVR1CFG9_LAEN_Msk                (_U_(0x1) << LCDC_OVR1CFG9_LAEN_Pos)                 /**< (LCDC_OVR1CFG9) Blender Local Alpha Enable Mask */
#define LCDC_OVR1CFG9_LAEN(value)             (LCDC_OVR1CFG9_LAEN_Msk & ((value) << LCDC_OVR1CFG9_LAEN_Pos))
#define LCDC_OVR1CFG9_OVR_Pos                 _U_(7)                                               /**< (LCDC_OVR1CFG9) Blender Overlay Layer Enable Position */
#define LCDC_OVR1CFG9_OVR_Msk                 (_U_(0x1) << LCDC_OVR1CFG9_OVR_Pos)                  /**< (LCDC_OVR1CFG9) Blender Overlay Layer Enable Mask */
#define LCDC_OVR1CFG9_OVR(value)              (LCDC_OVR1CFG9_OVR_Msk & ((value) << LCDC_OVR1CFG9_OVR_Pos))
#define LCDC_OVR1CFG9_DMA_Pos                 _U_(8)                                               /**< (LCDC_OVR1CFG9) Blender DMA Layer Enable Position */
#define LCDC_OVR1CFG9_DMA_Msk                 (_U_(0x1) << LCDC_OVR1CFG9_DMA_Pos)                  /**< (LCDC_OVR1CFG9) Blender DMA Layer Enable Mask */
#define LCDC_OVR1CFG9_DMA(value)              (LCDC_OVR1CFG9_DMA_Msk & ((value) << LCDC_OVR1CFG9_DMA_Pos))
#define LCDC_OVR1CFG9_REP_Pos                 _U_(9)                                               /**< (LCDC_OVR1CFG9) Use Replication logic to expand RGB color to 24 bits Position */
#define LCDC_OVR1CFG9_REP_Msk                 (_U_(0x1) << LCDC_OVR1CFG9_REP_Pos)                  /**< (LCDC_OVR1CFG9) Use Replication logic to expand RGB color to 24 bits Mask */
#define LCDC_OVR1CFG9_REP(value)              (LCDC_OVR1CFG9_REP_Msk & ((value) << LCDC_OVR1CFG9_REP_Pos))
#define LCDC_OVR1CFG9_DSTKEY_Pos              _U_(10)                                              /**< (LCDC_OVR1CFG9) Destination Chroma Keying Position */
#define LCDC_OVR1CFG9_DSTKEY_Msk              (_U_(0x1) << LCDC_OVR1CFG9_DSTKEY_Pos)               /**< (LCDC_OVR1CFG9) Destination Chroma Keying Mask */
#define LCDC_OVR1CFG9_DSTKEY(value)           (LCDC_OVR1CFG9_DSTKEY_Msk & ((value) << LCDC_OVR1CFG9_DSTKEY_Pos))
#define LCDC_OVR1CFG9_GA_Pos                  _U_(16)                                              /**< (LCDC_OVR1CFG9) Blender Global Alpha Position */
#define LCDC_OVR1CFG9_GA_Msk                  (_U_(0xFF) << LCDC_OVR1CFG9_GA_Pos)                  /**< (LCDC_OVR1CFG9) Blender Global Alpha Mask */
#define LCDC_OVR1CFG9_GA(value)               (LCDC_OVR1CFG9_GA_Msk & ((value) << LCDC_OVR1CFG9_GA_Pos))
#define LCDC_OVR1CFG9_Msk                     _U_(0x00FF07FF)                                      /**< (LCDC_OVR1CFG9) Register Mask  */


/* -------- LCDC_OVR2CHER : (LCDC Offset: 0x240) ( /W 32) Overlay 2 Channel Enable Register -------- */
#define LCDC_OVR2CHER_CHEN_Pos                _U_(0)                                               /**< (LCDC_OVR2CHER) Channel Enable Position */
#define LCDC_OVR2CHER_CHEN_Msk                (_U_(0x1) << LCDC_OVR2CHER_CHEN_Pos)                 /**< (LCDC_OVR2CHER) Channel Enable Mask */
#define LCDC_OVR2CHER_CHEN(value)             (LCDC_OVR2CHER_CHEN_Msk & ((value) << LCDC_OVR2CHER_CHEN_Pos))
#define LCDC_OVR2CHER_UPDATEEN_Pos            _U_(1)                                               /**< (LCDC_OVR2CHER) Update Overlay Attributes Enable Position */
#define LCDC_OVR2CHER_UPDATEEN_Msk            (_U_(0x1) << LCDC_OVR2CHER_UPDATEEN_Pos)             /**< (LCDC_OVR2CHER) Update Overlay Attributes Enable Mask */
#define LCDC_OVR2CHER_UPDATEEN(value)         (LCDC_OVR2CHER_UPDATEEN_Msk & ((value) << LCDC_OVR2CHER_UPDATEEN_Pos))
#define LCDC_OVR2CHER_A2QEN_Pos               _U_(2)                                               /**< (LCDC_OVR2CHER) Add To Queue Enable Position */
#define LCDC_OVR2CHER_A2QEN_Msk               (_U_(0x1) << LCDC_OVR2CHER_A2QEN_Pos)                /**< (LCDC_OVR2CHER) Add To Queue Enable Mask */
#define LCDC_OVR2CHER_A2QEN(value)            (LCDC_OVR2CHER_A2QEN_Msk & ((value) << LCDC_OVR2CHER_A2QEN_Pos))
#define LCDC_OVR2CHER_Msk                     _U_(0x00000007)                                      /**< (LCDC_OVR2CHER) Register Mask  */


/* -------- LCDC_OVR2CHDR : (LCDC Offset: 0x244) ( /W 32) Overlay 2 Channel Disable Register -------- */
#define LCDC_OVR2CHDR_CHDIS_Pos               _U_(0)                                               /**< (LCDC_OVR2CHDR) Channel Disable Position */
#define LCDC_OVR2CHDR_CHDIS_Msk               (_U_(0x1) << LCDC_OVR2CHDR_CHDIS_Pos)                /**< (LCDC_OVR2CHDR) Channel Disable Mask */
#define LCDC_OVR2CHDR_CHDIS(value)            (LCDC_OVR2CHDR_CHDIS_Msk & ((value) << LCDC_OVR2CHDR_CHDIS_Pos))
#define LCDC_OVR2CHDR_CHRST_Pos               _U_(8)                                               /**< (LCDC_OVR2CHDR) Channel Reset Position */
#define LCDC_OVR2CHDR_CHRST_Msk               (_U_(0x1) << LCDC_OVR2CHDR_CHRST_Pos)                /**< (LCDC_OVR2CHDR) Channel Reset Mask */
#define LCDC_OVR2CHDR_CHRST(value)            (LCDC_OVR2CHDR_CHRST_Msk & ((value) << LCDC_OVR2CHDR_CHRST_Pos))
#define LCDC_OVR2CHDR_Msk                     _U_(0x00000101)                                      /**< (LCDC_OVR2CHDR) Register Mask  */


