virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_OVR2CFG9 : (LCDC Offset: 0x290) (R/W 32) Overlay 2 Configuration Register 9 -------- */
#define LCDC_OVR2CFG9_CRKEY_Pos               _U_(0)                                               /**< (LCDC_OVR2CFG9) Blender Chroma Key Enable Position */
#define LCDC_OVR2CFG9_CRKEY_Msk               (_U_(0x1) << LCDC_OVR2CFG9_CRKEY_Pos)                /**< (LCDC_OVR2CFG9) Blender Chroma Key Enable Mask */
#define LCDC_OVR2CFG9_CRKEY(value)            (LCDC_OVR2CFG9_CRKEY_Msk & ((value) << LCDC_OVR2CFG9_CRKEY_Pos))
#define LCDC_OVR2CFG9_INV_Pos                 _U_(1)                                               /**< (LCDC_OVR2CFG9) Blender Inverted Blender Output Enable Position */
#define LCDC_OVR2CFG9_INV_Msk                 (_U_(0x1) << LCDC_OVR2CFG9_INV_Pos)                  /**< (LCDC_OVR2CFG9) Blender Inverted Blender Output Enable Mask */
#define LCDC_OVR2CFG9_INV(value)              (LCDC_OVR2CFG9_INV_Msk & ((value) << LCDC_OVR2CFG9_INV_Pos))
#define LCDC_OVR2CFG9_ITER2BL_Pos             _U_(2)                                               /**< (LCDC_OVR2CFG9) Blender Iterated Color Enable Position */
#define LCDC_OVR2CFG9_ITER2BL_Msk             (_U_(0x1) << LCDC_OVR2CFG9_ITER2BL_Pos)              /**< (LCDC_OVR2CFG9) Blender Iterated Color Enable Mask */
#define LCDC_OVR2CFG9_ITER2BL(value)          (LCDC_OVR2CFG9_ITER2BL_Msk & ((value) << LCDC_OVR2CFG9_ITER2BL_Pos))
#define LCDC_OVR2CFG9_ITER_Pos                _U_(3)                                               /**< (LCDC_OVR2CFG9) Blender Use Iterated Color Position */
#define LCDC_OVR2CFG9_ITER_Msk                (_U_(0x1) << LCDC_OVR2CFG9_ITER_Pos)                 /**< (LCDC_OVR2CFG9) Blender Use Iterated Color Mask */
#define LCDC_OVR2CFG9_ITER(value)             (LCDC_OVR2CFG9_ITER_Msk & ((value) << LCDC_OVR2CFG9_ITER_Pos))
#define LCDC_OVR2CFG9_REVALPHA_Pos            _U_(4)                                               /**< (LCDC_OVR2CFG9) Blender Reverse Alpha Position */
#define LCDC_OVR2CFG9_REVALPHA_Msk            (_U_(0x1) << LCDC_OVR2CFG9_REVALPHA_Pos)             /**< (LCDC_OVR2CFG9) Blender Reverse Alpha Mask */
#define LCDC_OVR2CFG9_REVALPHA(value)         (LCDC_OVR2CFG9_REVALPHA_Msk & ((value) << LCDC_OVR2CFG9_REVALPHA_Pos))
#define LCDC_OVR2CFG9_GAEN_Pos                _U_(5)                                               /**< (LCDC_OVR2CFG9) Blender Global Alpha Enable Position */
#define LCDC_OVR2CFG9_GAEN_Msk                (_U_(0x1) << LCDC_OVR2CFG9_GAEN_Pos)                 /**< (LCDC_OVR2CFG9) Blender Global Alpha Enable Mask */
#define LCDC_OVR2CFG9_GAEN(value)             (LCDC_OVR2CFG9_GAEN_Msk & ((value) << LCDC_OVR2CFG9_GAEN_Pos))
#define LCDC_OVR2CFG9_LAEN_Pos                _U_(6)                                               /**< (LCDC_OVR2CFG9) Blender Local Alpha Enable Position */
#define LCDC_OVR2CFG9_LAEN_Msk                (_U_(0x1) << LCDC_OVR2CFG9_LAEN_Pos)                 /**< (LCDC_OVR2CFG9) Blender Local Alpha Enable Mask */
#define LCDC_OVR2CFG9_LAEN(value)             (LCDC_OVR2CFG9_LAEN_Msk & ((value) << LCDC_OVR2CFG9_LAEN_Pos))
#define LCDC_OVR2CFG9_OVR_Pos                 _U_(7)                                               /**< (LCDC_OVR2CFG9) Blender Overlay Layer Enable Position */
#define LCDC_OVR2CFG9_OVR_Msk                 (_U_(0x1) << LCDC_OVR2CFG9_OVR_Pos)                  /**< (LCDC_OVR2CFG9) Blender Overlay Layer Enable Mask */
#define LCDC_OVR2CFG9_OVR(value)              (LCDC_OVR2CFG9_OVR_Msk & ((value) << LCDC_OVR2CFG9_OVR_Pos))
#define LCDC_OVR2CFG9_DMA_Pos                 _U_(8)                                               /**< (LCDC_OVR2CFG9) Blender DMA Layer Enable Position */
#define LCDC_OVR2CFG9_DMA_Msk                 (_U_(0x1) << LCDC_OVR2CFG9_DMA_Pos)                  /**< (LCDC_OVR2CFG9) Blender DMA Layer Enable Mask */
#define LCDC_OVR2CFG9_DMA(value)              (LCDC_OVR2CFG9_DMA_Msk & ((value) << LCDC_OVR2CFG9_DMA_Pos))
#define LCDC_OVR2CFG9_REP_Pos                 _U_(9)                                               /**< (LCDC_OVR2CFG9) Use Replication logic to expand RGB color to 24 bits Position */
#define LCDC_OVR2CFG9_REP_Msk                 (_U_(0x1) << LCDC_OVR2CFG9_REP_Pos)                  /**< (LCDC_OVR2CFG9) Use Replication logic to expand RGB color to 24 bits Mask */
#define LCDC_OVR2CFG9_REP(value)              (LCDC_OVR2CFG9_REP_Msk & ((value) << LCDC_OVR2CFG9_REP_Pos))
#define LCDC_OVR2CFG9_DSTKEY_Pos              _U_(10)                                              /**< (LCDC_OVR2CFG9) Destination Chroma Keying Position */
#define LCDC_OVR2CFG9_DSTKEY_Msk              (_U_(0x1) << LCDC_OVR2CFG9_DSTKEY_Pos)               /**< (LCDC_OVR2CFG9) Destination Chroma Keying Mask */
#define LCDC_OVR2CFG9_DSTKEY(value)           (LCDC_OVR2CFG9_DSTKEY_Msk & ((value) << LCDC_OVR2CFG9_DSTKEY_Pos))
#define LCDC_OVR2CFG9_GA_Pos                  _U_(16)                                              /**< (LCDC_OVR2CFG9) Blender Global Alpha Position */
#define LCDC_OVR2CFG9_GA_Msk                  (_U_(0xFF) << LCDC_OVR2CFG9_GA_Pos)                  /**< (LCDC_OVR2CFG9) Blender Global Alpha Mask */
#define LCDC_OVR2CFG9_GA(value)               (LCDC_OVR2CFG9_GA_Msk & ((value) << LCDC_OVR2CFG9_GA_Pos))
#define LCDC_OVR2CFG9_Msk                     _U_(0x00FF07FF)                                      /**< (LCDC_OVR2CFG9) Register Mask  */


/* -------- LCDC_HEOCHER : (LCDC Offset: 0x340) ( /W 32) High-End Overlay Channel Enable Register -------- */
#define LCDC_HEOCHER_CHEN_Pos                 _U_(0)                                               /**< (LCDC_HEOCHER) Channel Enable Position */
#define LCDC_HEOCHER_CHEN_Msk                 (_U_(0x1) << LCDC_HEOCHER_CHEN_Pos)                  /**< (LCDC_HEOCHER) Channel Enable Mask */
#define LCDC_HEOCHER_CHEN(value)              (LCDC_HEOCHER_CHEN_Msk & ((value) << LCDC_HEOCHER_CHEN_Pos))
#define LCDC_HEOCHER_UPDATEEN_Pos             _U_(1)                                               /**< (LCDC_HEOCHER) Update Overlay Attributes Enable Position */
#define LCDC_HEOCHER_UPDATEEN_Msk             (_U_(0x1) << LCDC_HEOCHER_UPDATEEN_Pos)              /**< (LCDC_HEOCHER) Update Overlay Attributes Enable Mask */
#define LCDC_HEOCHER_UPDATEEN(value)          (LCDC_HEOCHER_UPDATEEN_Msk & ((value) << LCDC_HEOCHER_UPDATEEN_Pos))
#define LCDC_HEOCHER_A2QEN_Pos                _U_(2)                                               /**< (LCDC_HEOCHER) Add To Queue Enable Position */
#define LCDC_HEOCHER_A2QEN_Msk                (_U_(0x1) << LCDC_HEOCHER_A2QEN_Pos)                 /**< (LCDC_HEOCHER) Add To Queue Enable Mask */
#define LCDC_HEOCHER_A2QEN(value)             (LCDC_HEOCHER_A2QEN_Msk & ((value) << LCDC_HEOCHER_A2QEN_Pos))
#define LCDC_HEOCHER_Msk                      _U_(0x00000007)                                      /**< (LCDC_HEOCHER) Register Mask  */


/* -------- LCDC_HEOCHDR : (LCDC Offset: 0x344) ( /W 32) High-End Overlay Channel Disable Register -------- */
#define LCDC_HEOCHDR_CHDIS_Pos                _U_(0)                                               /**< (LCDC_HEOCHDR) Channel Disable Position */
#define LCDC_HEOCHDR_CHDIS_Msk                (_U_(0x1) << LCDC_HEOCHDR_CHDIS_Pos)                 /**< (LCDC_HEOCHDR) Channel Disable Mask */
#define LCDC_HEOCHDR_CHDIS(value)             (LCDC_HEOCHDR_CHDIS_Msk & ((value) << LCDC_HEOCHDR_CHDIS_Pos))
#define LCDC_HEOCHDR_CHRST_Pos                _U_(8)                                               /**< (LCDC_HEOCHDR) Channel Reset Position */
#define LCDC_HEOCHDR_CHRST_Msk                (_U_(0x1) << LCDC_HEOCHDR_CHRST_Pos)                 /**< (LCDC_HEOCHDR) Channel Reset Mask */
#define LCDC_HEOCHDR_CHRST(value)             (LCDC_HEOCHDR_CHRST_Msk & ((value) << LCDC_HEOCHDR_CHRST_Pos))
#define LCDC_HEOCHDR_Msk                      _U_(0x00000101)                                      /**< (LCDC_HEOCHDR) Register Mask  */


/* -------- LCDC_HEOCHSR : (LCDC Offset: 0x348) ( R/ 32) High-End Overlay Channel Status Register -------- */
#define LCDC_HEOCHSR_CHSR_Pos                 _U_(0)                                               /**< (LCDC_HEOCHSR) Channel Status Position */
#define LCDC_HEOCHSR_CHSR_Msk                 (_U_(0x1) << LCDC_HEOCHSR_CHSR_Pos)                  /**< (LCDC_HEOCHSR) Channel Status Mask */
#define LCDC_HEOCHSR_CHSR(value)              (LCDC_HEOCHSR_CHSR_Msk & ((value) << LCDC_HEOCHSR_CHSR_Pos))
#define LCDC_HEOCHSR_UPDATESR_Pos             _U_(1)                                               /**< (LCDC_HEOCHSR) Update Overlay Attributes In Progress Status Position */
#define LCDC_HEOCHSR_UPDATESR_Msk             (_U_(0x1) << LCDC_HEOCHSR_UPDATESR_Pos)              /**< (LCDC_HEOCHSR) Update Overlay Attributes In Progress Status Mask */
#define LCDC_HEOCHSR_UPDATESR(value)          (LCDC_HEOCHSR_UPDATESR_Msk & ((value) << LCDC_HEOCHSR_UPDATESR_Pos))
#define LCDC_HEOCHSR_A2QSR_Pos                _U_(2)                                               /**< (LCDC_HEOCHSR) Add To Queue Status Position */
#define LCDC_HEOCHSR_A2QSR_Msk                (_U_(0x1) << LCDC_HEOCHSR_A2QSR_Pos)                 /**< (LCDC_HEOCHSR) Add To Queue Status Mask */
#define LCDC_HEOCHSR_A2QSR(value)             (LCDC_HEOCHSR_A2QSR_Msk & ((value) << LCDC_HEOCHSR_A2QSR_Pos))
#define LCDC_HEOCHSR_Msk                      _U_(0x00000007)                                      /**< (LCDC_HEOCHSR) Register Mask  */


/* -------- LCDC_HEOIER : (LCDC Offset: 0x34C) ( /W 32) High-End Overlay Interrupt Enable Register -------- */
#define LCDC_HEOIER_DMA_Pos                   _U_(2)                                               /**< (LCDC_HEOIER) End of DMA Transfer Interrupt Enable Position */
#define LCDC_HEOIER_DMA_Msk                   (_U_(0x1) << LCDC_HEOIER_DMA_Pos)                    /**< (LCDC_HEOIER) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_HEOIER_DMA(value)                (LCDC_HEOIER_DMA_Msk & ((value) << LCDC_HEOIER_DMA_Pos))
#define LCDC_HEOIER_DSCR_Pos                  _U_(3)                                               /**< (LCDC_HEOIER) Descriptor Loaded Interrupt Enable Position */
#define LCDC_HEOIER_DSCR_Msk                  (_U_(0x1) << LCDC_HEOIER_DSCR_Pos)                   /**< (LCDC_HEOIER) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_HEOIER_DSCR(value)               (LCDC_HEOIER_DSCR_Msk & ((value) << LCDC_HEOIER_DSCR_Pos))
#define LCDC_HEOIER_ADD_Pos                   _U_(4)                                               /**< (LCDC_HEOIER) Head Descriptor Loaded Interrupt Enable Position */
#define LCDC_HEOIER_ADD_Msk                   (_U_(0x1) << LCDC_HEOIER_ADD_Pos)                    /**< (LCDC_HEOIER) Head Descriptor Loaded Interrupt Enable Mask */
#define LCDC_HEOIER_ADD(value)                (LCDC_HEOIER_ADD_Msk & ((value) << LCDC_HEOIER_ADD_Pos))
#define LCDC_HEOIER_DONE_Pos                  _U_(5)                                               /**< (LCDC_HEOIER) End of List Interrupt Enable Position */
#define LCDC_HEOIER_DONE_Msk                  (_U_(0x1) << LCDC_HEOIER_DONE_Pos)                   /**< (LCDC_HEOIER) End of List Interrupt Enable Mask */
#define LCDC_HEOIER_DONE(value)               (LCDC_HEOIER_DONE_Msk & ((value) << LCDC_HEOIER_DONE_Pos))
#define LCDC_HEOIER_OVR_Pos                   _U_(6)                                               /**< (LCDC_HEOIER) Overflow Interrupt Enable Position */
#define LCDC_HEOIER_OVR_Msk                   (_U_(0x1) << LCDC_HEOIER_OVR_Pos)                    /**< (LCDC_HEOIER) Overflow Interrupt Enable Mask */
#define LCDC_HEOIER_OVR(value)                (LCDC_HEOIER_OVR_Msk & ((value) << LCDC_HEOIER_OVR_Pos))
#define LCDC_HEOIER_UDMA_Pos                  _U_(10)                                              /**< (LCDC_HEOIER) End of DMA Transfer for U or UV Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_UDMA_Msk                  (_U_(0x1) << LCDC_HEOIER_UDMA_Pos)                   /**< (LCDC_HEOIER) End of DMA Transfer for U or UV Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_UDMA(value)               (LCDC_HEOIER_UDMA_Msk & ((value) << LCDC_HEOIER_UDMA_Pos))
#define LCDC_HEOIER_UDSCR_Pos                 _U_(11)                                              /**< (LCDC_HEOIER) Descriptor Loaded for U or UV Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_UDSCR_Msk                 (_U_(0x1) << LCDC_HEOIER_UDSCR_Pos)                  /**< (LCDC_HEOIER) Descriptor Loaded for U or UV Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_UDSCR(value)              (LCDC_HEOIER_UDSCR_Msk & ((value) << LCDC_HEOIER_UDSCR_Pos))
#define LCDC_HEOIER_UADD_Pos                  _U_(12)                                              /**< (LCDC_HEOIER) Head Descriptor Loaded for U or UV Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_UADD_Msk                  (_U_(0x1) << LCDC_HEOIER_UADD_Pos)                   /**< (LCDC_HEOIER) Head Descriptor Loaded for U or UV Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_UADD(value)               (LCDC_HEOIER_UADD_Msk & ((value) << LCDC_HEOIER_UADD_Pos))
#define LCDC_HEOIER_UDONE_Pos                 _U_(13)                                              /**< (LCDC_HEOIER) End of List for U or UV Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_UDONE_Msk                 (_U_(0x1) << LCDC_HEOIER_UDONE_Pos)                  /**< (LCDC_HEOIER) End of List for U or UV Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_UDONE(value)              (LCDC_HEOIER_UDONE_Msk & ((value) << LCDC_HEOIER_UDONE_Pos))
#define LCDC_HEOIER_UOVR_Pos                  _U_(14)                                              /**< (LCDC_HEOIER) Overflow for U or UV Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_UOVR_Msk                  (_U_(0x1) << LCDC_HEOIER_UOVR_Pos)                   /**< (LCDC_HEOIER) Overflow for U or UV Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_UOVR(value)               (LCDC_HEOIER_UOVR_Msk & ((value) << LCDC_HEOIER_UOVR_Pos))
#define LCDC_HEOIER_VDMA_Pos                  _U_(18)                                              /**< (LCDC_HEOIER) End of DMA for V Chrominance Transfer Interrupt Enable Position */
#define LCDC_HEOIER_VDMA_Msk                  (_U_(0x1) << LCDC_HEOIER_VDMA_Pos)                   /**< (LCDC_HEOIER) End of DMA for V Chrominance Transfer Interrupt Enable Mask */
#define LCDC_HEOIER_VDMA(value)               (LCDC_HEOIER_VDMA_Msk & ((value) << LCDC_HEOIER_VDMA_Pos))
#define LCDC_HEOIER_VDSCR_Pos                 _U_(19)                                              /**< (LCDC_HEOIER) Descriptor Loaded for V Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_VDSCR_Msk                 (_U_(0x1) << LCDC_HEOIER_VDSCR_Pos)                  /**< (LCDC_HEOIER) Descriptor Loaded for V Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_VDSCR(value)              (LCDC_HEOIER_VDSCR_Msk & ((value) << LCDC_HEOIER_VDSCR_Pos))
#define LCDC_HEOIER_VADD_Pos                  _U_(20)                                              /**< (LCDC_HEOIER) Head Descriptor Loaded for V Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_VADD_Msk                  (_U_(0x1) << LCDC_HEOIER_VADD_Pos)                   /**< (LCDC_HEOIER) Head Descriptor Loaded for V Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_VADD(value)               (LCDC_HEOIER_VADD_Msk & ((value) << LCDC_HEOIER_VADD_Pos))
#define LCDC_HEOIER_VDONE_Pos                 _U_(21)                                              /**< (LCDC_HEOIER) End of List for V Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_VDONE_Msk                 (_U_(0x1) << LCDC_HEOIER_VDONE_Pos)                  /**< (LCDC_HEOIER) End of List for V Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_VDONE(value)              (LCDC_HEOIER_VDONE_Msk & ((value) << LCDC_HEOIER_VDONE_Pos))
#define LCDC_HEOIER_VOVR_Pos                  _U_(22)                                              /**< (LCDC_HEOIER) Overflow for V Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_VOVR_Msk                  (_U_(0x1) << LCDC_HEOIER_VOVR_Pos)                   /**< (LCDC_HEOIER) Overflow for V Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_VOVR(value)               (LCDC_HEOIER_VOVR_Msk & ((value) << LCDC_HEOIER_VOVR_Pos))
#define LCDC_HEOIER_Msk                       _U_(0x007C7C7C)                                      /**< (LCDC_HEOIER) Register Mask  */


/* -------- LCDC_HEOIDR : (LCDC Offset: 0x350) ( /W 32) High-End Overlay Interrupt Disable Register -------- */
#define LCDC_HEOIDR_DMA_Pos                   _U_(2)                                               /**< (LCDC_HEOIDR) End of DMA Transfer Interrupt Disable Position */
#define LCDC_HEOIDR_DMA_Msk                   (_U_(0x1) << LCDC_HEOIDR_DMA_Pos)                    /**< (LCDC_HEOIDR) End of DMA Transfer Interrupt Disable Mask */
#define LCDC_HEOIDR_DMA(value)                (LCDC_HEOIDR_DMA_Msk & ((value) << LCDC_HEOIDR_DMA_Pos))
#define LCDC_HEOIDR_DSCR_Pos                  _U_(3)                                               /**< (LCDC_HEOIDR) Descriptor Loaded Interrupt Disable Position */
#define LCDC_HEOIDR_DSCR_Msk                  (_U_(0x1) << LCDC_HEOIDR_DSCR_Pos)                   /**< (LCDC_HEOIDR) Descriptor Loaded Interrupt Disable Mask */
#define LCDC_HEOIDR_DSCR(value)               (LCDC_HEOIDR_DSCR_Msk & ((value) << LCDC_HEOIDR_DSCR_Pos))
#define LCDC_HEOIDR_ADD_Pos                   _U_(4)                                               /**< (LCDC_HEOIDR) Head Descriptor Loaded Interrupt Disable Position */
#define LCDC_HEOIDR_ADD_Msk                   (_U_(0x1) << LCDC_HEOIDR_ADD_Pos)                    /**< (LCDC_HEOIDR) Head Descriptor Loaded Interrupt Disable Mask */
#define LCDC_HEOIDR_ADD(value)                (LCDC_HEOIDR_ADD_Msk & ((value) << LCDC_HEOIDR_ADD_Pos))
#define LCDC_HEOIDR_DONE_Pos                  _U_(5)                                               /**< (LCDC_HEOIDR) End of List Interrupt Disable Position */
#define LCDC_HEOIDR_DONE_Msk                  (_U_(0x1) << LCDC_HEOIDR_DONE_Pos)                   /**< (LCDC_HEOIDR) End of List Interrupt Disable Mask */
#define LCDC_HEOIDR_DONE(value)               (LCDC_HEOIDR_DONE_Msk & ((value) << LCDC_HEOIDR_DONE_Pos))
#define LCDC_HEOIDR_OVR_Pos                   _U_(6)                                               /**< (LCDC_HEOIDR) Overflow Interrupt Disable Position */
#define LCDC_HEOIDR_OVR_Msk                   (_U_(0x1) << LCDC_HEOIDR_OVR_Pos)                    /**< (LCDC_HEOIDR) Overflow Interrupt Disable Mask */
#define LCDC_HEOIDR_OVR(value)                (LCDC_HEOIDR_OVR_Msk & ((value) << LCDC_HEOIDR_OVR_Pos))
#define LCDC_HEOIDR_UDMA_Pos                  _U_(10)                                              /**< (LCDC_HEOIDR) End of DMA Transfer for U or UV Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_UDMA_Msk                  (_U_(0x1) << LCDC_HEOIDR_UDMA_Pos)                   /**< (LCDC_HEOIDR) End of DMA Transfer for U or UV Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_UDMA(value)               (LCDC_HEOIDR_UDMA_Msk & ((value) << LCDC_HEOIDR_UDMA_Pos))
#define LCDC_HEOIDR_UDSCR_Pos                 _U_(11)                                              /**< (LCDC_HEOIDR) Descriptor Loaded for U or UV Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_UDSCR_Msk                 (_U_(0x1) << LCDC_HEOIDR_UDSCR_Pos)                  /**< (LCDC_HEOIDR) Descriptor Loaded for U or UV Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_UDSCR(value)              (LCDC_HEOIDR_UDSCR_Msk & ((value) << LCDC_HEOIDR_UDSCR_Pos))
#define LCDC_HEOIDR_UADD_Pos                  _U_(12)                                              /**< (LCDC_HEOIDR) Head Descriptor Loaded for U or UV Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_UADD_Msk                  (_U_(0x1) << LCDC_HEOIDR_UADD_Pos)                   /**< (LCDC_HEOIDR) Head Descriptor Loaded for U or UV Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_UADD(value)               (LCDC_HEOIDR_UADD_Msk & ((value) << LCDC_HEOIDR_UADD_Pos))
#define LCDC_HEOIDR_UDONE_Pos                 _U_(13)                                              /**< (LCDC_HEOIDR) End of List Interrupt for U or UV Chrominance Component Disable Position */
#define LCDC_HEOIDR_UDONE_Msk                 (_U_(0x1) << LCDC_HEOIDR_UDONE_Pos)                  /**< (LCDC_HEOIDR) End of List Interrupt for U or UV Chrominance Component Disable Mask */
#define LCDC_HEOIDR_UDONE(value)              (LCDC_HEOIDR_UDONE_Msk & ((value) << LCDC_HEOIDR_UDONE_Pos))
#define LCDC_HEOIDR_UOVR_Pos                  _U_(14)                                              /**< (LCDC_HEOIDR) Overflow Interrupt for U or UV Chrominance Component Disable Position */
#define LCDC_HEOIDR_UOVR_Msk                  (_U_(0x1) << LCDC_HEOIDR_UOVR_Pos)                   /**< (LCDC_HEOIDR) Overflow Interrupt for U or UV Chrominance Component Disable Mask */
#define LCDC_HEOIDR_UOVR(value)               (LCDC_HEOIDR_UOVR_Msk & ((value) << LCDC_HEOIDR_UOVR_Pos))
#define LCDC_HEOIDR_VDMA_Pos                  _U_(18)                                              /**< (LCDC_HEOIDR) End of DMA Transfer for V Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_VDMA_Msk                  (_U_(0x1) << LCDC_HEOIDR_VDMA_Pos)                   /**< (LCDC_HEOIDR) End of DMA Transfer for V Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_VDMA(value)               (LCDC_HEOIDR_VDMA_Msk & ((value) << LCDC_HEOIDR_VDMA_Pos))
#define LCDC_HEOIDR_VDSCR_Pos                 _U_(19)                                              /**< (LCDC_HEOIDR) Descriptor Loaded for V Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_VDSCR_Msk                 (_U_(0x1) << LCDC_HEOIDR_VDSCR_Pos)                  /**< (LCDC_HEOIDR) Descriptor Loaded for V Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_VDSCR(value)              (LCDC_HEOIDR_VDSCR_Msk & ((value) << LCDC_HEOIDR_VDSCR_Pos))
#define LCDC_HEOIDR_VADD_Pos                  _U_(20)                                              /**< (LCDC_HEOIDR) Head Descriptor Loaded for V Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_VADD_Msk                  (_U_(0x1) << LCDC_HEOIDR_VADD_Pos)                   /**< (LCDC_HEOIDR) Head Descriptor Loaded for V Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_VADD(value)               (LCDC_HEOIDR_VADD_Msk & ((value) << LCDC_HEOIDR_VADD_Pos))
#define LCDC_HEOIDR_VDONE_Pos                 _U_(21)                                              /**< (LCDC_HEOIDR) End of List for V Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_VDONE_Msk                 (_U_(0x1) << LCDC_HEOIDR_VDONE_Pos)                  /**< (LCDC_HEOIDR) End of List for V Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_VDONE(value)              (LCDC_HEOIDR_VDONE_Msk & ((value) << LCDC_HEOIDR_VDONE_Pos))
#define LCDC_HEOIDR_VOVR_Pos                  _U_(22)                                              /**< (LCDC_HEOIDR) Overflow for V Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_VOVR_Msk                  (_U_(0x1) << LCDC_HEOIDR_VOVR_Pos)                   /**< (LCDC_HEOIDR) Overflow for V Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_VOVR(value)               (LCDC_HEOIDR_VOVR_Msk & ((value) << LCDC_HEOIDR_VOVR_Pos))
#define LCDC_HEOIDR_Msk                       _U_(0x007C7C7C)                                      /**< (LCDC_HEOIDR) Register Mask  */


