virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_HEOIMR : (LCDC Offset: 0x354) ( R/ 32) High-End Overlay Interrupt Mask Register -------- */
#define LCDC_HEOIMR_DMA_Pos                   _U_(2)                                               /**< (LCDC_HEOIMR) End of DMA Transfer Interrupt Mask Position */
#define LCDC_HEOIMR_DMA_Msk                   (_U_(0x1) << LCDC_HEOIMR_DMA_Pos)                    /**< (LCDC_HEOIMR) End of DMA Transfer Interrupt Mask Mask */
#define LCDC_HEOIMR_DMA(value)                (LCDC_HEOIMR_DMA_Msk & ((value) << LCDC_HEOIMR_DMA_Pos))
#define LCDC_HEOIMR_DSCR_Pos                  _U_(3)                                               /**< (LCDC_HEOIMR) Descriptor Loaded Interrupt Mask Position */
#define LCDC_HEOIMR_DSCR_Msk                  (_U_(0x1) << LCDC_HEOIMR_DSCR_Pos)                   /**< (LCDC_HEOIMR) Descriptor Loaded Interrupt Mask Mask */
#define LCDC_HEOIMR_DSCR(value)               (LCDC_HEOIMR_DSCR_Msk & ((value) << LCDC_HEOIMR_DSCR_Pos))
#define LCDC_HEOIMR_ADD_Pos                   _U_(4)                                               /**< (LCDC_HEOIMR) Head Descriptor Loaded Interrupt Mask Position */
#define LCDC_HEOIMR_ADD_Msk                   (_U_(0x1) << LCDC_HEOIMR_ADD_Pos)                    /**< (LCDC_HEOIMR) Head Descriptor Loaded Interrupt Mask Mask */
#define LCDC_HEOIMR_ADD(value)                (LCDC_HEOIMR_ADD_Msk & ((value) << LCDC_HEOIMR_ADD_Pos))
#define LCDC_HEOIMR_DONE_Pos                  _U_(5)                                               /**< (LCDC_HEOIMR) End of List Interrupt Mask Position */
#define LCDC_HEOIMR_DONE_Msk                  (_U_(0x1) << LCDC_HEOIMR_DONE_Pos)                   /**< (LCDC_HEOIMR) End of List Interrupt Mask Mask */
#define LCDC_HEOIMR_DONE(value)               (LCDC_HEOIMR_DONE_Msk & ((value) << LCDC_HEOIMR_DONE_Pos))
#define LCDC_HEOIMR_OVR_Pos                   _U_(6)                                               /**< (LCDC_HEOIMR) Overflow Interrupt Mask Position */
#define LCDC_HEOIMR_OVR_Msk                   (_U_(0x1) << LCDC_HEOIMR_OVR_Pos)                    /**< (LCDC_HEOIMR) Overflow Interrupt Mask Mask */
#define LCDC_HEOIMR_OVR(value)                (LCDC_HEOIMR_OVR_Msk & ((value) << LCDC_HEOIMR_OVR_Pos))
#define LCDC_HEOIMR_UDMA_Pos                  _U_(10)                                              /**< (LCDC_HEOIMR) End of DMA Transfer for U or UV Chrominance Component Interrupt Mask Position */
#define LCDC_HEOIMR_UDMA_Msk                  (_U_(0x1) << LCDC_HEOIMR_UDMA_Pos)                   /**< (LCDC_HEOIMR) End of DMA Transfer for U or UV Chrominance Component Interrupt Mask Mask */
#define LCDC_HEOIMR_UDMA(value)               (LCDC_HEOIMR_UDMA_Msk & ((value) << LCDC_HEOIMR_UDMA_Pos))
#define LCDC_HEOIMR_UDSCR_Pos                 _U_(11)                                              /**< (LCDC_HEOIMR) Descriptor Loaded for U or UV Chrominance Component Interrupt Mask Position */
#define LCDC_HEOIMR_UDSCR_Msk                 (_U_(0x1) << LCDC_HEOIMR_UDSCR_Pos)                  /**< (LCDC_HEOIMR) Descriptor Loaded for U or UV Chrominance Component Interrupt Mask Mask */
#define LCDC_HEOIMR_UDSCR(value)              (LCDC_HEOIMR_UDSCR_Msk & ((value) << LCDC_HEOIMR_UDSCR_Pos))
#define LCDC_HEOIMR_UADD_Pos                  _U_(12)                                              /**< (LCDC_HEOIMR) Head Descriptor Loaded for U or UV Chrominance Component Mask Position */
#define LCDC_HEOIMR_UADD_Msk                  (_U_(0x1) << LCDC_HEOIMR_UADD_Pos)                   /**< (LCDC_HEOIMR) Head Descriptor Loaded for U or UV Chrominance Component Mask Mask */
#define LCDC_HEOIMR_UADD(value)               (LCDC_HEOIMR_UADD_Msk & ((value) << LCDC_HEOIMR_UADD_Pos))
#define LCDC_HEOIMR_UDONE_Pos                 _U_(13)                                              /**< (LCDC_HEOIMR) End of List for U or UV Chrominance Component Mask Position */
#define LCDC_HEOIMR_UDONE_Msk                 (_U_(0x1) << LCDC_HEOIMR_UDONE_Pos)                  /**< (LCDC_HEOIMR) End of List for U or UV Chrominance Component Mask Mask */
#define LCDC_HEOIMR_UDONE(value)              (LCDC_HEOIMR_UDONE_Msk & ((value) << LCDC_HEOIMR_UDONE_Pos))
#define LCDC_HEOIMR_UOVR_Pos                  _U_(14)                                              /**< (LCDC_HEOIMR) Overflow for U Chrominance Interrupt Mask Position */
#define LCDC_HEOIMR_UOVR_Msk                  (_U_(0x1) << LCDC_HEOIMR_UOVR_Pos)                   /**< (LCDC_HEOIMR) Overflow for U Chrominance Interrupt Mask Mask */
#define LCDC_HEOIMR_UOVR(value)               (LCDC_HEOIMR_UOVR_Msk & ((value) << LCDC_HEOIMR_UOVR_Pos))
#define LCDC_HEOIMR_VDMA_Pos                  _U_(18)                                              /**< (LCDC_HEOIMR) End of DMA Transfer for V Chrominance Component Interrupt Mask Position */
#define LCDC_HEOIMR_VDMA_Msk                  (_U_(0x1) << LCDC_HEOIMR_VDMA_Pos)                   /**< (LCDC_HEOIMR) End of DMA Transfer for V Chrominance Component Interrupt Mask Mask */
#define LCDC_HEOIMR_VDMA(value)               (LCDC_HEOIMR_VDMA_Msk & ((value) << LCDC_HEOIMR_VDMA_Pos))
#define LCDC_HEOIMR_VDSCR_Pos                 _U_(19)                                              /**< (LCDC_HEOIMR) Descriptor Loaded for V Chrominance Component Interrupt Mask Position */
#define LCDC_HEOIMR_VDSCR_Msk                 (_U_(0x1) << LCDC_HEOIMR_VDSCR_Pos)                  /**< (LCDC_HEOIMR) Descriptor Loaded for V Chrominance Component Interrupt Mask Mask */
#define LCDC_HEOIMR_VDSCR(value)              (LCDC_HEOIMR_VDSCR_Msk & ((value) << LCDC_HEOIMR_VDSCR_Pos))
#define LCDC_HEOIMR_VADD_Pos                  _U_(20)                                              /**< (LCDC_HEOIMR) Head Descriptor Loaded for V Chrominance Component Mask Position */
#define LCDC_HEOIMR_VADD_Msk                  (_U_(0x1) << LCDC_HEOIMR_VADD_Pos)                   /**< (LCDC_HEOIMR) Head Descriptor Loaded for V Chrominance Component Mask Mask */
#define LCDC_HEOIMR_VADD(value)               (LCDC_HEOIMR_VADD_Msk & ((value) << LCDC_HEOIMR_VADD_Pos))
#define LCDC_HEOIMR_VDONE_Pos                 _U_(21)                                              /**< (LCDC_HEOIMR) End of List for V Chrominance Component Mask Position */
#define LCDC_HEOIMR_VDONE_Msk                 (_U_(0x1) << LCDC_HEOIMR_VDONE_Pos)                  /**< (LCDC_HEOIMR) End of List for V Chrominance Component Mask Mask */
#define LCDC_HEOIMR_VDONE(value)              (LCDC_HEOIMR_VDONE_Msk & ((value) << LCDC_HEOIMR_VDONE_Pos))
#define LCDC_HEOIMR_VOVR_Pos                  _U_(22)                                              /**< (LCDC_HEOIMR) Overflow for V Chrominance Interrupt Mask Position */
#define LCDC_HEOIMR_VOVR_Msk                  (_U_(0x1) << LCDC_HEOIMR_VOVR_Pos)                   /**< (LCDC_HEOIMR) Overflow for V Chrominance Interrupt Mask Mask */
#define LCDC_HEOIMR_VOVR(value)               (LCDC_HEOIMR_VOVR_Msk & ((value) << LCDC_HEOIMR_VOVR_Pos))
#define LCDC_HEOIMR_Msk                       _U_(0x007C7C7C)                                      /**< (LCDC_HEOIMR) Register Mask  */


/* -------- LCDC_HEOISR : (LCDC Offset: 0x358) ( R/ 32) High-End Overlay Interrupt Status Register -------- */
#define LCDC_HEOISR_DMA_Pos                   _U_(2)                                               /**< (LCDC_HEOISR) End of DMA Transfer Position */
#define LCDC_HEOISR_DMA_Msk                   (_U_(0x1) << LCDC_HEOISR_DMA_Pos)                    /**< (LCDC_HEOISR) End of DMA Transfer Mask */
#define LCDC_HEOISR_DMA(value)                (LCDC_HEOISR_DMA_Msk & ((value) << LCDC_HEOISR_DMA_Pos))
#define LCDC_HEOISR_DSCR_Pos                  _U_(3)                                               /**< (LCDC_HEOISR) DMA Descriptor Loaded Position */
#define LCDC_HEOISR_DSCR_Msk                  (_U_(0x1) << LCDC_HEOISR_DSCR_Pos)                   /**< (LCDC_HEOISR) DMA Descriptor Loaded Mask */
#define LCDC_HEOISR_DSCR(value)               (LCDC_HEOISR_DSCR_Msk & ((value) << LCDC_HEOISR_DSCR_Pos))
#define LCDC_HEOISR_ADD_Pos                   _U_(4)                                               /**< (LCDC_HEOISR) Head Descriptor Loaded Position */
#define LCDC_HEOISR_ADD_Msk                   (_U_(0x1) << LCDC_HEOISR_ADD_Pos)                    /**< (LCDC_HEOISR) Head Descriptor Loaded Mask */
#define LCDC_HEOISR_ADD(value)                (LCDC_HEOISR_ADD_Msk & ((value) << LCDC_HEOISR_ADD_Pos))
#define LCDC_HEOISR_DONE_Pos                  _U_(5)                                               /**< (LCDC_HEOISR) End of List Detected Position */
#define LCDC_HEOISR_DONE_Msk                  (_U_(0x1) << LCDC_HEOISR_DONE_Pos)                   /**< (LCDC_HEOISR) End of List Detected Mask */
#define LCDC_HEOISR_DONE(value)               (LCDC_HEOISR_DONE_Msk & ((value) << LCDC_HEOISR_DONE_Pos))
#define LCDC_HEOISR_OVR_Pos                   _U_(6)                                               /**< (LCDC_HEOISR) Overflow Detected Position */
#define LCDC_HEOISR_OVR_Msk                   (_U_(0x1) << LCDC_HEOISR_OVR_Pos)                    /**< (LCDC_HEOISR) Overflow Detected Mask */
#define LCDC_HEOISR_OVR(value)                (LCDC_HEOISR_OVR_Msk & ((value) << LCDC_HEOISR_OVR_Pos))
#define LCDC_HEOISR_UDMA_Pos                  _U_(10)                                              /**< (LCDC_HEOISR) End of DMA Transfer for U Component Position */
#define LCDC_HEOISR_UDMA_Msk                  (_U_(0x1) << LCDC_HEOISR_UDMA_Pos)                   /**< (LCDC_HEOISR) End of DMA Transfer for U Component Mask */
#define LCDC_HEOISR_UDMA(value)               (LCDC_HEOISR_UDMA_Msk & ((value) << LCDC_HEOISR_UDMA_Pos))
#define LCDC_HEOISR_UDSCR_Pos                 _U_(11)                                              /**< (LCDC_HEOISR) DMA Descriptor Loaded for U Component Position */
#define LCDC_HEOISR_UDSCR_Msk                 (_U_(0x1) << LCDC_HEOISR_UDSCR_Pos)                  /**< (LCDC_HEOISR) DMA Descriptor Loaded for U Component Mask */
#define LCDC_HEOISR_UDSCR(value)              (LCDC_HEOISR_UDSCR_Msk & ((value) << LCDC_HEOISR_UDSCR_Pos))
#define LCDC_HEOISR_UADD_Pos                  _U_(12)                                              /**< (LCDC_HEOISR) Head Descriptor Loaded for U Component Position */
#define LCDC_HEOISR_UADD_Msk                  (_U_(0x1) << LCDC_HEOISR_UADD_Pos)                   /**< (LCDC_HEOISR) Head Descriptor Loaded for U Component Mask */
#define LCDC_HEOISR_UADD(value)               (LCDC_HEOISR_UADD_Msk & ((value) << LCDC_HEOISR_UADD_Pos))
#define LCDC_HEOISR_UDONE_Pos                 _U_(13)                                              /**< (LCDC_HEOISR) End of List Detected for U Component Position */
#define LCDC_HEOISR_UDONE_Msk                 (_U_(0x1) << LCDC_HEOISR_UDONE_Pos)                  /**< (LCDC_HEOISR) End of List Detected for U Component Mask */
#define LCDC_HEOISR_UDONE(value)              (LCDC_HEOISR_UDONE_Msk & ((value) << LCDC_HEOISR_UDONE_Pos))
#define LCDC_HEOISR_UOVR_Pos                  _U_(14)                                              /**< (LCDC_HEOISR) Overflow Detected for U Component Position */
#define LCDC_HEOISR_UOVR_Msk                  (_U_(0x1) << LCDC_HEOISR_UOVR_Pos)                   /**< (LCDC_HEOISR) Overflow Detected for U Component Mask */
#define LCDC_HEOISR_UOVR(value)               (LCDC_HEOISR_UOVR_Msk & ((value) << LCDC_HEOISR_UOVR_Pos))
#define LCDC_HEOISR_VDMA_Pos                  _U_(18)                                              /**< (LCDC_HEOISR) End of DMA Transfer for V Component Position */
#define LCDC_HEOISR_VDMA_Msk                  (_U_(0x1) << LCDC_HEOISR_VDMA_Pos)                   /**< (LCDC_HEOISR) End of DMA Transfer for V Component Mask */
#define LCDC_HEOISR_VDMA(value)               (LCDC_HEOISR_VDMA_Msk & ((value) << LCDC_HEOISR_VDMA_Pos))
#define LCDC_HEOISR_VDSCR_Pos                 _U_(19)                                              /**< (LCDC_HEOISR) DMA Descriptor Loaded for V Component Position */
#define LCDC_HEOISR_VDSCR_Msk                 (_U_(0x1) << LCDC_HEOISR_VDSCR_Pos)                  /**< (LCDC_HEOISR) DMA Descriptor Loaded for V Component Mask */
#define LCDC_HEOISR_VDSCR(value)              (LCDC_HEOISR_VDSCR_Msk & ((value) << LCDC_HEOISR_VDSCR_Pos))
#define LCDC_HEOISR_VADD_Pos                  _U_(20)                                              /**< (LCDC_HEOISR) Head Descriptor Loaded for V Component Position */
#define LCDC_HEOISR_VADD_Msk                  (_U_(0x1) << LCDC_HEOISR_VADD_Pos)                   /**< (LCDC_HEOISR) Head Descriptor Loaded for V Component Mask */
#define LCDC_HEOISR_VADD(value)               (LCDC_HEOISR_VADD_Msk & ((value) << LCDC_HEOISR_VADD_Pos))
#define LCDC_HEOISR_VDONE_Pos                 _U_(21)                                              /**< (LCDC_HEOISR) End of List Detected for V Component Position */
#define LCDC_HEOISR_VDONE_Msk                 (_U_(0x1) << LCDC_HEOISR_VDONE_Pos)                  /**< (LCDC_HEOISR) End of List Detected for V Component Mask */
#define LCDC_HEOISR_VDONE(value)              (LCDC_HEOISR_VDONE_Msk & ((value) << LCDC_HEOISR_VDONE_Pos))
#define LCDC_HEOISR_VOVR_Pos                  _U_(22)                                              /**< (LCDC_HEOISR) Overflow Detected for V Component Position */
#define LCDC_HEOISR_VOVR_Msk                  (_U_(0x1) << LCDC_HEOISR_VOVR_Pos)                   /**< (LCDC_HEOISR) Overflow Detected for V Component Mask */
#define LCDC_HEOISR_VOVR(value)               (LCDC_HEOISR_VOVR_Msk & ((value) << LCDC_HEOISR_VOVR_Pos))
#define LCDC_HEOISR_Msk                       _U_(0x007C7C7C)                                      /**< (LCDC_HEOISR) Register Mask  */


/* -------- LCDC_HEOHEAD : (LCDC Offset: 0x35C) (R/W 32) High-End Overlay DMA Head Register -------- */
#define LCDC_HEOHEAD_HEAD_Pos                 _U_(2)                                               /**< (LCDC_HEOHEAD) DMA Head Pointer Position */
#define LCDC_HEOHEAD_HEAD_Msk                 (_U_(0x3FFFFFFF) << LCDC_HEOHEAD_HEAD_Pos)           /**< (LCDC_HEOHEAD) DMA Head Pointer Mask */
#define LCDC_HEOHEAD_HEAD(value)              (LCDC_HEOHEAD_HEAD_Msk & ((value) << LCDC_HEOHEAD_HEAD_Pos))
#define LCDC_HEOHEAD_Msk                      _U_(0xFFFFFFFC)                                      /**< (LCDC_HEOHEAD) Register Mask  */


/* -------- LCDC_HEOADDR : (LCDC Offset: 0x360) (R/W 32) High-End Overlay DMA Address Register -------- */
#define LCDC_HEOADDR_ADDR_Pos                 _U_(0)                                               /**< (LCDC_HEOADDR) DMA Transfer Start Address Position */
#define LCDC_HEOADDR_ADDR_Msk                 (_U_(0xFFFFFFFF) << LCDC_HEOADDR_ADDR_Pos)           /**< (LCDC_HEOADDR) DMA Transfer Start Address Mask */
#define LCDC_HEOADDR_ADDR(value)              (LCDC_HEOADDR_ADDR_Msk & ((value) << LCDC_HEOADDR_ADDR_Pos))
#define LCDC_HEOADDR_Msk                      _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOADDR) Register Mask  */


/* -------- LCDC_HEOCTRL : (LCDC Offset: 0x364) (R/W 32) High-End Overlay DMA Control Register -------- */
#define LCDC_HEOCTRL_DFETCH_Pos               _U_(0)                                               /**< (LCDC_HEOCTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_HEOCTRL_DFETCH_Msk               (_U_(0x1) << LCDC_HEOCTRL_DFETCH_Pos)                /**< (LCDC_HEOCTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_HEOCTRL_DFETCH(value)            (LCDC_HEOCTRL_DFETCH_Msk & ((value) << LCDC_HEOCTRL_DFETCH_Pos))
#define LCDC_HEOCTRL_LFETCH_Pos               _U_(1)                                               /**< (LCDC_HEOCTRL) Lookup Table Fetch Enable Position */
#define LCDC_HEOCTRL_LFETCH_Msk               (_U_(0x1) << LCDC_HEOCTRL_LFETCH_Pos)                /**< (LCDC_HEOCTRL) Lookup Table Fetch Enable Mask */
#define LCDC_HEOCTRL_LFETCH(value)            (LCDC_HEOCTRL_LFETCH_Msk & ((value) << LCDC_HEOCTRL_LFETCH_Pos))
#define LCDC_HEOCTRL_DMAIEN_Pos               _U_(2)                                               /**< (LCDC_HEOCTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_HEOCTRL_DMAIEN_Msk               (_U_(0x1) << LCDC_HEOCTRL_DMAIEN_Pos)                /**< (LCDC_HEOCTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_HEOCTRL_DMAIEN(value)            (LCDC_HEOCTRL_DMAIEN_Msk & ((value) << LCDC_HEOCTRL_DMAIEN_Pos))
#define LCDC_HEOCTRL_DSCRIEN_Pos              _U_(3)                                               /**< (LCDC_HEOCTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_HEOCTRL_DSCRIEN_Msk              (_U_(0x1) << LCDC_HEOCTRL_DSCRIEN_Pos)               /**< (LCDC_HEOCTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_HEOCTRL_DSCRIEN(value)           (LCDC_HEOCTRL_DSCRIEN_Msk & ((value) << LCDC_HEOCTRL_DSCRIEN_Pos))
#define LCDC_HEOCTRL_ADDIEN_Pos               _U_(4)                                               /**< (LCDC_HEOCTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_HEOCTRL_ADDIEN_Msk               (_U_(0x1) << LCDC_HEOCTRL_ADDIEN_Pos)                /**< (LCDC_HEOCTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_HEOCTRL_ADDIEN(value)            (LCDC_HEOCTRL_ADDIEN_Msk & ((value) << LCDC_HEOCTRL_ADDIEN_Pos))
#define LCDC_HEOCTRL_DONEIEN_Pos              _U_(5)                                               /**< (LCDC_HEOCTRL) End of List Interrupt Enable Position */
#define LCDC_HEOCTRL_DONEIEN_Msk              (_U_(0x1) << LCDC_HEOCTRL_DONEIEN_Pos)               /**< (LCDC_HEOCTRL) End of List Interrupt Enable Mask */
#define LCDC_HEOCTRL_DONEIEN(value)           (LCDC_HEOCTRL_DONEIEN_Msk & ((value) << LCDC_HEOCTRL_DONEIEN_Pos))
#define LCDC_HEOCTRL_Msk                      _U_(0x0000003F)                                      /**< (LCDC_HEOCTRL) Register Mask  */


/* -------- LCDC_HEONEXT : (LCDC Offset: 0x368) (R/W 32) High-End Overlay DMA Next Register -------- */
#define LCDC_HEONEXT_NEXT_Pos                 _U_(0)                                               /**< (LCDC_HEONEXT) DMA Descriptor Next Address Position */
#define LCDC_HEONEXT_NEXT_Msk                 (_U_(0xFFFFFFFF) << LCDC_HEONEXT_NEXT_Pos)           /**< (LCDC_HEONEXT) DMA Descriptor Next Address Mask */
#define LCDC_HEONEXT_NEXT(value)              (LCDC_HEONEXT_NEXT_Msk & ((value) << LCDC_HEONEXT_NEXT_Pos))
#define LCDC_HEONEXT_Msk                      _U_(0xFFFFFFFF)                                      /**< (LCDC_HEONEXT) Register Mask  */


/* -------- LCDC_HEOUHEAD : (LCDC Offset: 0x36C) (R/W 32) High-End Overlay U-UV DMA Head Register -------- */
#define LCDC_HEOUHEAD_UHEAD_Pos               _U_(0)                                               /**< (LCDC_HEOUHEAD) DMA Head Pointer Position */
#define LCDC_HEOUHEAD_UHEAD_Msk               (_U_(0xFFFFFFFF) << LCDC_HEOUHEAD_UHEAD_Pos)         /**< (LCDC_HEOUHEAD) DMA Head Pointer Mask */
#define LCDC_HEOUHEAD_UHEAD(value)            (LCDC_HEOUHEAD_UHEAD_Msk & ((value) << LCDC_HEOUHEAD_UHEAD_Pos))
#define LCDC_HEOUHEAD_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOUHEAD) Register Mask  */


