virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_HEOUADDR : (LCDC Offset: 0x370) (R/W 32) High-End Overlay U-UV DMA Address Register -------- */
#define LCDC_HEOUADDR_UADDR_Pos               _U_(0)                                               /**< (LCDC_HEOUADDR) DMA Transfer Start Address for U or UV Chrominance Position */
#define LCDC_HEOUADDR_UADDR_Msk               (_U_(0xFFFFFFFF) << LCDC_HEOUADDR_UADDR_Pos)         /**< (LCDC_HEOUADDR) DMA Transfer Start Address for U or UV Chrominance Mask */
#define LCDC_HEOUADDR_UADDR(value)            (LCDC_HEOUADDR_UADDR_Msk & ((value) << LCDC_HEOUADDR_UADDR_Pos))
#define LCDC_HEOUADDR_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOUADDR) Register Mask  */


/* -------- LCDC_HEOUCTRL : (LCDC Offset: 0x374) (R/W 32) High-End Overlay U-UV DMA Control Register -------- */
#define LCDC_HEOUCTRL_UDFETCH_Pos             _U_(0)                                               /**< (LCDC_HEOUCTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_HEOUCTRL_UDFETCH_Msk             (_U_(0x1) << LCDC_HEOUCTRL_UDFETCH_Pos)              /**< (LCDC_HEOUCTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_HEOUCTRL_UDFETCH(value)          (LCDC_HEOUCTRL_UDFETCH_Msk & ((value) << LCDC_HEOUCTRL_UDFETCH_Pos))
#define LCDC_HEOUCTRL_UDMAIEN_Pos             _U_(2)                                               /**< (LCDC_HEOUCTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_HEOUCTRL_UDMAIEN_Msk             (_U_(0x1) << LCDC_HEOUCTRL_UDMAIEN_Pos)              /**< (LCDC_HEOUCTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_HEOUCTRL_UDMAIEN(value)          (LCDC_HEOUCTRL_UDMAIEN_Msk & ((value) << LCDC_HEOUCTRL_UDMAIEN_Pos))
#define LCDC_HEOUCTRL_UDSCRIEN_Pos            _U_(3)                                               /**< (LCDC_HEOUCTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_HEOUCTRL_UDSCRIEN_Msk            (_U_(0x1) << LCDC_HEOUCTRL_UDSCRIEN_Pos)             /**< (LCDC_HEOUCTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_HEOUCTRL_UDSCRIEN(value)         (LCDC_HEOUCTRL_UDSCRIEN_Msk & ((value) << LCDC_HEOUCTRL_UDSCRIEN_Pos))
#define LCDC_HEOUCTRL_UADDIEN_Pos             _U_(4)                                               /**< (LCDC_HEOUCTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_HEOUCTRL_UADDIEN_Msk             (_U_(0x1) << LCDC_HEOUCTRL_UADDIEN_Pos)              /**< (LCDC_HEOUCTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_HEOUCTRL_UADDIEN(value)          (LCDC_HEOUCTRL_UADDIEN_Msk & ((value) << LCDC_HEOUCTRL_UADDIEN_Pos))
#define LCDC_HEOUCTRL_UDONEIEN_Pos            _U_(5)                                               /**< (LCDC_HEOUCTRL) End of List Interrupt Enable Position */
#define LCDC_HEOUCTRL_UDONEIEN_Msk            (_U_(0x1) << LCDC_HEOUCTRL_UDONEIEN_Pos)             /**< (LCDC_HEOUCTRL) End of List Interrupt Enable Mask */
#define LCDC_HEOUCTRL_UDONEIEN(value)         (LCDC_HEOUCTRL_UDONEIEN_Msk & ((value) << LCDC_HEOUCTRL_UDONEIEN_Pos))
#define LCDC_HEOUCTRL_Msk                     _U_(0x0000003D)                                      /**< (LCDC_HEOUCTRL) Register Mask  */


/* -------- LCDC_HEOUNEXT : (LCDC Offset: 0x378) (R/W 32) High-End Overlay U-UV DMA Next Register -------- */
#define LCDC_HEOUNEXT_UNEXT_Pos               _U_(0)                                               /**< (LCDC_HEOUNEXT) DMA Descriptor Next Address Position */
#define LCDC_HEOUNEXT_UNEXT_Msk               (_U_(0xFFFFFFFF) << LCDC_HEOUNEXT_UNEXT_Pos)         /**< (LCDC_HEOUNEXT) DMA Descriptor Next Address Mask */
#define LCDC_HEOUNEXT_UNEXT(value)            (LCDC_HEOUNEXT_UNEXT_Msk & ((value) << LCDC_HEOUNEXT_UNEXT_Pos))
#define LCDC_HEOUNEXT_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOUNEXT) Register Mask  */


/* -------- LCDC_HEOVHEAD : (LCDC Offset: 0x37C) (R/W 32) High-End Overlay V DMA Head Register -------- */
#define LCDC_HEOVHEAD_VHEAD_Pos               _U_(0)                                               /**< (LCDC_HEOVHEAD) DMA Head Pointer Position */
#define LCDC_HEOVHEAD_VHEAD_Msk               (_U_(0xFFFFFFFF) << LCDC_HEOVHEAD_VHEAD_Pos)         /**< (LCDC_HEOVHEAD) DMA Head Pointer Mask */
#define LCDC_HEOVHEAD_VHEAD(value)            (LCDC_HEOVHEAD_VHEAD_Msk & ((value) << LCDC_HEOVHEAD_VHEAD_Pos))
#define LCDC_HEOVHEAD_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOVHEAD) Register Mask  */


/* -------- LCDC_HEOVADDR : (LCDC Offset: 0x380) (R/W 32) High-End Overlay V DMA Address Register -------- */
#define LCDC_HEOVADDR_VADDR_Pos               _U_(0)                                               /**< (LCDC_HEOVADDR) DMA Transfer Start Address for V Chrominance Position */
#define LCDC_HEOVADDR_VADDR_Msk               (_U_(0xFFFFFFFF) << LCDC_HEOVADDR_VADDR_Pos)         /**< (LCDC_HEOVADDR) DMA Transfer Start Address for V Chrominance Mask */
#define LCDC_HEOVADDR_VADDR(value)            (LCDC_HEOVADDR_VADDR_Msk & ((value) << LCDC_HEOVADDR_VADDR_Pos))
#define LCDC_HEOVADDR_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOVADDR) Register Mask  */


/* -------- LCDC_HEOVCTRL : (LCDC Offset: 0x384) (R/W 32) High-End Overlay V DMA Control Register -------- */
#define LCDC_HEOVCTRL_VDFETCH_Pos             _U_(0)                                               /**< (LCDC_HEOVCTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_HEOVCTRL_VDFETCH_Msk             (_U_(0x1) << LCDC_HEOVCTRL_VDFETCH_Pos)              /**< (LCDC_HEOVCTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_HEOVCTRL_VDFETCH(value)          (LCDC_HEOVCTRL_VDFETCH_Msk & ((value) << LCDC_HEOVCTRL_VDFETCH_Pos))
#define LCDC_HEOVCTRL_VDMAIEN_Pos             _U_(2)                                               /**< (LCDC_HEOVCTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_HEOVCTRL_VDMAIEN_Msk             (_U_(0x1) << LCDC_HEOVCTRL_VDMAIEN_Pos)              /**< (LCDC_HEOVCTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_HEOVCTRL_VDMAIEN(value)          (LCDC_HEOVCTRL_VDMAIEN_Msk & ((value) << LCDC_HEOVCTRL_VDMAIEN_Pos))
#define LCDC_HEOVCTRL_VDSCRIEN_Pos            _U_(3)                                               /**< (LCDC_HEOVCTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_HEOVCTRL_VDSCRIEN_Msk            (_U_(0x1) << LCDC_HEOVCTRL_VDSCRIEN_Pos)             /**< (LCDC_HEOVCTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_HEOVCTRL_VDSCRIEN(value)         (LCDC_HEOVCTRL_VDSCRIEN_Msk & ((value) << LCDC_HEOVCTRL_VDSCRIEN_Pos))
#define LCDC_HEOVCTRL_VADDIEN_Pos             _U_(4)                                               /**< (LCDC_HEOVCTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_HEOVCTRL_VADDIEN_Msk             (_U_(0x1) << LCDC_HEOVCTRL_VADDIEN_Pos)              /**< (LCDC_HEOVCTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_HEOVCTRL_VADDIEN(value)          (LCDC_HEOVCTRL_VADDIEN_Msk & ((value) << LCDC_HEOVCTRL_VADDIEN_Pos))
#define LCDC_HEOVCTRL_VDONEIEN_Pos            _U_(5)                                               /**< (LCDC_HEOVCTRL) End of List Interrupt Enable Position */
#define LCDC_HEOVCTRL_VDONEIEN_Msk            (_U_(0x1) << LCDC_HEOVCTRL_VDONEIEN_Pos)             /**< (LCDC_HEOVCTRL) End of List Interrupt Enable Mask */
#define LCDC_HEOVCTRL_VDONEIEN(value)         (LCDC_HEOVCTRL_VDONEIEN_Msk & ((value) << LCDC_HEOVCTRL_VDONEIEN_Pos))
#define LCDC_HEOVCTRL_Msk                     _U_(0x0000003D)                                      /**< (LCDC_HEOVCTRL) Register Mask  */


/* -------- LCDC_HEOVNEXT : (LCDC Offset: 0x388) (R/W 32) High-End Overlay V DMA Next Register -------- */
#define LCDC_HEOVNEXT_VNEXT_Pos               _U_(0)                                               /**< (LCDC_HEOVNEXT) DMA Descriptor Next Address Position */
#define LCDC_HEOVNEXT_VNEXT_Msk               (_U_(0xFFFFFFFF) << LCDC_HEOVNEXT_VNEXT_Pos)         /**< (LCDC_HEOVNEXT) DMA Descriptor Next Address Mask */
#define LCDC_HEOVNEXT_VNEXT(value)            (LCDC_HEOVNEXT_VNEXT_Msk & ((value) << LCDC_HEOVNEXT_VNEXT_Pos))
#define LCDC_HEOVNEXT_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOVNEXT) Register Mask  */


/* -------- LCDC_HEOCFG0 : (LCDC Offset: 0x38C) (R/W 32) High-End Overlay Configuration Register 0 -------- */
#define LCDC_HEOCFG0_SIF_Pos                  _U_(0)                                               /**< (LCDC_HEOCFG0) Source Interface Position */
#define LCDC_HEOCFG0_SIF_Msk                  (_U_(0x1) << LCDC_HEOCFG0_SIF_Pos)                   /**< (LCDC_HEOCFG0) Source Interface Mask */
#define LCDC_HEOCFG0_SIF(value)               (LCDC_HEOCFG0_SIF_Msk & ((value) << LCDC_HEOCFG0_SIF_Pos))
#define LCDC_HEOCFG0_BLEN_Pos                 _U_(4)                                               /**< (LCDC_HEOCFG0) AHB Burst Length Position */
#define LCDC_HEOCFG0_BLEN_Msk                 (_U_(0x3) << LCDC_HEOCFG0_BLEN_Pos)                  /**< (LCDC_HEOCFG0) AHB Burst Length Mask */
#define LCDC_HEOCFG0_BLEN(value)              (LCDC_HEOCFG0_BLEN_Msk & ((value) << LCDC_HEOCFG0_BLEN_Pos))
#define   LCDC_HEOCFG0_BLEN_AHB_BLEN_SINGLE_Val _U_(0x0)                                             /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_HEOCFG0_BLEN_AHB_BLEN_INCR4_Val _U_(0x1)                                             /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_HEOCFG0_BLEN_AHB_BLEN_INCR8_Val _U_(0x2)                                             /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_HEOCFG0_BLEN_AHB_BLEN_INCR16_Val _U_(0x3)                                             /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define LCDC_HEOCFG0_BLEN_AHB_BLEN_SINGLE     (LCDC_HEOCFG0_BLEN_AHB_BLEN_SINGLE_Val << LCDC_HEOCFG0_BLEN_Pos) /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_HEOCFG0_BLEN_AHB_BLEN_INCR4      (LCDC_HEOCFG0_BLEN_AHB_BLEN_INCR4_Val << LCDC_HEOCFG0_BLEN_Pos) /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_HEOCFG0_BLEN_AHB_BLEN_INCR8      (LCDC_HEOCFG0_BLEN_AHB_BLEN_INCR8_Val << LCDC_HEOCFG0_BLEN_Pos) /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_HEOCFG0_BLEN_AHB_BLEN_INCR16     (LCDC_HEOCFG0_BLEN_AHB_BLEN_INCR16_Val << LCDC_HEOCFG0_BLEN_Pos) /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_HEOCFG0_BLENUV_Pos               _U_(6)                                               /**< (LCDC_HEOCFG0) AHB Burst Length for U-V Channel Position */
#define LCDC_HEOCFG0_BLENUV_Msk               (_U_(0x3) << LCDC_HEOCFG0_BLENUV_Pos)                /**< (LCDC_HEOCFG0) AHB Burst Length for U-V Channel Mask */
#define LCDC_HEOCFG0_BLENUV(value)            (LCDC_HEOCFG0_BLENUV_Msk & ((value) << LCDC_HEOCFG0_BLENUV_Pos))
#define   LCDC_HEOCFG0_BLENUV_AHB_SINGLE_Val  _U_(0x0)                                             /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_HEOCFG0_BLENUV_AHB_INCR4_Val   _U_(0x1)                                             /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_HEOCFG0_BLENUV_AHB_INCR8_Val   _U_(0x2)                                             /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_HEOCFG0_BLENUV_AHB_INCR16_Val  _U_(0x3)                                             /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define LCDC_HEOCFG0_BLENUV_AHB_SINGLE        (LCDC_HEOCFG0_BLENUV_AHB_SINGLE_Val << LCDC_HEOCFG0_BLENUV_Pos) /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_HEOCFG0_BLENUV_AHB_INCR4         (LCDC_HEOCFG0_BLENUV_AHB_INCR4_Val << LCDC_HEOCFG0_BLENUV_Pos) /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_HEOCFG0_BLENUV_AHB_INCR8         (LCDC_HEOCFG0_BLENUV_AHB_INCR8_Val << LCDC_HEOCFG0_BLENUV_Pos) /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_HEOCFG0_BLENUV_AHB_INCR16        (LCDC_HEOCFG0_BLENUV_AHB_INCR16_Val << LCDC_HEOCFG0_BLENUV_Pos) /**< (LCDC_HEOCFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_HEOCFG0_DLBO_Pos                 _U_(8)                                               /**< (LCDC_HEOCFG0) Defined Length Burst Only For Channel Bus Transaction Position */
#define LCDC_HEOCFG0_DLBO_Msk                 (_U_(0x1) << LCDC_HEOCFG0_DLBO_Pos)                  /**< (LCDC_HEOCFG0) Defined Length Burst Only For Channel Bus Transaction Mask */
#define LCDC_HEOCFG0_DLBO(value)              (LCDC_HEOCFG0_DLBO_Msk & ((value) << LCDC_HEOCFG0_DLBO_Pos))
#define LCDC_HEOCFG0_ROTDIS_Pos               _U_(12)                                              /**< (LCDC_HEOCFG0) Hardware Rotation Optimization Disable Position */
#define LCDC_HEOCFG0_ROTDIS_Msk               (_U_(0x1) << LCDC_HEOCFG0_ROTDIS_Pos)                /**< (LCDC_HEOCFG0) Hardware Rotation Optimization Disable Mask */
#define LCDC_HEOCFG0_ROTDIS(value)            (LCDC_HEOCFG0_ROTDIS_Msk & ((value) << LCDC_HEOCFG0_ROTDIS_Pos))
#define LCDC_HEOCFG0_LOCKDIS_Pos              _U_(13)                                              /**< (LCDC_HEOCFG0) Hardware Rotation Lock Disable Position */
#define LCDC_HEOCFG0_LOCKDIS_Msk              (_U_(0x1) << LCDC_HEOCFG0_LOCKDIS_Pos)               /**< (LCDC_HEOCFG0) Hardware Rotation Lock Disable Mask */
#define LCDC_HEOCFG0_LOCKDIS(value)           (LCDC_HEOCFG0_LOCKDIS_Msk & ((value) << LCDC_HEOCFG0_LOCKDIS_Pos))
#define LCDC_HEOCFG0_Msk                      _U_(0x000031F1)                                      /**< (LCDC_HEOCFG0) Register Mask  */


