virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_HEOCFG19 : (LCDC Offset: 0x3D8) (R/W 32) High-End Overlay Configuration Register 19 -------- */
#define LCDC_HEOCFG19_XPHI1COEFF0_Pos         _U_(0)                                               /**< (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 0 Position */
#define LCDC_HEOCFG19_XPHI1COEFF0_Msk         (_U_(0xFF) << LCDC_HEOCFG19_XPHI1COEFF0_Pos)         /**< (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 0 Mask */
#define LCDC_HEOCFG19_XPHI1COEFF0(value)      (LCDC_HEOCFG19_XPHI1COEFF0_Msk & ((value) << LCDC_HEOCFG19_XPHI1COEFF0_Pos))
#define LCDC_HEOCFG19_XPHI1COEFF1_Pos         _U_(8)                                               /**< (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 1 Position */
#define LCDC_HEOCFG19_XPHI1COEFF1_Msk         (_U_(0xFF) << LCDC_HEOCFG19_XPHI1COEFF1_Pos)         /**< (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 1 Mask */
#define LCDC_HEOCFG19_XPHI1COEFF1(value)      (LCDC_HEOCFG19_XPHI1COEFF1_Msk & ((value) << LCDC_HEOCFG19_XPHI1COEFF1_Pos))
#define LCDC_HEOCFG19_XPHI1COEFF2_Pos         _U_(16)                                              /**< (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 2 Position */
#define LCDC_HEOCFG19_XPHI1COEFF2_Msk         (_U_(0xFF) << LCDC_HEOCFG19_XPHI1COEFF2_Pos)         /**< (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 2 Mask */
#define LCDC_HEOCFG19_XPHI1COEFF2(value)      (LCDC_HEOCFG19_XPHI1COEFF2_Msk & ((value) << LCDC_HEOCFG19_XPHI1COEFF2_Pos))
#define LCDC_HEOCFG19_XPHI1COEFF3_Pos         _U_(24)                                              /**< (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 3 Position */
#define LCDC_HEOCFG19_XPHI1COEFF3_Msk         (_U_(0xFF) << LCDC_HEOCFG19_XPHI1COEFF3_Pos)         /**< (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 3 Mask */
#define LCDC_HEOCFG19_XPHI1COEFF3(value)      (LCDC_HEOCFG19_XPHI1COEFF3_Msk & ((value) << LCDC_HEOCFG19_XPHI1COEFF3_Pos))
#define LCDC_HEOCFG19_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOCFG19) Register Mask  */


/* -------- LCDC_HEOCFG20 : (LCDC Offset: 0x3DC) (R/W 32) High-End Overlay Configuration Register 20 -------- */
#define LCDC_HEOCFG20_XPHI1COEFF4_Pos         _U_(0)                                               /**< (LCDC_HEOCFG20) Horizontal Coefficient for phase 1 tap 4 Position */
#define LCDC_HEOCFG20_XPHI1COEFF4_Msk         (_U_(0xFF) << LCDC_HEOCFG20_XPHI1COEFF4_Pos)         /**< (LCDC_HEOCFG20) Horizontal Coefficient for phase 1 tap 4 Mask */
#define LCDC_HEOCFG20_XPHI1COEFF4(value)      (LCDC_HEOCFG20_XPHI1COEFF4_Msk & ((value) << LCDC_HEOCFG20_XPHI1COEFF4_Pos))
#define LCDC_HEOCFG20_Msk                     _U_(0x000000FF)                                      /**< (LCDC_HEOCFG20) Register Mask  */


/* -------- LCDC_HEOCFG21 : (LCDC Offset: 0x3E0) (R/W 32) High-End Overlay Configuration Register 21 -------- */
#define LCDC_HEOCFG21_XPHI2COEFF0_Pos         _U_(0)                                               /**< (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 0 Position */
#define LCDC_HEOCFG21_XPHI2COEFF0_Msk         (_U_(0xFF) << LCDC_HEOCFG21_XPHI2COEFF0_Pos)         /**< (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 0 Mask */
#define LCDC_HEOCFG21_XPHI2COEFF0(value)      (LCDC_HEOCFG21_XPHI2COEFF0_Msk & ((value) << LCDC_HEOCFG21_XPHI2COEFF0_Pos))
#define LCDC_HEOCFG21_XPHI2COEFF1_Pos         _U_(8)                                               /**< (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 1 Position */
#define LCDC_HEOCFG21_XPHI2COEFF1_Msk         (_U_(0xFF) << LCDC_HEOCFG21_XPHI2COEFF1_Pos)         /**< (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 1 Mask */
#define LCDC_HEOCFG21_XPHI2COEFF1(value)      (LCDC_HEOCFG21_XPHI2COEFF1_Msk & ((value) << LCDC_HEOCFG21_XPHI2COEFF1_Pos))
#define LCDC_HEOCFG21_XPHI2COEFF2_Pos         _U_(16)                                              /**< (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 2 Position */
#define LCDC_HEOCFG21_XPHI2COEFF2_Msk         (_U_(0xFF) << LCDC_HEOCFG21_XPHI2COEFF2_Pos)         /**< (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 2 Mask */
#define LCDC_HEOCFG21_XPHI2COEFF2(value)      (LCDC_HEOCFG21_XPHI2COEFF2_Msk & ((value) << LCDC_HEOCFG21_XPHI2COEFF2_Pos))
#define LCDC_HEOCFG21_XPHI2COEFF3_Pos         _U_(24)                                              /**< (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 3 Position */
#define LCDC_HEOCFG21_XPHI2COEFF3_Msk         (_U_(0xFF) << LCDC_HEOCFG21_XPHI2COEFF3_Pos)         /**< (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 3 Mask */
#define LCDC_HEOCFG21_XPHI2COEFF3(value)      (LCDC_HEOCFG21_XPHI2COEFF3_Msk & ((value) << LCDC_HEOCFG21_XPHI2COEFF3_Pos))
#define LCDC_HEOCFG21_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOCFG21) Register Mask  */


/* -------- LCDC_HEOCFG22 : (LCDC Offset: 0x3E4) (R/W 32) High-End Overlay Configuration Register 22 -------- */
#define LCDC_HEOCFG22_XPHI2COEFF4_Pos         _U_(0)                                               /**< (LCDC_HEOCFG22) Horizontal Coefficient for phase 2 tap 4 Position */
#define LCDC_HEOCFG22_XPHI2COEFF4_Msk         (_U_(0xFF) << LCDC_HEOCFG22_XPHI2COEFF4_Pos)         /**< (LCDC_HEOCFG22) Horizontal Coefficient for phase 2 tap 4 Mask */
#define LCDC_HEOCFG22_XPHI2COEFF4(value)      (LCDC_HEOCFG22_XPHI2COEFF4_Msk & ((value) << LCDC_HEOCFG22_XPHI2COEFF4_Pos))
#define LCDC_HEOCFG22_Msk                     _U_(0x000000FF)                                      /**< (LCDC_HEOCFG22) Register Mask  */


/* -------- LCDC_HEOCFG23 : (LCDC Offset: 0x3E8) (R/W 32) High-End Overlay Configuration Register 23 -------- */
#define LCDC_HEOCFG23_XPHI3COEFF0_Pos         _U_(0)                                               /**< (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 0 Position */
#define LCDC_HEOCFG23_XPHI3COEFF0_Msk         (_U_(0xFF) << LCDC_HEOCFG23_XPHI3COEFF0_Pos)         /**< (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 0 Mask */
#define LCDC_HEOCFG23_XPHI3COEFF0(value)      (LCDC_HEOCFG23_XPHI3COEFF0_Msk & ((value) << LCDC_HEOCFG23_XPHI3COEFF0_Pos))
#define LCDC_HEOCFG23_XPHI3COEFF1_Pos         _U_(8)                                               /**< (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 1 Position */
#define LCDC_HEOCFG23_XPHI3COEFF1_Msk         (_U_(0xFF) << LCDC_HEOCFG23_XPHI3COEFF1_Pos)         /**< (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 1 Mask */
#define LCDC_HEOCFG23_XPHI3COEFF1(value)      (LCDC_HEOCFG23_XPHI3COEFF1_Msk & ((value) << LCDC_HEOCFG23_XPHI3COEFF1_Pos))
#define LCDC_HEOCFG23_XPHI3COEFF2_Pos         _U_(16)                                              /**< (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 2 Position */
#define LCDC_HEOCFG23_XPHI3COEFF2_Msk         (_U_(0xFF) << LCDC_HEOCFG23_XPHI3COEFF2_Pos)         /**< (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 2 Mask */
#define LCDC_HEOCFG23_XPHI3COEFF2(value)      (LCDC_HEOCFG23_XPHI3COEFF2_Msk & ((value) << LCDC_HEOCFG23_XPHI3COEFF2_Pos))
#define LCDC_HEOCFG23_XPHI3COEFF3_Pos         _U_(24)                                              /**< (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 3 Position */
#define LCDC_HEOCFG23_XPHI3COEFF3_Msk         (_U_(0xFF) << LCDC_HEOCFG23_XPHI3COEFF3_Pos)         /**< (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 3 Mask */
#define LCDC_HEOCFG23_XPHI3COEFF3(value)      (LCDC_HEOCFG23_XPHI3COEFF3_Msk & ((value) << LCDC_HEOCFG23_XPHI3COEFF3_Pos))
#define LCDC_HEOCFG23_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOCFG23) Register Mask  */


/* -------- LCDC_HEOCFG24 : (LCDC Offset: 0x3EC) (R/W 32) High-End Overlay Configuration Register 24 -------- */
#define LCDC_HEOCFG24_XPHI3COEFF4_Pos         _U_(0)                                               /**< (LCDC_HEOCFG24) Horizontal Coefficient for phase 3 tap 4 Position */
#define LCDC_HEOCFG24_XPHI3COEFF4_Msk         (_U_(0xFF) << LCDC_HEOCFG24_XPHI3COEFF4_Pos)         /**< (LCDC_HEOCFG24) Horizontal Coefficient for phase 3 tap 4 Mask */
#define LCDC_HEOCFG24_XPHI3COEFF4(value)      (LCDC_HEOCFG24_XPHI3COEFF4_Msk & ((value) << LCDC_HEOCFG24_XPHI3COEFF4_Pos))
#define LCDC_HEOCFG24_Msk                     _U_(0x000000FF)                                      /**< (LCDC_HEOCFG24) Register Mask  */


