virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_PPCHER : (LCDC Offset: 0x540) ( /W 32) Post Processing Channel Enable Register -------- */
#define LCDC_PPCHER_CHEN_Pos                  _U_(0)                                               /**< (LCDC_PPCHER) Channel Enable Position */
#define LCDC_PPCHER_CHEN_Msk                  (_U_(0x1) << LCDC_PPCHER_CHEN_Pos)                   /**< (LCDC_PPCHER) Channel Enable Mask */
#define LCDC_PPCHER_CHEN(value)               (LCDC_PPCHER_CHEN_Msk & ((value) << LCDC_PPCHER_CHEN_Pos))
#define LCDC_PPCHER_UPDATEEN_Pos              _U_(1)                                               /**< (LCDC_PPCHER) Update Overlay Attributes Enable Position */
#define LCDC_PPCHER_UPDATEEN_Msk              (_U_(0x1) << LCDC_PPCHER_UPDATEEN_Pos)               /**< (LCDC_PPCHER) Update Overlay Attributes Enable Mask */
#define LCDC_PPCHER_UPDATEEN(value)           (LCDC_PPCHER_UPDATEEN_Msk & ((value) << LCDC_PPCHER_UPDATEEN_Pos))
#define LCDC_PPCHER_A2QEN_Pos                 _U_(2)                                               /**< (LCDC_PPCHER) Add To Queue Enable Position */
#define LCDC_PPCHER_A2QEN_Msk                 (_U_(0x1) << LCDC_PPCHER_A2QEN_Pos)                  /**< (LCDC_PPCHER) Add To Queue Enable Mask */
#define LCDC_PPCHER_A2QEN(value)              (LCDC_PPCHER_A2QEN_Msk & ((value) << LCDC_PPCHER_A2QEN_Pos))
#define LCDC_PPCHER_Msk                       _U_(0x00000007)                                      /**< (LCDC_PPCHER) Register Mask  */


/* -------- LCDC_PPCHDR : (LCDC Offset: 0x544) ( /W 32) Post Processing Channel Disable Register -------- */
#define LCDC_PPCHDR_CHDIS_Pos                 _U_(0)                                               /**< (LCDC_PPCHDR) Channel Disable Position */
#define LCDC_PPCHDR_CHDIS_Msk                 (_U_(0x1) << LCDC_PPCHDR_CHDIS_Pos)                  /**< (LCDC_PPCHDR) Channel Disable Mask */
#define LCDC_PPCHDR_CHDIS(value)              (LCDC_PPCHDR_CHDIS_Msk & ((value) << LCDC_PPCHDR_CHDIS_Pos))
#define LCDC_PPCHDR_CHRST_Pos                 _U_(8)                                               /**< (LCDC_PPCHDR) Channel Reset Position */
#define LCDC_PPCHDR_CHRST_Msk                 (_U_(0x1) << LCDC_PPCHDR_CHRST_Pos)                  /**< (LCDC_PPCHDR) Channel Reset Mask */
#define LCDC_PPCHDR_CHRST(value)              (LCDC_PPCHDR_CHRST_Msk & ((value) << LCDC_PPCHDR_CHRST_Pos))
#define LCDC_PPCHDR_Msk                       _U_(0x00000101)                                      /**< (LCDC_PPCHDR) Register Mask  */


/* -------- LCDC_PPCHSR : (LCDC Offset: 0x548) ( R/ 32) Post Processing Channel Status Register -------- */
#define LCDC_PPCHSR_CHSR_Pos                  _U_(0)                                               /**< (LCDC_PPCHSR) Channel Status Position */
#define LCDC_PPCHSR_CHSR_Msk                  (_U_(0x1) << LCDC_PPCHSR_CHSR_Pos)                   /**< (LCDC_PPCHSR) Channel Status Mask */
#define LCDC_PPCHSR_CHSR(value)               (LCDC_PPCHSR_CHSR_Msk & ((value) << LCDC_PPCHSR_CHSR_Pos))
#define LCDC_PPCHSR_UPDATESR_Pos              _U_(1)                                               /**< (LCDC_PPCHSR) Update Overlay Attributes In Progress Status Position */
#define LCDC_PPCHSR_UPDATESR_Msk              (_U_(0x1) << LCDC_PPCHSR_UPDATESR_Pos)               /**< (LCDC_PPCHSR) Update Overlay Attributes In Progress Status Mask */
#define LCDC_PPCHSR_UPDATESR(value)           (LCDC_PPCHSR_UPDATESR_Msk & ((value) << LCDC_PPCHSR_UPDATESR_Pos))
#define LCDC_PPCHSR_A2QSR_Pos                 _U_(2)                                               /**< (LCDC_PPCHSR) Add To Queue Status Position */
#define LCDC_PPCHSR_A2QSR_Msk                 (_U_(0x1) << LCDC_PPCHSR_A2QSR_Pos)                  /**< (LCDC_PPCHSR) Add To Queue Status Mask */
#define LCDC_PPCHSR_A2QSR(value)              (LCDC_PPCHSR_A2QSR_Msk & ((value) << LCDC_PPCHSR_A2QSR_Pos))
#define LCDC_PPCHSR_Msk                       _U_(0x00000007)                                      /**< (LCDC_PPCHSR) Register Mask  */


/* -------- LCDC_PPIER : (LCDC Offset: 0x54C) ( /W 32) Post Processing Interrupt Enable Register -------- */
#define LCDC_PPIER_DMA_Pos                    _U_(2)                                               /**< (LCDC_PPIER) End of DMA Transfer Interrupt Enable Position */
#define LCDC_PPIER_DMA_Msk                    (_U_(0x1) << LCDC_PPIER_DMA_Pos)                     /**< (LCDC_PPIER) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_PPIER_DMA(value)                 (LCDC_PPIER_DMA_Msk & ((value) << LCDC_PPIER_DMA_Pos))
#define LCDC_PPIER_DSCR_Pos                   _U_(3)                                               /**< (LCDC_PPIER) Descriptor Loaded Interrupt Enable Position */
#define LCDC_PPIER_DSCR_Msk                   (_U_(0x1) << LCDC_PPIER_DSCR_Pos)                    /**< (LCDC_PPIER) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_PPIER_DSCR(value)                (LCDC_PPIER_DSCR_Msk & ((value) << LCDC_PPIER_DSCR_Pos))
#define LCDC_PPIER_ADD_Pos                    _U_(4)                                               /**< (LCDC_PPIER) Head Descriptor Loaded Interrupt Enable Position */
#define LCDC_PPIER_ADD_Msk                    (_U_(0x1) << LCDC_PPIER_ADD_Pos)                     /**< (LCDC_PPIER) Head Descriptor Loaded Interrupt Enable Mask */
#define LCDC_PPIER_ADD(value)                 (LCDC_PPIER_ADD_Msk & ((value) << LCDC_PPIER_ADD_Pos))
#define LCDC_PPIER_DONE_Pos                   _U_(5)                                               /**< (LCDC_PPIER) End of List Interrupt Enable Position */
#define LCDC_PPIER_DONE_Msk                   (_U_(0x1) << LCDC_PPIER_DONE_Pos)                    /**< (LCDC_PPIER) End of List Interrupt Enable Mask */
#define LCDC_PPIER_DONE(value)                (LCDC_PPIER_DONE_Msk & ((value) << LCDC_PPIER_DONE_Pos))
#define LCDC_PPIER_Msk                        _U_(0x0000003C)                                      /**< (LCDC_PPIER) Register Mask  */


/* -------- LCDC_PPIDR : (LCDC Offset: 0x550) ( /W 32) Post Processing Interrupt Disable Register -------- */
#define LCDC_PPIDR_DMA_Pos                    _U_(2)                                               /**< (LCDC_PPIDR) End of DMA Transfer Interrupt Disable Position */
#define LCDC_PPIDR_DMA_Msk                    (_U_(0x1) << LCDC_PPIDR_DMA_Pos)                     /**< (LCDC_PPIDR) End of DMA Transfer Interrupt Disable Mask */
#define LCDC_PPIDR_DMA(value)                 (LCDC_PPIDR_DMA_Msk & ((value) << LCDC_PPIDR_DMA_Pos))
#define LCDC_PPIDR_DSCR_Pos                   _U_(3)                                               /**< (LCDC_PPIDR) Descriptor Loaded Interrupt Disable Position */
#define LCDC_PPIDR_DSCR_Msk                   (_U_(0x1) << LCDC_PPIDR_DSCR_Pos)                    /**< (LCDC_PPIDR) Descriptor Loaded Interrupt Disable Mask */
#define LCDC_PPIDR_DSCR(value)                (LCDC_PPIDR_DSCR_Msk & ((value) << LCDC_PPIDR_DSCR_Pos))
#define LCDC_PPIDR_ADD_Pos                    _U_(4)                                               /**< (LCDC_PPIDR) Head Descriptor Loaded Interrupt Disable Position */
#define LCDC_PPIDR_ADD_Msk                    (_U_(0x1) << LCDC_PPIDR_ADD_Pos)                     /**< (LCDC_PPIDR) Head Descriptor Loaded Interrupt Disable Mask */
#define LCDC_PPIDR_ADD(value)                 (LCDC_PPIDR_ADD_Msk & ((value) << LCDC_PPIDR_ADD_Pos))
#define LCDC_PPIDR_DONE_Pos                   _U_(5)                                               /**< (LCDC_PPIDR) End of List Interrupt Disable Position */
#define LCDC_PPIDR_DONE_Msk                   (_U_(0x1) << LCDC_PPIDR_DONE_Pos)                    /**< (LCDC_PPIDR) End of List Interrupt Disable Mask */
#define LCDC_PPIDR_DONE(value)                (LCDC_PPIDR_DONE_Msk & ((value) << LCDC_PPIDR_DONE_Pos))
#define LCDC_PPIDR_Msk                        _U_(0x0000003C)                                      /**< (LCDC_PPIDR) Register Mask  */


/* -------- LCDC_PPIMR : (LCDC Offset: 0x554) ( R/ 32) Post Processing Interrupt Mask Register -------- */
#define LCDC_PPIMR_DMA_Pos                    _U_(2)                                               /**< (LCDC_PPIMR) End of DMA Transfer Interrupt Mask Position */
#define LCDC_PPIMR_DMA_Msk                    (_U_(0x1) << LCDC_PPIMR_DMA_Pos)                     /**< (LCDC_PPIMR) End of DMA Transfer Interrupt Mask Mask */
#define LCDC_PPIMR_DMA(value)                 (LCDC_PPIMR_DMA_Msk & ((value) << LCDC_PPIMR_DMA_Pos))
#define LCDC_PPIMR_DSCR_Pos                   _U_(3)                                               /**< (LCDC_PPIMR) Descriptor Loaded Interrupt Mask Position */
#define LCDC_PPIMR_DSCR_Msk                   (_U_(0x1) << LCDC_PPIMR_DSCR_Pos)                    /**< (LCDC_PPIMR) Descriptor Loaded Interrupt Mask Mask */
#define LCDC_PPIMR_DSCR(value)                (LCDC_PPIMR_DSCR_Msk & ((value) << LCDC_PPIMR_DSCR_Pos))
#define LCDC_PPIMR_ADD_Pos                    _U_(4)                                               /**< (LCDC_PPIMR) Head Descriptor Loaded Interrupt Mask Position */
#define LCDC_PPIMR_ADD_Msk                    (_U_(0x1) << LCDC_PPIMR_ADD_Pos)                     /**< (LCDC_PPIMR) Head Descriptor Loaded Interrupt Mask Mask */
#define LCDC_PPIMR_ADD(value)                 (LCDC_PPIMR_ADD_Msk & ((value) << LCDC_PPIMR_ADD_Pos))
#define LCDC_PPIMR_DONE_Pos                   _U_(5)                                               /**< (LCDC_PPIMR) End of List Interrupt Mask Position */
#define LCDC_PPIMR_DONE_Msk                   (_U_(0x1) << LCDC_PPIMR_DONE_Pos)                    /**< (LCDC_PPIMR) End of List Interrupt Mask Mask */
#define LCDC_PPIMR_DONE(value)                (LCDC_PPIMR_DONE_Msk & ((value) << LCDC_PPIMR_DONE_Pos))
#define LCDC_PPIMR_Msk                        _U_(0x0000003C)                                      /**< (LCDC_PPIMR) Register Mask  */


/* -------- LCDC_PPISR : (LCDC Offset: 0x558) ( R/ 32) Post Processing Interrupt Status Register -------- */
#define LCDC_PPISR_DMA_Pos                    _U_(2)                                               /**< (LCDC_PPISR) End of DMA Transfer Position */
#define LCDC_PPISR_DMA_Msk                    (_U_(0x1) << LCDC_PPISR_DMA_Pos)                     /**< (LCDC_PPISR) End of DMA Transfer Mask */
#define LCDC_PPISR_DMA(value)                 (LCDC_PPISR_DMA_Msk & ((value) << LCDC_PPISR_DMA_Pos))
#define LCDC_PPISR_DSCR_Pos                   _U_(3)                                               /**< (LCDC_PPISR) DMA Descriptor Loaded Position */
#define LCDC_PPISR_DSCR_Msk                   (_U_(0x1) << LCDC_PPISR_DSCR_Pos)                    /**< (LCDC_PPISR) DMA Descriptor Loaded Mask */
#define LCDC_PPISR_DSCR(value)                (LCDC_PPISR_DSCR_Msk & ((value) << LCDC_PPISR_DSCR_Pos))
#define LCDC_PPISR_ADD_Pos                    _U_(4)                                               /**< (LCDC_PPISR) Head Descriptor Loaded Position */
#define LCDC_PPISR_ADD_Msk                    (_U_(0x1) << LCDC_PPISR_ADD_Pos)                     /**< (LCDC_PPISR) Head Descriptor Loaded Mask */
#define LCDC_PPISR_ADD(value)                 (LCDC_PPISR_ADD_Msk & ((value) << LCDC_PPISR_ADD_Pos))
#define LCDC_PPISR_DONE_Pos                   _U_(5)                                               /**< (LCDC_PPISR) End of List Detected Position */
#define LCDC_PPISR_DONE_Msk                   (_U_(0x1) << LCDC_PPISR_DONE_Pos)                    /**< (LCDC_PPISR) End of List Detected Mask */
#define LCDC_PPISR_DONE(value)                (LCDC_PPISR_DONE_Msk & ((value) << LCDC_PPISR_DONE_Pos))
#define LCDC_PPISR_Msk                        _U_(0x0000003C)                                      /**< (LCDC_PPISR) Register Mask  */


/* -------- LCDC_PPHEAD : (LCDC Offset: 0x55C) (R/W 32) Post Processing Head Register -------- */
#define LCDC_PPHEAD_HEAD_Pos                  _U_(2)                                               /**< (LCDC_PPHEAD) DMA Head Pointer Position */
#define LCDC_PPHEAD_HEAD_Msk                  (_U_(0x3FFFFFFF) << LCDC_PPHEAD_HEAD_Pos)            /**< (LCDC_PPHEAD) DMA Head Pointer Mask */
#define LCDC_PPHEAD_HEAD(value)               (LCDC_PPHEAD_HEAD_Msk & ((value) << LCDC_PPHEAD_HEAD_Pos))
#define LCDC_PPHEAD_Msk                       _U_(0xFFFFFFFC)                                      /**< (LCDC_PPHEAD) Register Mask  */


/* -------- LCDC_PPADDR : (LCDC Offset: 0x560) (R/W 32) Post Processing Address Register -------- */
#define LCDC_PPADDR_ADDR_Pos                  _U_(0)                                               /**< (LCDC_PPADDR) DMA Transfer Start Address Position */
#define LCDC_PPADDR_ADDR_Msk                  (_U_(0xFFFFFFFF) << LCDC_PPADDR_ADDR_Pos)            /**< (LCDC_PPADDR) DMA Transfer Start Address Mask */
#define LCDC_PPADDR_ADDR(value)               (LCDC_PPADDR_ADDR_Msk & ((value) << LCDC_PPADDR_ADDR_Pos))
#define LCDC_PPADDR_Msk                       _U_(0xFFFFFFFF)                                      /**< (LCDC_PPADDR) Register Mask  */


