virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_PPCTRL : (LCDC Offset: 0x564) (R/W 32) Post Processing Control Register -------- */
#define LCDC_PPCTRL_DFETCH_Pos                _U_(0)                                               /**< (LCDC_PPCTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_PPCTRL_DFETCH_Msk                (_U_(0x1) << LCDC_PPCTRL_DFETCH_Pos)                 /**< (LCDC_PPCTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_PPCTRL_DFETCH(value)             (LCDC_PPCTRL_DFETCH_Msk & ((value) << LCDC_PPCTRL_DFETCH_Pos))
#define LCDC_PPCTRL_DMAIEN_Pos                _U_(2)                                               /**< (LCDC_PPCTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_PPCTRL_DMAIEN_Msk                (_U_(0x1) << LCDC_PPCTRL_DMAIEN_Pos)                 /**< (LCDC_PPCTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_PPCTRL_DMAIEN(value)             (LCDC_PPCTRL_DMAIEN_Msk & ((value) << LCDC_PPCTRL_DMAIEN_Pos))
#define LCDC_PPCTRL_DSCRIEN_Pos               _U_(3)                                               /**< (LCDC_PPCTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_PPCTRL_DSCRIEN_Msk               (_U_(0x1) << LCDC_PPCTRL_DSCRIEN_Pos)                /**< (LCDC_PPCTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_PPCTRL_DSCRIEN(value)            (LCDC_PPCTRL_DSCRIEN_Msk & ((value) << LCDC_PPCTRL_DSCRIEN_Pos))
#define LCDC_PPCTRL_ADDIEN_Pos                _U_(4)                                               /**< (LCDC_PPCTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_PPCTRL_ADDIEN_Msk                (_U_(0x1) << LCDC_PPCTRL_ADDIEN_Pos)                 /**< (LCDC_PPCTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_PPCTRL_ADDIEN(value)             (LCDC_PPCTRL_ADDIEN_Msk & ((value) << LCDC_PPCTRL_ADDIEN_Pos))
#define LCDC_PPCTRL_DONEIEN_Pos               _U_(5)                                               /**< (LCDC_PPCTRL) End of List Interrupt Enable Position */
#define LCDC_PPCTRL_DONEIEN_Msk               (_U_(0x1) << LCDC_PPCTRL_DONEIEN_Pos)                /**< (LCDC_PPCTRL) End of List Interrupt Enable Mask */
#define LCDC_PPCTRL_DONEIEN(value)            (LCDC_PPCTRL_DONEIEN_Msk & ((value) << LCDC_PPCTRL_DONEIEN_Pos))
#define LCDC_PPCTRL_Msk                       _U_(0x0000003D)                                      /**< (LCDC_PPCTRL) Register Mask  */


/* -------- LCDC_PPNEXT : (LCDC Offset: 0x568) (R/W 32) Post Processing Next Register -------- */
#define LCDC_PPNEXT_NEXT_Pos                  _U_(0)                                               /**< (LCDC_PPNEXT) DMA Descriptor Next Address Position */
#define LCDC_PPNEXT_NEXT_Msk                  (_U_(0xFFFFFFFF) << LCDC_PPNEXT_NEXT_Pos)            /**< (LCDC_PPNEXT) DMA Descriptor Next Address Mask */
#define LCDC_PPNEXT_NEXT(value)               (LCDC_PPNEXT_NEXT_Msk & ((value) << LCDC_PPNEXT_NEXT_Pos))
#define LCDC_PPNEXT_Msk                       _U_(0xFFFFFFFF)                                      /**< (LCDC_PPNEXT) Register Mask  */


/* -------- LCDC_PPCFG0 : (LCDC Offset: 0x56C) (R/W 32) Post Processing Configuration Register 0 -------- */
#define LCDC_PPCFG0_SIF_Pos                   _U_(0)                                               /**< (LCDC_PPCFG0) Source Interface Position */
#define LCDC_PPCFG0_SIF_Msk                   (_U_(0x1) << LCDC_PPCFG0_SIF_Pos)                    /**< (LCDC_PPCFG0) Source Interface Mask */
#define LCDC_PPCFG0_SIF(value)                (LCDC_PPCFG0_SIF_Msk & ((value) << LCDC_PPCFG0_SIF_Pos))
#define LCDC_PPCFG0_BLEN_Pos                  _U_(4)                                               /**< (LCDC_PPCFG0) AHB Burst Length Position */
#define LCDC_PPCFG0_BLEN_Msk                  (_U_(0x3) << LCDC_PPCFG0_BLEN_Pos)                   /**< (LCDC_PPCFG0) AHB Burst Length Mask */
#define LCDC_PPCFG0_BLEN(value)               (LCDC_PPCFG0_BLEN_Msk & ((value) << LCDC_PPCFG0_BLEN_Pos))
#define LCDC_PPCFG0_DLBO_Pos                  _U_(8)                                               /**< (LCDC_PPCFG0) Defined Length Burst Only For Channel Bus Transaction Position */
#define LCDC_PPCFG0_DLBO_Msk                  (_U_(0x1) << LCDC_PPCFG0_DLBO_Pos)                   /**< (LCDC_PPCFG0) Defined Length Burst Only For Channel Bus Transaction Mask */
#define LCDC_PPCFG0_DLBO(value)               (LCDC_PPCFG0_DLBO_Msk & ((value) << LCDC_PPCFG0_DLBO_Pos))
#define LCDC_PPCFG0_Msk                       _U_(0x00000131)                                      /**< (LCDC_PPCFG0) Register Mask  */


/* -------- LCDC_PPCFG1 : (LCDC Offset: 0x570) (R/W 32) Post Processing Configuration Register 1 -------- */
#define LCDC_PPCFG1_PPMODE_Pos                _U_(0)                                               /**< (LCDC_PPCFG1) Post Processing Output Format Selection Position */
#define LCDC_PPCFG1_PPMODE_Msk                (_U_(0x7) << LCDC_PPCFG1_PPMODE_Pos)                 /**< (LCDC_PPCFG1) Post Processing Output Format Selection Mask */
#define LCDC_PPCFG1_PPMODE(value)             (LCDC_PPCFG1_PPMODE_Msk & ((value) << LCDC_PPCFG1_PPMODE_Pos))
#define   LCDC_PPCFG1_PPMODE_PPMODE_RGB_16BPP_Val _U_(0x0)                                             /**< (LCDC_PPCFG1) RGB 16 bpp  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_PACKED_Val _U_(0x1)                                             /**< (LCDC_PPCFG1) RGB 24 bpp PACKED  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_UNPACKED_Val _U_(0x2)                                             /**< (LCDC_PPCFG1) RGB 24 bpp UNPACKED  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE0_Val _U_(0x3)                                             /**< (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 0)  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE1_Val _U_(0x4)                                             /**< (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 1)  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE2_Val _U_(0x5)                                             /**< (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 2)  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE3_Val _U_(0x6)                                             /**< (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 3)  */
#define LCDC_PPCFG1_PPMODE_PPMODE_RGB_16BPP   (LCDC_PPCFG1_PPMODE_PPMODE_RGB_16BPP_Val << LCDC_PPCFG1_PPMODE_Pos) /**< (LCDC_PPCFG1) RGB 16 bpp Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_PACKED (LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_PACKED_Val << LCDC_PPCFG1_PPMODE_Pos) /**< (LCDC_PPCFG1) RGB 24 bpp PACKED Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_UNPACKED (LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_UNPACKED_Val << LCDC_PPCFG1_PPMODE_Pos) /**< (LCDC_PPCFG1) RGB 24 bpp UNPACKED Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE0 (LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE0_Val << LCDC_PPCFG1_PPMODE_Pos) /**< (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 0) Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE1 (LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE1_Val << LCDC_PPCFG1_PPMODE_Pos) /**< (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 1) Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE2 (LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE2_Val << LCDC_PPCFG1_PPMODE_Pos) /**< (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 2) Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE3 (LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE3_Val << LCDC_PPCFG1_PPMODE_Pos) /**< (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 3) Position  */
#define LCDC_PPCFG1_ITUBT601_Pos              _U_(4)                                               /**< (LCDC_PPCFG1) Color Space Conversion Luminance Position */
#define LCDC_PPCFG1_ITUBT601_Msk              (_U_(0x1) << LCDC_PPCFG1_ITUBT601_Pos)               /**< (LCDC_PPCFG1) Color Space Conversion Luminance Mask */
#define LCDC_PPCFG1_ITUBT601(value)           (LCDC_PPCFG1_ITUBT601_Msk & ((value) << LCDC_PPCFG1_ITUBT601_Pos))
#define LCDC_PPCFG1_Msk                       _U_(0x00000017)                                      /**< (LCDC_PPCFG1) Register Mask  */

#define LCDC_PPCFG1_ITUBT_Pos                 _U_(4)                                               /**< (LCDC_PPCFG1 Position) Color Space Conversion Luminance */
#define LCDC_PPCFG1_ITUBT_Msk                 (_U_(0x1) << LCDC_PPCFG1_ITUBT_Pos)                  /**< (LCDC_PPCFG1 Mask) ITUBT */
#define LCDC_PPCFG1_ITUBT(value)              (LCDC_PPCFG1_ITUBT_Msk & ((value) << LCDC_PPCFG1_ITUBT_Pos)) 

/* -------- LCDC_PPCFG2 : (LCDC Offset: 0x574) (R/W 32) Post Processing Configuration Register 2 -------- */
#define LCDC_PPCFG2_XSTRIDE_Pos               _U_(0)                                               /**< (LCDC_PPCFG2) Horizontal Stride Position */
#define LCDC_PPCFG2_XSTRIDE_Msk               (_U_(0xFFFFFFFF) << LCDC_PPCFG2_XSTRIDE_Pos)         /**< (LCDC_PPCFG2) Horizontal Stride Mask */
#define LCDC_PPCFG2_XSTRIDE(value)            (LCDC_PPCFG2_XSTRIDE_Msk & ((value) << LCDC_PPCFG2_XSTRIDE_Pos))
#define LCDC_PPCFG2_Msk                       _U_(0xFFFFFFFF)                                      /**< (LCDC_PPCFG2) Register Mask  */


/* -------- LCDC_PPCFG3 : (LCDC Offset: 0x578) (R/W 32) Post Processing Configuration Register 3 -------- */
#define LCDC_PPCFG3_CSCYR_Pos                 _U_(0)                                               /**< (LCDC_PPCFG3) Color Space Conversion R coefficient for Luminance component, signed format, step set to 1/1024 Position */
#define LCDC_PPCFG3_CSCYR_Msk                 (_U_(0x3FF) << LCDC_PPCFG3_CSCYR_Pos)                /**< (LCDC_PPCFG3) Color Space Conversion R coefficient for Luminance component, signed format, step set to 1/1024 Mask */
#define LCDC_PPCFG3_CSCYR(value)              (LCDC_PPCFG3_CSCYR_Msk & ((value) << LCDC_PPCFG3_CSCYR_Pos))
#define LCDC_PPCFG3_CSCYG_Pos                 _U_(10)                                              /**< (LCDC_PPCFG3) Color Space Conversion G coefficient for Luminance component, signed format, step set to 1/512 Position */
#define LCDC_PPCFG3_CSCYG_Msk                 (_U_(0x3FF) << LCDC_PPCFG3_CSCYG_Pos)                /**< (LCDC_PPCFG3) Color Space Conversion G coefficient for Luminance component, signed format, step set to 1/512 Mask */
#define LCDC_PPCFG3_CSCYG(value)              (LCDC_PPCFG3_CSCYG_Msk & ((value) << LCDC_PPCFG3_CSCYG_Pos))
#define LCDC_PPCFG3_CSCYB_Pos                 _U_(20)                                              /**< (LCDC_PPCFG3) Color Space Conversion B coefficient for Luminance component, signed format, step set to 1/1024 Position */
#define LCDC_PPCFG3_CSCYB_Msk                 (_U_(0x3FF) << LCDC_PPCFG3_CSCYB_Pos)                /**< (LCDC_PPCFG3) Color Space Conversion B coefficient for Luminance component, signed format, step set to 1/1024 Mask */
#define LCDC_PPCFG3_CSCYB(value)              (LCDC_PPCFG3_CSCYB_Msk & ((value) << LCDC_PPCFG3_CSCYB_Pos))
#define LCDC_PPCFG3_CSCYOFF_Pos               _U_(30)                                              /**< (LCDC_PPCFG3) Color Space Conversion Luminance Offset Position */
#define LCDC_PPCFG3_CSCYOFF_Msk               (_U_(0x1) << LCDC_PPCFG3_CSCYOFF_Pos)                /**< (LCDC_PPCFG3) Color Space Conversion Luminance Offset Mask */
#define LCDC_PPCFG3_CSCYOFF(value)            (LCDC_PPCFG3_CSCYOFF_Msk & ((value) << LCDC_PPCFG3_CSCYOFF_Pos))
#define LCDC_PPCFG3_Msk                       _U_(0x7FFFFFFF)                                      /**< (LCDC_PPCFG3) Register Mask  */


/* -------- LCDC_PPCFG4 : (LCDC Offset: 0x57C) (R/W 32) Post Processing Configuration Register 4 -------- */
#define LCDC_PPCFG4_CSCUR_Pos                 _U_(0)                                               /**< (LCDC_PPCFG4) Color Space Conversion R coefficient for Chrominance B component, signed format. (step 1/1024) Position */
#define LCDC_PPCFG4_CSCUR_Msk                 (_U_(0x3FF) << LCDC_PPCFG4_CSCUR_Pos)                /**< (LCDC_PPCFG4) Color Space Conversion R coefficient for Chrominance B component, signed format. (step 1/1024) Mask */
#define LCDC_PPCFG4_CSCUR(value)              (LCDC_PPCFG4_CSCUR_Msk & ((value) << LCDC_PPCFG4_CSCUR_Pos))
#define LCDC_PPCFG4_CSCUG_Pos                 _U_(10)                                              /**< (LCDC_PPCFG4) Color Space Conversion G coefficient for Chrominance B component, signed format. (step 1/512) Position */
#define LCDC_PPCFG4_CSCUG_Msk                 (_U_(0x3FF) << LCDC_PPCFG4_CSCUG_Pos)                /**< (LCDC_PPCFG4) Color Space Conversion G coefficient for Chrominance B component, signed format. (step 1/512) Mask */
#define LCDC_PPCFG4_CSCUG(value)              (LCDC_PPCFG4_CSCUG_Msk & ((value) << LCDC_PPCFG4_CSCUG_Pos))
#define LCDC_PPCFG4_CSCUB_Pos                 _U_(20)                                              /**< (LCDC_PPCFG4) Color Space Conversion B coefficient for Chrominance B component, signed format. (step 1/512) Position */
#define LCDC_PPCFG4_CSCUB_Msk                 (_U_(0x3FF) << LCDC_PPCFG4_CSCUB_Pos)                /**< (LCDC_PPCFG4) Color Space Conversion B coefficient for Chrominance B component, signed format. (step 1/512) Mask */
#define LCDC_PPCFG4_CSCUB(value)              (LCDC_PPCFG4_CSCUB_Msk & ((value) << LCDC_PPCFG4_CSCUB_Pos))
#define LCDC_PPCFG4_CSCUOFF_Pos               _U_(30)                                              /**< (LCDC_PPCFG4) Color Space Conversion Chrominance B Offset Position */
#define LCDC_PPCFG4_CSCUOFF_Msk               (_U_(0x1) << LCDC_PPCFG4_CSCUOFF_Pos)                /**< (LCDC_PPCFG4) Color Space Conversion Chrominance B Offset Mask */
#define LCDC_PPCFG4_CSCUOFF(value)            (LCDC_PPCFG4_CSCUOFF_Msk & ((value) << LCDC_PPCFG4_CSCUOFF_Pos))
#define LCDC_PPCFG4_Msk                       _U_(0x7FFFFFFF)                                      /**< (LCDC_PPCFG4) Register Mask  */


