virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/* -------- LCDC_PPCFG5 : (LCDC Offset: 0x580) (R/W 32) Post Processing Configuration Register 5 -------- */
#define LCDC_PPCFG5_CSCVR_Pos                 _U_(0)                                               /**< (LCDC_PPCFG5) Color Space Conversion R coefficient for Chrominance R component, signed format. (step 1/1024) Position */
#define LCDC_PPCFG5_CSCVR_Msk                 (_U_(0x3FF) << LCDC_PPCFG5_CSCVR_Pos)                /**< (LCDC_PPCFG5) Color Space Conversion R coefficient for Chrominance R component, signed format. (step 1/1024) Mask */
#define LCDC_PPCFG5_CSCVR(value)              (LCDC_PPCFG5_CSCVR_Msk & ((value) << LCDC_PPCFG5_CSCVR_Pos))
#define LCDC_PPCFG5_CSCVG_Pos                 _U_(10)                                              /**< (LCDC_PPCFG5) Color Space Conversion G coefficient for Chrominance R component, signed format. (step 1/512) Position */
#define LCDC_PPCFG5_CSCVG_Msk                 (_U_(0x3FF) << LCDC_PPCFG5_CSCVG_Pos)                /**< (LCDC_PPCFG5) Color Space Conversion G coefficient for Chrominance R component, signed format. (step 1/512) Mask */
#define LCDC_PPCFG5_CSCVG(value)              (LCDC_PPCFG5_CSCVG_Msk & ((value) << LCDC_PPCFG5_CSCVG_Pos))
#define LCDC_PPCFG5_CSCVB_Pos                 _U_(20)                                              /**< (LCDC_PPCFG5) Color Space Conversion B coefficient for Chrominance R component, signed format. (step 1/1024) Position */
#define LCDC_PPCFG5_CSCVB_Msk                 (_U_(0x3FF) << LCDC_PPCFG5_CSCVB_Pos)                /**< (LCDC_PPCFG5) Color Space Conversion B coefficient for Chrominance R component, signed format. (step 1/1024) Mask */
#define LCDC_PPCFG5_CSCVB(value)              (LCDC_PPCFG5_CSCVB_Msk & ((value) << LCDC_PPCFG5_CSCVB_Pos))
#define LCDC_PPCFG5_CSCVOFF_Pos               _U_(30)                                              /**< (LCDC_PPCFG5) Color Space Conversion Chrominance R Offset Position */
#define LCDC_PPCFG5_CSCVOFF_Msk               (_U_(0x1) << LCDC_PPCFG5_CSCVOFF_Pos)                /**< (LCDC_PPCFG5) Color Space Conversion Chrominance R Offset Mask */
#define LCDC_PPCFG5_CSCVOFF(value)            (LCDC_PPCFG5_CSCVOFF_Msk & ((value) << LCDC_PPCFG5_CSCVOFF_Pos))
#define LCDC_PPCFG5_Msk                       _U_(0x7FFFFFFF)                                      /**< (LCDC_PPCFG5) Register Mask  */


/* -------- LCDC_BASECLUT : (LCDC Offset: 0x600) (R/W 32) Base CLUT Register -------- */
#define LCDC_BASECLUT_BCLUT_Pos               _U_(0)                                               /**< (LCDC_BASECLUT) Blue Color Entry Position */
#define LCDC_BASECLUT_BCLUT_Msk               (_U_(0xFF) << LCDC_BASECLUT_BCLUT_Pos)               /**< (LCDC_BASECLUT) Blue Color Entry Mask */
#define LCDC_BASECLUT_BCLUT(value)            (LCDC_BASECLUT_BCLUT_Msk & ((value) << LCDC_BASECLUT_BCLUT_Pos))
#define LCDC_BASECLUT_GCLUT_Pos               _U_(8)                                               /**< (LCDC_BASECLUT) Green Color Entry Position */
#define LCDC_BASECLUT_GCLUT_Msk               (_U_(0xFF) << LCDC_BASECLUT_GCLUT_Pos)               /**< (LCDC_BASECLUT) Green Color Entry Mask */
#define LCDC_BASECLUT_GCLUT(value)            (LCDC_BASECLUT_GCLUT_Msk & ((value) << LCDC_BASECLUT_GCLUT_Pos))
#define LCDC_BASECLUT_RCLUT_Pos               _U_(16)                                              /**< (LCDC_BASECLUT) Red Color Entry Position */
#define LCDC_BASECLUT_RCLUT_Msk               (_U_(0xFF) << LCDC_BASECLUT_RCLUT_Pos)               /**< (LCDC_BASECLUT) Red Color Entry Mask */
#define LCDC_BASECLUT_RCLUT(value)            (LCDC_BASECLUT_RCLUT_Msk & ((value) << LCDC_BASECLUT_RCLUT_Pos))
#define LCDC_BASECLUT_Msk                     _U_(0x00FFFFFF)                                      /**< (LCDC_BASECLUT) Register Mask  */


/* -------- LCDC_OVR1CLUT : (LCDC Offset: 0xA00) (R/W 32) Overlay 1 CLUT Register -------- */
#define LCDC_OVR1CLUT_BCLUT_Pos               _U_(0)                                               /**< (LCDC_OVR1CLUT) Blue Color Entry Position */
#define LCDC_OVR1CLUT_BCLUT_Msk               (_U_(0xFF) << LCDC_OVR1CLUT_BCLUT_Pos)               /**< (LCDC_OVR1CLUT) Blue Color Entry Mask */
#define LCDC_OVR1CLUT_BCLUT(value)            (LCDC_OVR1CLUT_BCLUT_Msk & ((value) << LCDC_OVR1CLUT_BCLUT_Pos))
#define LCDC_OVR1CLUT_GCLUT_Pos               _U_(8)                                               /**< (LCDC_OVR1CLUT) Green Color Entry Position */
#define LCDC_OVR1CLUT_GCLUT_Msk               (_U_(0xFF) << LCDC_OVR1CLUT_GCLUT_Pos)               /**< (LCDC_OVR1CLUT) Green Color Entry Mask */
#define LCDC_OVR1CLUT_GCLUT(value)            (LCDC_OVR1CLUT_GCLUT_Msk & ((value) << LCDC_OVR1CLUT_GCLUT_Pos))
#define LCDC_OVR1CLUT_RCLUT_Pos               _U_(16)                                              /**< (LCDC_OVR1CLUT) Red Color Entry Position */
#define LCDC_OVR1CLUT_RCLUT_Msk               (_U_(0xFF) << LCDC_OVR1CLUT_RCLUT_Pos)               /**< (LCDC_OVR1CLUT) Red Color Entry Mask */
#define LCDC_OVR1CLUT_RCLUT(value)            (LCDC_OVR1CLUT_RCLUT_Msk & ((value) << LCDC_OVR1CLUT_RCLUT_Pos))
#define LCDC_OVR1CLUT_ACLUT_Pos               _U_(24)                                              /**< (LCDC_OVR1CLUT) Alpha Color Entry Position */
#define LCDC_OVR1CLUT_ACLUT_Msk               (_U_(0xFF) << LCDC_OVR1CLUT_ACLUT_Pos)               /**< (LCDC_OVR1CLUT) Alpha Color Entry Mask */
#define LCDC_OVR1CLUT_ACLUT(value)            (LCDC_OVR1CLUT_ACLUT_Msk & ((value) << LCDC_OVR1CLUT_ACLUT_Pos))
#define LCDC_OVR1CLUT_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_OVR1CLUT) Register Mask  */


/* -------- LCDC_OVR2CLUT : (LCDC Offset: 0xE00) (R/W 32) Overlay 2 CLUT Register -------- */
#define LCDC_OVR2CLUT_BCLUT_Pos               _U_(0)                                               /**< (LCDC_OVR2CLUT) Blue Color Entry Position */
#define LCDC_OVR2CLUT_BCLUT_Msk               (_U_(0xFF) << LCDC_OVR2CLUT_BCLUT_Pos)               /**< (LCDC_OVR2CLUT) Blue Color Entry Mask */
#define LCDC_OVR2CLUT_BCLUT(value)            (LCDC_OVR2CLUT_BCLUT_Msk & ((value) << LCDC_OVR2CLUT_BCLUT_Pos))
#define LCDC_OVR2CLUT_GCLUT_Pos               _U_(8)                                               /**< (LCDC_OVR2CLUT) Green Color Entry Position */
#define LCDC_OVR2CLUT_GCLUT_Msk               (_U_(0xFF) << LCDC_OVR2CLUT_GCLUT_Pos)               /**< (LCDC_OVR2CLUT) Green Color Entry Mask */
#define LCDC_OVR2CLUT_GCLUT(value)            (LCDC_OVR2CLUT_GCLUT_Msk & ((value) << LCDC_OVR2CLUT_GCLUT_Pos))
#define LCDC_OVR2CLUT_RCLUT_Pos               _U_(16)                                              /**< (LCDC_OVR2CLUT) Red Color Entry Position */
#define LCDC_OVR2CLUT_RCLUT_Msk               (_U_(0xFF) << LCDC_OVR2CLUT_RCLUT_Pos)               /**< (LCDC_OVR2CLUT) Red Color Entry Mask */
#define LCDC_OVR2CLUT_RCLUT(value)            (LCDC_OVR2CLUT_RCLUT_Msk & ((value) << LCDC_OVR2CLUT_RCLUT_Pos))
#define LCDC_OVR2CLUT_ACLUT_Pos               _U_(24)                                              /**< (LCDC_OVR2CLUT) Alpha Color Entry Position */
#define LCDC_OVR2CLUT_ACLUT_Msk               (_U_(0xFF) << LCDC_OVR2CLUT_ACLUT_Pos)               /**< (LCDC_OVR2CLUT) Alpha Color Entry Mask */
#define LCDC_OVR2CLUT_ACLUT(value)            (LCDC_OVR2CLUT_ACLUT_Msk & ((value) << LCDC_OVR2CLUT_ACLUT_Pos))
#define LCDC_OVR2CLUT_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_OVR2CLUT) Register Mask  */


/* -------- LCDC_HEOCLUT : (LCDC Offset: 0x1200) (R/W 32) High-End Overlay CLUT Register -------- */
#define LCDC_HEOCLUT_BCLUT_Pos                _U_(0)                                               /**< (LCDC_HEOCLUT) Blue Color Entry Position */
#define LCDC_HEOCLUT_BCLUT_Msk                (_U_(0xFF) << LCDC_HEOCLUT_BCLUT_Pos)                /**< (LCDC_HEOCLUT) Blue Color Entry Mask */
#define LCDC_HEOCLUT_BCLUT(value)             (LCDC_HEOCLUT_BCLUT_Msk & ((value) << LCDC_HEOCLUT_BCLUT_Pos))
#define LCDC_HEOCLUT_GCLUT_Pos                _U_(8)                                               /**< (LCDC_HEOCLUT) Green Color Entry Position */
#define LCDC_HEOCLUT_GCLUT_Msk                (_U_(0xFF) << LCDC_HEOCLUT_GCLUT_Pos)                /**< (LCDC_HEOCLUT) Green Color Entry Mask */
#define LCDC_HEOCLUT_GCLUT(value)             (LCDC_HEOCLUT_GCLUT_Msk & ((value) << LCDC_HEOCLUT_GCLUT_Pos))
#define LCDC_HEOCLUT_RCLUT_Pos                _U_(16)                                              /**< (LCDC_HEOCLUT) Red Color Entry Position */
#define LCDC_HEOCLUT_RCLUT_Msk                (_U_(0xFF) << LCDC_HEOCLUT_RCLUT_Pos)                /**< (LCDC_HEOCLUT) Red Color Entry Mask */
#define LCDC_HEOCLUT_RCLUT(value)             (LCDC_HEOCLUT_RCLUT_Msk & ((value) << LCDC_HEOCLUT_RCLUT_Pos))
#define LCDC_HEOCLUT_ACLUT_Pos                _U_(24)                                              /**< (LCDC_HEOCLUT) Alpha Color Entry Position */
#define LCDC_HEOCLUT_ACLUT_Msk                (_U_(0xFF) << LCDC_HEOCLUT_ACLUT_Pos)                /**< (LCDC_HEOCLUT) Alpha Color Entry Mask */
#define LCDC_HEOCLUT_ACLUT(value)             (LCDC_HEOCLUT_ACLUT_Msk & ((value) << LCDC_HEOCLUT_ACLUT_Pos))
#define LCDC_HEOCLUT_Msk                      _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOCLUT) Register Mask  */


