virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
/** \brief LCDC register offsets definitions */
#define LCDC_LCDCFG0_REG_OFST          (0x00)              /**< (LCDC_LCDCFG0) LCD Controller Configuration Register 0 Offset */
#define LCDC_LCDCFG1_REG_OFST          (0x04)              /**< (LCDC_LCDCFG1) LCD Controller Configuration Register 1 Offset */
#define LCDC_LCDCFG2_REG_OFST          (0x08)              /**< (LCDC_LCDCFG2) LCD Controller Configuration Register 2 Offset */
#define LCDC_LCDCFG3_REG_OFST          (0x0C)              /**< (LCDC_LCDCFG3) LCD Controller Configuration Register 3 Offset */
#define LCDC_LCDCFG4_REG_OFST          (0x10)              /**< (LCDC_LCDCFG4) LCD Controller Configuration Register 4 Offset */
#define LCDC_LCDCFG5_REG_OFST          (0x14)              /**< (LCDC_LCDCFG5) LCD Controller Configuration Register 5 Offset */
#define LCDC_LCDCFG6_REG_OFST          (0x18)              /**< (LCDC_LCDCFG6) LCD Controller Configuration Register 6 Offset */
#define LCDC_LCDEN_REG_OFST            (0x20)              /**< (LCDC_LCDEN) LCD Controller Enable Register Offset */
#define LCDC_LCDDIS_REG_OFST           (0x24)              /**< (LCDC_LCDDIS) LCD Controller Disable Register Offset */
#define LCDC_LCDSR_REG_OFST            (0x28)              /**< (LCDC_LCDSR) LCD Controller Status Register Offset */
#define LCDC_LCDIER_REG_OFST           (0x2C)              /**< (LCDC_LCDIER) LCD Controller Interrupt Enable Register Offset */
#define LCDC_LCDIDR_REG_OFST           (0x30)              /**< (LCDC_LCDIDR) LCD Controller Interrupt Disable Register Offset */
#define LCDC_LCDIMR_REG_OFST           (0x34)              /**< (LCDC_LCDIMR) LCD Controller Interrupt Mask Register Offset */
#define LCDC_LCDISR_REG_OFST           (0x38)              /**< (LCDC_LCDISR) LCD Controller Interrupt Status Register Offset */
#define LCDC_ATTR_REG_OFST             (0x3C)              /**< (LCDC_ATTR) LCD Controller Attribute Register Offset */
#define LCDC_BASECHER_REG_OFST         (0x40)              /**< (LCDC_BASECHER) Base Layer Channel Enable Register Offset */
#define LCDC_BASECHDR_REG_OFST         (0x44)              /**< (LCDC_BASECHDR) Base Layer Channel Disable Register Offset */
#define LCDC_BASECHSR_REG_OFST         (0x48)              /**< (LCDC_BASECHSR) Base Layer Channel Status Register Offset */
#define LCDC_BASEIER_REG_OFST          (0x4C)              /**< (LCDC_BASEIER) Base Layer Interrupt Enable Register Offset */
#define LCDC_BASEIDR_REG_OFST          (0x50)              /**< (LCDC_BASEIDR) Base Layer Interrupt Disabled Register Offset */
#define LCDC_BASEIMR_REG_OFST          (0x54)              /**< (LCDC_BASEIMR) Base Layer Interrupt Mask Register Offset */
#define LCDC_BASEISR_REG_OFST          (0x58)              /**< (LCDC_BASEISR) Base Layer Interrupt Status Register Offset */
#define LCDC_BASEHEAD_REG_OFST         (0x5C)              /**< (LCDC_BASEHEAD) Base DMA Head Register Offset */
#define LCDC_BASEADDR_REG_OFST         (0x60)              /**< (LCDC_BASEADDR) Base DMA Address Register Offset */
#define LCDC_BASECTRL_REG_OFST         (0x64)              /**< (LCDC_BASECTRL) Base DMA Control Register Offset */
#define LCDC_BASENEXT_REG_OFST         (0x68)              /**< (LCDC_BASENEXT) Base DMA Next Register Offset */
#define LCDC_BASECFG0_REG_OFST         (0x6C)              /**< (LCDC_BASECFG0) Base Layer Configuration Register 0 Offset */
#define LCDC_BASECFG1_REG_OFST         (0x70)              /**< (LCDC_BASECFG1) Base Layer Configuration Register 1 Offset */
#define LCDC_BASECFG2_REG_OFST         (0x74)              /**< (LCDC_BASECFG2) Base Layer Configuration Register 2 Offset */
#define LCDC_BASECFG3_REG_OFST         (0x78)              /**< (LCDC_BASECFG3) Base Layer Configuration Register 3 Offset */
#define LCDC_BASECFG4_REG_OFST         (0x7C)              /**< (LCDC_BASECFG4) Base Layer Configuration Register 4 Offset */
#define LCDC_BASECFG5_REG_OFST         (0x80)              /**< (LCDC_BASECFG5) Base Layer Configuration Register 5 Offset */
#define LCDC_BASECFG6_REG_OFST         (0x84)              /**< (LCDC_BASECFG6) Base Layer Configuration Register 6 Offset */
#define LCDC_OVR1CHER_REG_OFST         (0x140)             /**< (LCDC_OVR1CHER) Overlay 1 Channel Enable Register Offset */
#define LCDC_OVR1CHDR_REG_OFST         (0x144)             /**< (LCDC_OVR1CHDR) Overlay 1 Channel Disable Register Offset */
#define LCDC_OVR1CHSR_REG_OFST         (0x148)             /**< (LCDC_OVR1CHSR) Overlay 1 Channel Status Register Offset */
#define LCDC_OVR1IER_REG_OFST          (0x14C)             /**< (LCDC_OVR1IER) Overlay 1 Interrupt Enable Register Offset */
#define LCDC_OVR1IDR_REG_OFST          (0x150)             /**< (LCDC_OVR1IDR) Overlay 1 Interrupt Disable Register Offset */
#define LCDC_OVR1IMR_REG_OFST          (0x154)             /**< (LCDC_OVR1IMR) Overlay 1 Interrupt Mask Register Offset */
#define LCDC_OVR1ISR_REG_OFST          (0x158)             /**< (LCDC_OVR1ISR) Overlay 1 Interrupt Status Register Offset */
#define LCDC_OVR1HEAD_REG_OFST         (0x15C)             /**< (LCDC_OVR1HEAD) Overlay 1 DMA Head Register Offset */
#define LCDC_OVR1ADDR_REG_OFST         (0x160)             /**< (LCDC_OVR1ADDR) Overlay 1 DMA Address Register Offset */
#define LCDC_OVR1CTRL_REG_OFST         (0x164)             /**< (LCDC_OVR1CTRL) Overlay 1 DMA Control Register Offset */
#define LCDC_OVR1NEXT_REG_OFST         (0x168)             /**< (LCDC_OVR1NEXT) Overlay 1 DMA Next Register Offset */
#define LCDC_OVR1CFG0_REG_OFST         (0x16C)             /**< (LCDC_OVR1CFG0) Overlay 1 Configuration Register 0 Offset */
#define LCDC_OVR1CFG1_REG_OFST         (0x170)             /**< (LCDC_OVR1CFG1) Overlay 1 Configuration Register 1 Offset */
#define LCDC_OVR1CFG2_REG_OFST         (0x174)             /**< (LCDC_OVR1CFG2) Overlay 1 Configuration Register 2 Offset */
#define LCDC_OVR1CFG3_REG_OFST         (0x178)             /**< (LCDC_OVR1CFG3) Overlay 1 Configuration Register 3 Offset */
#define LCDC_OVR1CFG4_REG_OFST         (0x17C)             /**< (LCDC_OVR1CFG4) Overlay 1 Configuration Register 4 Offset */
#define LCDC_OVR1CFG5_REG_OFST         (0x180)             /**< (LCDC_OVR1CFG5) Overlay 1 Configuration Register 5 Offset */
#define LCDC_OVR1CFG6_REG_OFST         (0x184)             /**< (LCDC_OVR1CFG6) Overlay 1 Configuration Register 6 Offset */
#define LCDC_OVR1CFG7_REG_OFST         (0x188)             /**< (LCDC_OVR1CFG7) Overlay 1 Configuration Register 7 Offset */
#define LCDC_OVR1CFG8_REG_OFST         (0x18C)             /**< (LCDC_OVR1CFG8) Overlay 1 Configuration Register 8 Offset */
#define LCDC_OVR1CFG9_REG_OFST         (0x190)             /**< (LCDC_OVR1CFG9) Overlay 1 Configuration Register 9 Offset */
#define LCDC_OVR2CHER_REG_OFST         (0x240)             /**< (LCDC_OVR2CHER) Overlay 2 Channel Enable Register Offset */
#define LCDC_OVR2CHDR_REG_OFST         (0x244)             /**< (LCDC_OVR2CHDR) Overlay 2 Channel Disable Register Offset */
#define LCDC_OVR2CHSR_REG_OFST         (0x248)             /**< (LCDC_OVR2CHSR) Overlay 2 Channel Status Register Offset */
#define LCDC_OVR2IER_REG_OFST          (0x24C)             /**< (LCDC_OVR2IER) Overlay 2 Interrupt Enable Register Offset */
#define LCDC_OVR2IDR_REG_OFST          (0x250)             /**< (LCDC_OVR2IDR) Overlay 2 Interrupt Disable Register Offset */
#define LCDC_OVR2IMR_REG_OFST          (0x254)             /**< (LCDC_OVR2IMR) Overlay 2 Interrupt Mask Register Offset */
#define LCDC_OVR2ISR_REG_OFST          (0x258)             /**< (LCDC_OVR2ISR) Overlay 2 Interrupt Status Register Offset */
#define LCDC_OVR2HEAD_REG_OFST         (0x25C)             /**< (LCDC_OVR2HEAD) Overlay 2 DMA Head Register Offset */
#define LCDC_OVR2ADDR_REG_OFST         (0x260)             /**< (LCDC_OVR2ADDR) Overlay 2 DMA Address Register Offset */
#define LCDC_OVR2CTRL_REG_OFST         (0x264)             /**< (LCDC_OVR2CTRL) Overlay 2 DMA Control Register Offset */
#define LCDC_OVR2NEXT_REG_OFST         (0x268)             /**< (LCDC_OVR2NEXT) Overlay 2 DMA Next Register Offset */
#define LCDC_OVR2CFG0_REG_OFST         (0x26C)             /**< (LCDC_OVR2CFG0) Overlay 2 Configuration Register 0 Offset */
#define LCDC_OVR2CFG1_REG_OFST         (0x270)             /**< (LCDC_OVR2CFG1) Overlay 2 Configuration Register 1 Offset */
#define LCDC_OVR2CFG2_REG_OFST         (0x274)             /**< (LCDC_OVR2CFG2) Overlay 2 Configuration Register 2 Offset */
#define LCDC_OVR2CFG3_REG_OFST         (0x278)             /**< (LCDC_OVR2CFG3) Overlay 2 Configuration Register 3 Offset */
#define LCDC_OVR2CFG4_REG_OFST         (0x27C)             /**< (LCDC_OVR2CFG4) Overlay 2 Configuration Register 4 Offset */
#define LCDC_OVR2CFG5_REG_OFST         (0x280)             /**< (LCDC_OVR2CFG5) Overlay 2 Configuration Register 5 Offset */
#define LCDC_OVR2CFG6_REG_OFST         (0x284)             /**< (LCDC_OVR2CFG6) Overlay 2 Configuration Register 6 Offset */
#define LCDC_OVR2CFG7_REG_OFST         (0x288)             /**< (LCDC_OVR2CFG7) Overlay 2 Configuration Register 7 Offset */
#define LCDC_OVR2CFG8_REG_OFST         (0x28C)             /**< (LCDC_OVR2CFG8) Overlay 2 Configuration Register 8 Offset */
#define LCDC_OVR2CFG9_REG_OFST         (0x290)             /**< (LCDC_OVR2CFG9) Overlay 2 Configuration Register 9 Offset */
#define LCDC_HEOCHER_REG_OFST          (0x340)             /**< (LCDC_HEOCHER) High-End Overlay Channel Enable Register Offset */
#define LCDC_HEOCHDR_REG_OFST          (0x344)             /**< (LCDC_HEOCHDR) High-End Overlay Channel Disable Register Offset */
#define LCDC_HEOCHSR_REG_OFST          (0x348)             /**< (LCDC_HEOCHSR) High-End Overlay Channel Status Register Offset */
#define LCDC_HEOIER_REG_OFST           (0x34C)             /**< (LCDC_HEOIER) High-End Overlay Interrupt Enable Register Offset */
#define LCDC_HEOIDR_REG_OFST           (0x350)             /**< (LCDC_HEOIDR) High-End Overlay Interrupt Disable Register Offset */
#define LCDC_HEOIMR_REG_OFST           (0x354)             /**< (LCDC_HEOIMR) High-End Overlay Interrupt Mask Register Offset */
#define LCDC_HEOISR_REG_OFST           (0x358)             /**< (LCDC_HEOISR) High-End Overlay Interrupt Status Register Offset */
#define LCDC_HEOHEAD_REG_OFST          (0x35C)             /**< (LCDC_HEOHEAD) High-End Overlay DMA Head Register Offset */
#define LCDC_HEOADDR_REG_OFST          (0x360)             /**< (LCDC_HEOADDR) High-End Overlay DMA Address Register Offset */
#define LCDC_HEOCTRL_REG_OFST          (0x364)             /**< (LCDC_HEOCTRL) High-End Overlay DMA Control Register Offset */
#define LCDC_HEONEXT_REG_OFST          (0x368)             /**< (LCDC_HEONEXT) High-End Overlay DMA Next Register Offset */
#define LCDC_HEOUHEAD_REG_OFST         (0x36C)             /**< (LCDC_HEOUHEAD) High-End Overlay U-UV DMA Head Register Offset */
#define LCDC_HEOUADDR_REG_OFST         (0x370)             /**< (LCDC_HEOUADDR) High-End Overlay U-UV DMA Address Register Offset */
#define LCDC_HEOUCTRL_REG_OFST         (0x374)             /**< (LCDC_HEOUCTRL) High-End Overlay U-UV DMA Control Register Offset */
#define LCDC_HEOUNEXT_REG_OFST         (0x378)             /**< (LCDC_HEOUNEXT) High-End Overlay U-UV DMA Next Register Offset */
#define LCDC_HEOVHEAD_REG_OFST         (0x37C)             /**< (LCDC_HEOVHEAD) High-End Overlay V DMA Head Register Offset */
#define LCDC_HEOVADDR_REG_OFST         (0x380)             /**< (LCDC_HEOVADDR) High-End Overlay V DMA Address Register Offset */
#define LCDC_HEOVCTRL_REG_OFST         (0x384)             /**< (LCDC_HEOVCTRL) High-End Overlay V DMA Control Register Offset */
#define LCDC_HEOVNEXT_REG_OFST         (0x388)             /**< (LCDC_HEOVNEXT) High-End Overlay V DMA Next Register Offset */
#define LCDC_HEOCFG0_REG_OFST          (0x38C)             /**< (LCDC_HEOCFG0) High-End Overlay Configuration Register 0 Offset */
#define LCDC_HEOCFG1_REG_OFST          (0x390)             /**< (LCDC_HEOCFG1) High-End Overlay Configuration Register 1 Offset */
#define LCDC_HEOCFG2_REG_OFST          (0x394)             /**< (LCDC_HEOCFG2) High-End Overlay Configuration Register 2 Offset */
#define LCDC_HEOCFG3_REG_OFST          (0x398)             /**< (LCDC_HEOCFG3) High-End Overlay Configuration Register 3 Offset */
#define LCDC_HEOCFG4_REG_OFST          (0x39C)             /**< (LCDC_HEOCFG4) High-End Overlay Configuration Register 4 Offset */
#define LCDC_HEOCFG5_REG_OFST          (0x3A0)             /**< (LCDC_HEOCFG5) High-End Overlay Configuration Register 5 Offset */
#define LCDC_HEOCFG6_REG_OFST          (0x3A4)             /**< (LCDC_HEOCFG6) High-End Overlay Configuration Register 6 Offset */
#define LCDC_HEOCFG7_REG_OFST          (0x3A8)             /**< (LCDC_HEOCFG7) High-End Overlay Configuration Register 7 Offset */
#define LCDC_HEOCFG8_REG_OFST          (0x3AC)             /**< (LCDC_HEOCFG8) High-End Overlay Configuration Register 8 Offset */
#define LCDC_HEOCFG9_REG_OFST          (0x3B0)             /**< (LCDC_HEOCFG9) High-End Overlay Configuration Register 9 Offset */
#define LCDC_HEOCFG10_REG_OFST         (0x3B4)             /**< (LCDC_HEOCFG10) High-End Overlay Configuration Register 10 Offset */
#define LCDC_HEOCFG11_REG_OFST         (0x3B8)             /**< (LCDC_HEOCFG11) High-End Overlay Configuration Register 11 Offset */
#define LCDC_HEOCFG12_REG_OFST         (0x3BC)             /**< (LCDC_HEOCFG12) High-End Overlay Configuration Register 12 Offset */
#define LCDC_HEOCFG13_REG_OFST         (0x3C0)             /**< (LCDC_HEOCFG13) High-End Overlay Configuration Register 13 Offset */
#define LCDC_HEOCFG14_REG_OFST         (0x3C4)             /**< (LCDC_HEOCFG14) High-End Overlay Configuration Register 14 Offset */
#define LCDC_HEOCFG15_REG_OFST         (0x3C8)             /**< (LCDC_HEOCFG15) High-End Overlay Configuration Register 15 Offset */
#define LCDC_HEOCFG16_REG_OFST         (0x3CC)             /**< (LCDC_HEOCFG16) High-End Overlay Configuration Register 16 Offset */
#define LCDC_HEOCFG17_REG_OFST         (0x3D0)             /**< (LCDC_HEOCFG17) High-End Overlay Configuration Register 17 Offset */
#define LCDC_HEOCFG18_REG_OFST         (0x3D4)             /**< (LCDC_HEOCFG18) High-End Overlay Configuration Register 18 Offset */
#define LCDC_HEOCFG19_REG_OFST         (0x3D8)             /**< (LCDC_HEOCFG19) High-End Overlay Configuration Register 19 Offset */
#define LCDC_HEOCFG20_REG_OFST         (0x3DC)             /**< (LCDC_HEOCFG20) High-End Overlay Configuration Register 20 Offset */
#define LCDC_HEOCFG21_REG_OFST         (0x3E0)             /**< (LCDC_HEOCFG21) High-End Overlay Configuration Register 21 Offset */
#define LCDC_HEOCFG22_REG_OFST         (0x3E4)             /**< (LCDC_HEOCFG22) High-End Overlay Configuration Register 22 Offset */
#define LCDC_HEOCFG23_REG_OFST         (0x3E8)             /**< (LCDC_HEOCFG23) High-End Overlay Configuration Register 23 Offset */
#define LCDC_HEOCFG24_REG_OFST         (0x3EC)             /**< (LCDC_HEOCFG24) High-End Overlay Configuration Register 24 Offset */
#define LCDC_HEOCFG25_REG_OFST         (0x3F0)             /**< (LCDC_HEOCFG25) High-End Overlay Configuration Register 25 Offset */
#define LCDC_HEOCFG26_REG_OFST         (0x3F4)             /**< (LCDC_HEOCFG26) High-End Overlay Configuration Register 26 Offset */
#define LCDC_HEOCFG27_REG_OFST         (0x3F8)             /**< (LCDC_HEOCFG27) High-End Overlay Configuration Register 27 Offset */
#define LCDC_HEOCFG28_REG_OFST         (0x3FC)             /**< (LCDC_HEOCFG28) High-End Overlay Configuration Register 28 Offset */
#define LCDC_HEOCFG29_REG_OFST         (0x400)             /**< (LCDC_HEOCFG29) High-End Overlay Configuration Register 29 Offset */
#define LCDC_HEOCFG30_REG_OFST         (0x404)             /**< (LCDC_HEOCFG30) High-End Overlay Configuration Register 30 Offset */
#define LCDC_HEOCFG31_REG_OFST         (0x408)             /**< (LCDC_HEOCFG31) High-End Overlay Configuration Register 31 Offset */
#define LCDC_HEOCFG32_REG_OFST         (0x40C)             /**< (LCDC_HEOCFG32) High-End Overlay Configuration Register 32 Offset */
#define LCDC_HEOCFG33_REG_OFST         (0x410)             /**< (LCDC_HEOCFG33) High-End Overlay Configuration Register 33 Offset */
#define LCDC_HEOCFG34_REG_OFST         (0x414)             /**< (LCDC_HEOCFG34) High-End Overlay Configuration Register 34 Offset */
#define LCDC_HEOCFG35_REG_OFST         (0x418)             /**< (LCDC_HEOCFG35) High-End Overlay Configuration Register 35 Offset */
#define LCDC_HEOCFG36_REG_OFST         (0x41C)             /**< (LCDC_HEOCFG36) High-End Overlay Configuration Register 36 Offset */
#define LCDC_HEOCFG37_REG_OFST         (0x420)             /**< (LCDC_HEOCFG37) High-End Overlay Configuration Register 37 Offset */
#define LCDC_HEOCFG38_REG_OFST         (0x424)             /**< (LCDC_HEOCFG38) High-End Overlay Configuration Register 38 Offset */
#define LCDC_HEOCFG39_REG_OFST         (0x428)             /**< (LCDC_HEOCFG39) High-End Overlay Configuration Register 39 Offset */
#define LCDC_HEOCFG40_REG_OFST         (0x42C)             /**< (LCDC_HEOCFG40) High-End Overlay Configuration Register 40 Offset */
#define LCDC_HEOCFG41_REG_OFST         (0x430)             /**< (LCDC_HEOCFG41) High-End Overlay Configuration Register 41 Offset */
#define LCDC_PPCHER_REG_OFST           (0x540)             /**< (LCDC_PPCHER) Post Processing Channel Enable Register Offset */
#define LCDC_PPCHDR_REG_OFST           (0x544)             /**< (LCDC_PPCHDR) Post Processing Channel Disable Register Offset */
#define LCDC_PPCHSR_REG_OFST           (0x548)             /**< (LCDC_PPCHSR) Post Processing Channel Status Register Offset */
#define LCDC_PPIER_REG_OFST            (0x54C)             /**< (LCDC_PPIER) Post Processing Interrupt Enable Register Offset */
#define LCDC_PPIDR_REG_OFST            (0x550)             /**< (LCDC_PPIDR) Post Processing Interrupt Disable Register Offset */
#define LCDC_PPIMR_REG_OFST            (0x554)             /**< (LCDC_PPIMR) Post Processing Interrupt Mask Register Offset */
#define LCDC_PPISR_REG_OFST            (0x558)             /**< (LCDC_PPISR) Post Processing Interrupt Status Register Offset */
#define LCDC_PPHEAD_REG_OFST           (0x55C)             /**< (LCDC_PPHEAD) Post Processing Head Register Offset */
#define LCDC_PPADDR_REG_OFST           (0x560)             /**< (LCDC_PPADDR) Post Processing Address Register Offset */
#define LCDC_PPCTRL_REG_OFST           (0x564)             /**< (LCDC_PPCTRL) Post Processing Control Register Offset */
#define LCDC_PPNEXT_REG_OFST           (0x568)             /**< (LCDC_PPNEXT) Post Processing Next Register Offset */
#define LCDC_PPCFG0_REG_OFST           (0x56C)             /**< (LCDC_PPCFG0) Post Processing Configuration Register 0 Offset */
#define LCDC_PPCFG1_REG_OFST           (0x570)             /**< (LCDC_PPCFG1) Post Processing Configuration Register 1 Offset */
#define LCDC_PPCFG2_REG_OFST           (0x574)             /**< (LCDC_PPCFG2) Post Processing Configuration Register 2 Offset */
#define LCDC_PPCFG3_REG_OFST           (0x578)             /**< (LCDC_PPCFG3) Post Processing Configuration Register 3 Offset */
#define LCDC_PPCFG4_REG_OFST           (0x57C)             /**< (LCDC_PPCFG4) Post Processing Configuration Register 4 Offset */
#define LCDC_PPCFG5_REG_OFST           (0x580)             /**< (LCDC_PPCFG5) Post Processing Configuration Register 5 Offset */
#define LCDC_BASECLUT_REG_OFST         (0x600)             /**< (LCDC_BASECLUT) Base CLUT Register Offset */
#define LCDC_BASECLUT0_REG_OFST        (0x600)             /**< (LCDC_BASECLUT0) Base CLUT Register Offset */
#define LCDC_BASECLUT1_REG_OFST        (0x604)             /**< (LCDC_BASECLUT1) Base CLUT Register Offset */
#define LCDC_BASECLUT2_REG_OFST        (0x608)             /**< (LCDC_BASECLUT2) Base CLUT Register Offset */
#define LCDC_BASECLUT3_REG_OFST        (0x60C)             /**< (LCDC_BASECLUT3) Base CLUT Register Offset */
#define LCDC_BASECLUT4_REG_OFST        (0x610)             /**< (LCDC_BASECLUT4) Base CLUT Register Offset */
#define LCDC_BASECLUT5_REG_OFST        (0x614)             /**< (LCDC_BASECLUT5) Base CLUT Register Offset */
#define LCDC_BASECLUT6_REG_OFST        (0x618)             /**< (LCDC_BASECLUT6) Base CLUT Register Offset */
#define LCDC_BASECLUT7_REG_OFST        (0x61C)             /**< (LCDC_BASECLUT7) Base CLUT Register Offset */
#define LCDC_BASECLUT8_REG_OFST        (0x620)             /**< (LCDC_BASECLUT8) Base CLUT Register Offset */
#define LCDC_BASECLUT9_REG_OFST        (0x624)             /**< (LCDC_BASECLUT9) Base CLUT Register Offset */
#define LCDC_BASECLUT10_REG_OFST       (0x628)             /**< (LCDC_BASECLUT10) Base CLUT Register Offset */
#define LCDC_BASECLUT11_REG_OFST       (0x62C)             /**< (LCDC_BASECLUT11) Base CLUT Register Offset */
#define LCDC_BASECLUT12_REG_OFST       (0x630)             /**< (LCDC_BASECLUT12) Base CLUT Register Offset */
#define LCDC_BASECLUT13_REG_OFST       (0x634)             /**< (LCDC_BASECLUT13) Base CLUT Register Offset */
#define LCDC_BASECLUT14_REG_OFST       (0x638)             /**< (LCDC_BASECLUT14) Base CLUT Register Offset */
#define LCDC_BASECLUT15_REG_OFST       (0x63C)             /**< (LCDC_BASECLUT15) Base CLUT Register Offset */
#define LCDC_BASECLUT16_REG_OFST       (0x640)             /**< (LCDC_BASECLUT16) Base CLUT Register Offset */
#define LCDC_BASECLUT17_REG_OFST       (0x644)             /**< (LCDC_BASECLUT17) Base CLUT Register Offset */
#define LCDC_BASECLUT18_REG_OFST       (0x648)             /**< (LCDC_BASECLUT18) Base CLUT Register Offset */
#define LCDC_BASECLUT19_REG_OFST       (0x64C)             /**< (LCDC_BASECLUT19) Base CLUT Register Offset */
#define LCDC_BASECLUT20_REG_OFST       (0x650)             /**< (LCDC_BASECLUT20) Base CLUT Register Offset */
#define LCDC_BASECLUT21_REG_OFST       (0x654)             /**< (LCDC_BASECLUT21) Base CLUT Register Offset */
#define LCDC_BASECLUT22_REG_OFST       (0x658)             /**< (LCDC_BASECLUT22) Base CLUT Register Offset */
#define LCDC_BASECLUT23_REG_OFST       (0x65C)             /**< (LCDC_BASECLUT23) Base CLUT Register Offset */
#define LCDC_BASECLUT24_REG_OFST       (0x660)             /**< (LCDC_BASECLUT24) Base CLUT Register Offset */
#define LCDC_BASECLUT25_REG_OFST       (0x664)             /**< (LCDC_BASECLUT25) Base CLUT Register Offset */
#define LCDC_BASECLUT26_REG_OFST       (0x668)             /**< (LCDC_BASECLUT26) Base CLUT Register Offset */
#define LCDC_BASECLUT27_REG_OFST       (0x66C)             /**< (LCDC_BASECLUT27) Base CLUT Register Offset */
#define LCDC_BASECLUT28_REG_OFST       (0x670)             /**< (LCDC_BASECLUT28) Base CLUT Register Offset */
#define LCDC_BASECLUT29_REG_OFST       (0x674)             /**< (LCDC_BASECLUT29) Base CLUT Register Offset */
#define LCDC_BASECLUT30_REG_OFST       (0x678)             /**< (LCDC_BASECLUT30) Base CLUT Register Offset */
#define LCDC_BASECLUT31_REG_OFST       (0x67C)             /**< (LCDC_BASECLUT31) Base CLUT Register Offset */
#define LCDC_BASECLUT32_REG_OFST       (0x680)             /**< (LCDC_BASECLUT32) Base CLUT Register Offset */
#define LCDC_BASECLUT33_REG_OFST       (0x684)             /**< (LCDC_BASECLUT33) Base CLUT Register Offset */
#define LCDC_BASECLUT34_REG_OFST       (0x688)             /**< (LCDC_BASECLUT34) Base CLUT Register Offset */
#define LCDC_BASECLUT35_REG_OFST       (0x68C)             /**< (LCDC_BASECLUT35) Base CLUT Register Offset */
#define LCDC_BASECLUT36_REG_OFST       (0x690)             /**< (LCDC_BASECLUT36) Base CLUT Register Offset */
#define LCDC_BASECLUT37_REG_OFST       (0x694)             /**< (LCDC_BASECLUT37) Base CLUT Register Offset */
#define LCDC_BASECLUT38_REG_OFST       (0x698)             /**< (LCDC_BASECLUT38) Base CLUT Register Offset */
