virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
#define LCDC_BASECLUT39_REG_OFST       (0x69C)             /**< (LCDC_BASECLUT39) Base CLUT Register Offset */
#define LCDC_BASECLUT40_REG_OFST       (0x6A0)             /**< (LCDC_BASECLUT40) Base CLUT Register Offset */
#define LCDC_BASECLUT41_REG_OFST       (0x6A4)             /**< (LCDC_BASECLUT41) Base CLUT Register Offset */
#define LCDC_BASECLUT42_REG_OFST       (0x6A8)             /**< (LCDC_BASECLUT42) Base CLUT Register Offset */
#define LCDC_BASECLUT43_REG_OFST       (0x6AC)             /**< (LCDC_BASECLUT43) Base CLUT Register Offset */
#define LCDC_BASECLUT44_REG_OFST       (0x6B0)             /**< (LCDC_BASECLUT44) Base CLUT Register Offset */
#define LCDC_BASECLUT45_REG_OFST       (0x6B4)             /**< (LCDC_BASECLUT45) Base CLUT Register Offset */
#define LCDC_BASECLUT46_REG_OFST       (0x6B8)             /**< (LCDC_BASECLUT46) Base CLUT Register Offset */
#define LCDC_BASECLUT47_REG_OFST       (0x6BC)             /**< (LCDC_BASECLUT47) Base CLUT Register Offset */
#define LCDC_BASECLUT48_REG_OFST       (0x6C0)             /**< (LCDC_BASECLUT48) Base CLUT Register Offset */
#define LCDC_BASECLUT49_REG_OFST       (0x6C4)             /**< (LCDC_BASECLUT49) Base CLUT Register Offset */
#define LCDC_BASECLUT50_REG_OFST       (0x6C8)             /**< (LCDC_BASECLUT50) Base CLUT Register Offset */
#define LCDC_BASECLUT51_REG_OFST       (0x6CC)             /**< (LCDC_BASECLUT51) Base CLUT Register Offset */
#define LCDC_BASECLUT52_REG_OFST       (0x6D0)             /**< (LCDC_BASECLUT52) Base CLUT Register Offset */
#define LCDC_BASECLUT53_REG_OFST       (0x6D4)             /**< (LCDC_BASECLUT53) Base CLUT Register Offset */
#define LCDC_BASECLUT54_REG_OFST       (0x6D8)             /**< (LCDC_BASECLUT54) Base CLUT Register Offset */
#define LCDC_BASECLUT55_REG_OFST       (0x6DC)             /**< (LCDC_BASECLUT55) Base CLUT Register Offset */
#define LCDC_BASECLUT56_REG_OFST       (0x6E0)             /**< (LCDC_BASECLUT56) Base CLUT Register Offset */
#define LCDC_BASECLUT57_REG_OFST       (0x6E4)             /**< (LCDC_BASECLUT57) Base CLUT Register Offset */
#define LCDC_BASECLUT58_REG_OFST       (0x6E8)             /**< (LCDC_BASECLUT58) Base CLUT Register Offset */
#define LCDC_BASECLUT59_REG_OFST       (0x6EC)             /**< (LCDC_BASECLUT59) Base CLUT Register Offset */
#define LCDC_BASECLUT60_REG_OFST       (0x6F0)             /**< (LCDC_BASECLUT60) Base CLUT Register Offset */
#define LCDC_BASECLUT61_REG_OFST       (0x6F4)             /**< (LCDC_BASECLUT61) Base CLUT Register Offset */
#define LCDC_BASECLUT62_REG_OFST       (0x6F8)             /**< (LCDC_BASECLUT62) Base CLUT Register Offset */
#define LCDC_BASECLUT63_REG_OFST       (0x6FC)             /**< (LCDC_BASECLUT63) Base CLUT Register Offset */
#define LCDC_BASECLUT64_REG_OFST       (0x700)             /**< (LCDC_BASECLUT64) Base CLUT Register Offset */
#define LCDC_BASECLUT65_REG_OFST       (0x704)             /**< (LCDC_BASECLUT65) Base CLUT Register Offset */
#define LCDC_BASECLUT66_REG_OFST       (0x708)             /**< (LCDC_BASECLUT66) Base CLUT Register Offset */
#define LCDC_BASECLUT67_REG_OFST       (0x70C)             /**< (LCDC_BASECLUT67) Base CLUT Register Offset */
#define LCDC_BASECLUT68_REG_OFST       (0x710)             /**< (LCDC_BASECLUT68) Base CLUT Register Offset */
#define LCDC_BASECLUT69_REG_OFST       (0x714)             /**< (LCDC_BASECLUT69) Base CLUT Register Offset */
#define LCDC_BASECLUT70_REG_OFST       (0x718)             /**< (LCDC_BASECLUT70) Base CLUT Register Offset */
#define LCDC_BASECLUT71_REG_OFST       (0x71C)             /**< (LCDC_BASECLUT71) Base CLUT Register Offset */
#define LCDC_BASECLUT72_REG_OFST       (0x720)             /**< (LCDC_BASECLUT72) Base CLUT Register Offset */
#define LCDC_BASECLUT73_REG_OFST       (0x724)             /**< (LCDC_BASECLUT73) Base CLUT Register Offset */
#define LCDC_BASECLUT74_REG_OFST       (0x728)             /**< (LCDC_BASECLUT74) Base CLUT Register Offset */
#define LCDC_BASECLUT75_REG_OFST       (0x72C)             /**< (LCDC_BASECLUT75) Base CLUT Register Offset */
#define LCDC_BASECLUT76_REG_OFST       (0x730)             /**< (LCDC_BASECLUT76) Base CLUT Register Offset */
#define LCDC_BASECLUT77_REG_OFST       (0x734)             /**< (LCDC_BASECLUT77) Base CLUT Register Offset */
#define LCDC_BASECLUT78_REG_OFST       (0x738)             /**< (LCDC_BASECLUT78) Base CLUT Register Offset */
#define LCDC_BASECLUT79_REG_OFST       (0x73C)             /**< (LCDC_BASECLUT79) Base CLUT Register Offset */
#define LCDC_BASECLUT80_REG_OFST       (0x740)             /**< (LCDC_BASECLUT80) Base CLUT Register Offset */
#define LCDC_BASECLUT81_REG_OFST       (0x744)             /**< (LCDC_BASECLUT81) Base CLUT Register Offset */
#define LCDC_BASECLUT82_REG_OFST       (0x748)             /**< (LCDC_BASECLUT82) Base CLUT Register Offset */
#define LCDC_BASECLUT83_REG_OFST       (0x74C)             /**< (LCDC_BASECLUT83) Base CLUT Register Offset */
#define LCDC_BASECLUT84_REG_OFST       (0x750)             /**< (LCDC_BASECLUT84) Base CLUT Register Offset */
#define LCDC_BASECLUT85_REG_OFST       (0x754)             /**< (LCDC_BASECLUT85) Base CLUT Register Offset */
#define LCDC_BASECLUT86_REG_OFST       (0x758)             /**< (LCDC_BASECLUT86) Base CLUT Register Offset */
#define LCDC_BASECLUT87_REG_OFST       (0x75C)             /**< (LCDC_BASECLUT87) Base CLUT Register Offset */
#define LCDC_BASECLUT88_REG_OFST       (0x760)             /**< (LCDC_BASECLUT88) Base CLUT Register Offset */
#define LCDC_BASECLUT89_REG_OFST       (0x764)             /**< (LCDC_BASECLUT89) Base CLUT Register Offset */
#define LCDC_BASECLUT90_REG_OFST       (0x768)             /**< (LCDC_BASECLUT90) Base CLUT Register Offset */
#define LCDC_BASECLUT91_REG_OFST       (0x76C)             /**< (LCDC_BASECLUT91) Base CLUT Register Offset */
#define LCDC_BASECLUT92_REG_OFST       (0x770)             /**< (LCDC_BASECLUT92) Base CLUT Register Offset */
#define LCDC_BASECLUT93_REG_OFST       (0x774)             /**< (LCDC_BASECLUT93) Base CLUT Register Offset */
#define LCDC_BASECLUT94_REG_OFST       (0x778)             /**< (LCDC_BASECLUT94) Base CLUT Register Offset */
#define LCDC_BASECLUT95_REG_OFST       (0x77C)             /**< (LCDC_BASECLUT95) Base CLUT Register Offset */
#define LCDC_BASECLUT96_REG_OFST       (0x780)             /**< (LCDC_BASECLUT96) Base CLUT Register Offset */
#define LCDC_BASECLUT97_REG_OFST       (0x784)             /**< (LCDC_BASECLUT97) Base CLUT Register Offset */
#define LCDC_BASECLUT98_REG_OFST       (0x788)             /**< (LCDC_BASECLUT98) Base CLUT Register Offset */
#define LCDC_BASECLUT99_REG_OFST       (0x78C)             /**< (LCDC_BASECLUT99) Base CLUT Register Offset */
#define LCDC_BASECLUT100_REG_OFST      (0x790)             /**< (LCDC_BASECLUT100) Base CLUT Register Offset */
#define LCDC_BASECLUT101_REG_OFST      (0x794)             /**< (LCDC_BASECLUT101) Base CLUT Register Offset */
#define LCDC_BASECLUT102_REG_OFST      (0x798)             /**< (LCDC_BASECLUT102) Base CLUT Register Offset */
#define LCDC_BASECLUT103_REG_OFST      (0x79C)             /**< (LCDC_BASECLUT103) Base CLUT Register Offset */
#define LCDC_BASECLUT104_REG_OFST      (0x7A0)             /**< (LCDC_BASECLUT104) Base CLUT Register Offset */
#define LCDC_BASECLUT105_REG_OFST      (0x7A4)             /**< (LCDC_BASECLUT105) Base CLUT Register Offset */
#define LCDC_BASECLUT106_REG_OFST      (0x7A8)             /**< (LCDC_BASECLUT106) Base CLUT Register Offset */
#define LCDC_BASECLUT107_REG_OFST      (0x7AC)             /**< (LCDC_BASECLUT107) Base CLUT Register Offset */
#define LCDC_BASECLUT108_REG_OFST      (0x7B0)             /**< (LCDC_BASECLUT108) Base CLUT Register Offset */
#define LCDC_BASECLUT109_REG_OFST      (0x7B4)             /**< (LCDC_BASECLUT109) Base CLUT Register Offset */
#define LCDC_BASECLUT110_REG_OFST      (0x7B8)             /**< (LCDC_BASECLUT110) Base CLUT Register Offset */
#define LCDC_BASECLUT111_REG_OFST      (0x7BC)             /**< (LCDC_BASECLUT111) Base CLUT Register Offset */
#define LCDC_BASECLUT112_REG_OFST      (0x7C0)             /**< (LCDC_BASECLUT112) Base CLUT Register Offset */
#define LCDC_BASECLUT113_REG_OFST      (0x7C4)             /**< (LCDC_BASECLUT113) Base CLUT Register Offset */
#define LCDC_BASECLUT114_REG_OFST      (0x7C8)             /**< (LCDC_BASECLUT114) Base CLUT Register Offset */
#define LCDC_BASECLUT115_REG_OFST      (0x7CC)             /**< (LCDC_BASECLUT115) Base CLUT Register Offset */
#define LCDC_BASECLUT116_REG_OFST      (0x7D0)             /**< (LCDC_BASECLUT116) Base CLUT Register Offset */
#define LCDC_BASECLUT117_REG_OFST      (0x7D4)             /**< (LCDC_BASECLUT117) Base CLUT Register Offset */
#define LCDC_BASECLUT118_REG_OFST      (0x7D8)             /**< (LCDC_BASECLUT118) Base CLUT Register Offset */
#define LCDC_BASECLUT119_REG_OFST      (0x7DC)             /**< (LCDC_BASECLUT119) Base CLUT Register Offset */
#define LCDC_BASECLUT120_REG_OFST      (0x7E0)             /**< (LCDC_BASECLUT120) Base CLUT Register Offset */
#define LCDC_BASECLUT121_REG_OFST      (0x7E4)             /**< (LCDC_BASECLUT121) Base CLUT Register Offset */
#define LCDC_BASECLUT122_REG_OFST      (0x7E8)             /**< (LCDC_BASECLUT122) Base CLUT Register Offset */
#define LCDC_BASECLUT123_REG_OFST      (0x7EC)             /**< (LCDC_BASECLUT123) Base CLUT Register Offset */
#define LCDC_BASECLUT124_REG_OFST      (0x7F0)             /**< (LCDC_BASECLUT124) Base CLUT Register Offset */
#define LCDC_BASECLUT125_REG_OFST      (0x7F4)             /**< (LCDC_BASECLUT125) Base CLUT Register Offset */
#define LCDC_BASECLUT126_REG_OFST      (0x7F8)             /**< (LCDC_BASECLUT126) Base CLUT Register Offset */
#define LCDC_BASECLUT127_REG_OFST      (0x7FC)             /**< (LCDC_BASECLUT127) Base CLUT Register Offset */
#define LCDC_BASECLUT128_REG_OFST      (0x800)             /**< (LCDC_BASECLUT128) Base CLUT Register Offset */
#define LCDC_BASECLUT129_REG_OFST      (0x804)             /**< (LCDC_BASECLUT129) Base CLUT Register Offset */
#define LCDC_BASECLUT130_REG_OFST      (0x808)             /**< (LCDC_BASECLUT130) Base CLUT Register Offset */
#define LCDC_BASECLUT131_REG_OFST      (0x80C)             /**< (LCDC_BASECLUT131) Base CLUT Register Offset */
#define LCDC_BASECLUT132_REG_OFST      (0x810)             /**< (LCDC_BASECLUT132) Base CLUT Register Offset */
#define LCDC_BASECLUT133_REG_OFST      (0x814)             /**< (LCDC_BASECLUT133) Base CLUT Register Offset */
#define LCDC_BASECLUT134_REG_OFST      (0x818)             /**< (LCDC_BASECLUT134) Base CLUT Register Offset */
#define LCDC_BASECLUT135_REG_OFST      (0x81C)             /**< (LCDC_BASECLUT135) Base CLUT Register Offset */
#define LCDC_BASECLUT136_REG_OFST      (0x820)             /**< (LCDC_BASECLUT136) Base CLUT Register Offset */
#define LCDC_BASECLUT137_REG_OFST      (0x824)             /**< (LCDC_BASECLUT137) Base CLUT Register Offset */
#define LCDC_BASECLUT138_REG_OFST      (0x828)             /**< (LCDC_BASECLUT138) Base CLUT Register Offset */
#define LCDC_BASECLUT139_REG_OFST      (0x82C)             /**< (LCDC_BASECLUT139) Base CLUT Register Offset */
#define LCDC_BASECLUT140_REG_OFST      (0x830)             /**< (LCDC_BASECLUT140) Base CLUT Register Offset */
#define LCDC_BASECLUT141_REG_OFST      (0x834)             /**< (LCDC_BASECLUT141) Base CLUT Register Offset */
#define LCDC_BASECLUT142_REG_OFST      (0x838)             /**< (LCDC_BASECLUT142) Base CLUT Register Offset */
#define LCDC_BASECLUT143_REG_OFST      (0x83C)             /**< (LCDC_BASECLUT143) Base CLUT Register Offset */
#define LCDC_BASECLUT144_REG_OFST      (0x840)             /**< (LCDC_BASECLUT144) Base CLUT Register Offset */
#define LCDC_BASECLUT145_REG_OFST      (0x844)             /**< (LCDC_BASECLUT145) Base CLUT Register Offset */
#define LCDC_BASECLUT146_REG_OFST      (0x848)             /**< (LCDC_BASECLUT146) Base CLUT Register Offset */
#define LCDC_BASECLUT147_REG_OFST      (0x84C)             /**< (LCDC_BASECLUT147) Base CLUT Register Offset */
#define LCDC_BASECLUT148_REG_OFST      (0x850)             /**< (LCDC_BASECLUT148) Base CLUT Register Offset */
#define LCDC_BASECLUT149_REG_OFST      (0x854)             /**< (LCDC_BASECLUT149) Base CLUT Register Offset */
#define LCDC_BASECLUT150_REG_OFST      (0x858)             /**< (LCDC_BASECLUT150) Base CLUT Register Offset */
#define LCDC_BASECLUT151_REG_OFST      (0x85C)             /**< (LCDC_BASECLUT151) Base CLUT Register Offset */
#define LCDC_BASECLUT152_REG_OFST      (0x860)             /**< (LCDC_BASECLUT152) Base CLUT Register Offset */
#define LCDC_BASECLUT153_REG_OFST      (0x864)             /**< (LCDC_BASECLUT153) Base CLUT Register Offset */
#define LCDC_BASECLUT154_REG_OFST      (0x868)             /**< (LCDC_BASECLUT154) Base CLUT Register Offset */
#define LCDC_BASECLUT155_REG_OFST      (0x86C)             /**< (LCDC_BASECLUT155) Base CLUT Register Offset */
#define LCDC_BASECLUT156_REG_OFST      (0x870)             /**< (LCDC_BASECLUT156) Base CLUT Register Offset */
#define LCDC_BASECLUT157_REG_OFST      (0x874)             /**< (LCDC_BASECLUT157) Base CLUT Register Offset */
#define LCDC_BASECLUT158_REG_OFST      (0x878)             /**< (LCDC_BASECLUT158) Base CLUT Register Offset */
#define LCDC_BASECLUT159_REG_OFST      (0x87C)             /**< (LCDC_BASECLUT159) Base CLUT Register Offset */
#define LCDC_BASECLUT160_REG_OFST      (0x880)             /**< (LCDC_BASECLUT160) Base CLUT Register Offset */
#define LCDC_BASECLUT161_REG_OFST      (0x884)             /**< (LCDC_BASECLUT161) Base CLUT Register Offset */
#define LCDC_BASECLUT162_REG_OFST      (0x888)             /**< (LCDC_BASECLUT162) Base CLUT Register Offset */
#define LCDC_BASECLUT163_REG_OFST      (0x88C)             /**< (LCDC_BASECLUT163) Base CLUT Register Offset */
#define LCDC_BASECLUT164_REG_OFST      (0x890)             /**< (LCDC_BASECLUT164) Base CLUT Register Offset */
#define LCDC_BASECLUT165_REG_OFST      (0x894)             /**< (LCDC_BASECLUT165) Base CLUT Register Offset */
#define LCDC_BASECLUT166_REG_OFST      (0x898)             /**< (LCDC_BASECLUT166) Base CLUT Register Offset */
#define LCDC_BASECLUT167_REG_OFST      (0x89C)             /**< (LCDC_BASECLUT167) Base CLUT Register Offset */
#define LCDC_BASECLUT168_REG_OFST      (0x8A0)             /**< (LCDC_BASECLUT168) Base CLUT Register Offset */
#define LCDC_BASECLUT169_REG_OFST      (0x8A4)             /**< (LCDC_BASECLUT169) Base CLUT Register Offset */
#define LCDC_BASECLUT170_REG_OFST      (0x8A8)             /**< (LCDC_BASECLUT170) Base CLUT Register Offset */
#define LCDC_BASECLUT171_REG_OFST      (0x8AC)             /**< (LCDC_BASECLUT171) Base CLUT Register Offset */
#define LCDC_BASECLUT172_REG_OFST      (0x8B0)             /**< (LCDC_BASECLUT172) Base CLUT Register Offset */
#define LCDC_BASECLUT173_REG_OFST      (0x8B4)             /**< (LCDC_BASECLUT173) Base CLUT Register Offset */
#define LCDC_BASECLUT174_REG_OFST      (0x8B8)             /**< (LCDC_BASECLUT174) Base CLUT Register Offset */
#define LCDC_BASECLUT175_REG_OFST      (0x8BC)             /**< (LCDC_BASECLUT175) Base CLUT Register Offset */
#define LCDC_BASECLUT176_REG_OFST      (0x8C0)             /**< (LCDC_BASECLUT176) Base CLUT Register Offset */
#define LCDC_BASECLUT177_REG_OFST      (0x8C4)             /**< (LCDC_BASECLUT177) Base CLUT Register Offset */
#define LCDC_BASECLUT178_REG_OFST      (0x8C8)             /**< (LCDC_BASECLUT178) Base CLUT Register Offset */
#define LCDC_BASECLUT179_REG_OFST      (0x8CC)             /**< (LCDC_BASECLUT179) Base CLUT Register Offset */
#define LCDC_BASECLUT180_REG_OFST      (0x8D0)             /**< (LCDC_BASECLUT180) Base CLUT Register Offset */
#define LCDC_BASECLUT181_REG_OFST      (0x8D4)             /**< (LCDC_BASECLUT181) Base CLUT Register Offset */
#define LCDC_BASECLUT182_REG_OFST      (0x8D8)             /**< (LCDC_BASECLUT182) Base CLUT Register Offset */
#define LCDC_BASECLUT183_REG_OFST      (0x8DC)             /**< (LCDC_BASECLUT183) Base CLUT Register Offset */
#define LCDC_BASECLUT184_REG_OFST      (0x8E0)             /**< (LCDC_BASECLUT184) Base CLUT Register Offset */
#define LCDC_BASECLUT185_REG_OFST      (0x8E4)             /**< (LCDC_BASECLUT185) Base CLUT Register Offset */
#define LCDC_BASECLUT186_REG_OFST      (0x8E8)             /**< (LCDC_BASECLUT186) Base CLUT Register Offset */
#define LCDC_BASECLUT187_REG_OFST      (0x8EC)             /**< (LCDC_BASECLUT187) Base CLUT Register Offset */
#define LCDC_BASECLUT188_REG_OFST      (0x8F0)             /**< (LCDC_BASECLUT188) Base CLUT Register Offset */
#define LCDC_BASECLUT189_REG_OFST      (0x8F4)             /**< (LCDC_BASECLUT189) Base CLUT Register Offset */
#define LCDC_BASECLUT190_REG_OFST      (0x8F8)             /**< (LCDC_BASECLUT190) Base CLUT Register Offset */
#define LCDC_BASECLUT191_REG_OFST      (0x8FC)             /**< (LCDC_BASECLUT191) Base CLUT Register Offset */
#define LCDC_BASECLUT192_REG_OFST      (0x900)             /**< (LCDC_BASECLUT192) Base CLUT Register Offset */
#define LCDC_BASECLUT193_REG_OFST      (0x904)             /**< (LCDC_BASECLUT193) Base CLUT Register Offset */
#define LCDC_BASECLUT194_REG_OFST      (0x908)             /**< (LCDC_BASECLUT194) Base CLUT Register Offset */
#define LCDC_BASECLUT195_REG_OFST      (0x90C)             /**< (LCDC_BASECLUT195) Base CLUT Register Offset */
#define LCDC_BASECLUT196_REG_OFST      (0x910)             /**< (LCDC_BASECLUT196) Base CLUT Register Offset */
#define LCDC_BASECLUT197_REG_OFST      (0x914)             /**< (LCDC_BASECLUT197) Base CLUT Register Offset */
#define LCDC_BASECLUT198_REG_OFST      (0x918)             /**< (LCDC_BASECLUT198) Base CLUT Register Offset */
#define LCDC_BASECLUT199_REG_OFST      (0x91C)             /**< (LCDC_BASECLUT199) Base CLUT Register Offset */
#define LCDC_BASECLUT200_REG_OFST      (0x920)             /**< (LCDC_BASECLUT200) Base CLUT Register Offset */
#define LCDC_BASECLUT201_REG_OFST      (0x924)             /**< (LCDC_BASECLUT201) Base CLUT Register Offset */
#define LCDC_BASECLUT202_REG_OFST      (0x928)             /**< (LCDC_BASECLUT202) Base CLUT Register Offset */
#define LCDC_BASECLUT203_REG_OFST      (0x92C)             /**< (LCDC_BASECLUT203) Base CLUT Register Offset */
#define LCDC_BASECLUT204_REG_OFST      (0x930)             /**< (LCDC_BASECLUT204) Base CLUT Register Offset */
#define LCDC_BASECLUT205_REG_OFST      (0x934)             /**< (LCDC_BASECLUT205) Base CLUT Register Offset */
#define LCDC_BASECLUT206_REG_OFST      (0x938)             /**< (LCDC_BASECLUT206) Base CLUT Register Offset */
#define LCDC_BASECLUT207_REG_OFST      (0x93C)             /**< (LCDC_BASECLUT207) Base CLUT Register Offset */
#define LCDC_BASECLUT208_REG_OFST      (0x940)             /**< (LCDC_BASECLUT208) Base CLUT Register Offset */
#define LCDC_BASECLUT209_REG_OFST      (0x944)             /**< (LCDC_BASECLUT209) Base CLUT Register Offset */
#define LCDC_BASECLUT210_REG_OFST      (0x948)             /**< (LCDC_BASECLUT210) Base CLUT Register Offset */
#define LCDC_BASECLUT211_REG_OFST      (0x94C)             /**< (LCDC_BASECLUT211) Base CLUT Register Offset */
#define LCDC_BASECLUT212_REG_OFST      (0x950)             /**< (LCDC_BASECLUT212) Base CLUT Register Offset */
#define LCDC_BASECLUT213_REG_OFST      (0x954)             /**< (LCDC_BASECLUT213) Base CLUT Register Offset */
#define LCDC_BASECLUT214_REG_OFST      (0x958)             /**< (LCDC_BASECLUT214) Base CLUT Register Offset */
#define LCDC_BASECLUT215_REG_OFST      (0x95C)             /**< (LCDC_BASECLUT215) Base CLUT Register Offset */
#define LCDC_BASECLUT216_REG_OFST      (0x960)             /**< (LCDC_BASECLUT216) Base CLUT Register Offset */
#define LCDC_BASECLUT217_REG_OFST      (0x964)             /**< (LCDC_BASECLUT217) Base CLUT Register Offset */
#define LCDC_BASECLUT218_REG_OFST      (0x968)             /**< (LCDC_BASECLUT218) Base CLUT Register Offset */
#define LCDC_BASECLUT219_REG_OFST      (0x96C)             /**< (LCDC_BASECLUT219) Base CLUT Register Offset */
#define LCDC_BASECLUT220_REG_OFST      (0x970)             /**< (LCDC_BASECLUT220) Base CLUT Register Offset */
#define LCDC_BASECLUT221_REG_OFST      (0x974)             /**< (LCDC_BASECLUT221) Base CLUT Register Offset */
#define LCDC_BASECLUT222_REG_OFST      (0x978)             /**< (LCDC_BASECLUT222) Base CLUT Register Offset */
#define LCDC_BASECLUT223_REG_OFST      (0x97C)             /**< (LCDC_BASECLUT223) Base CLUT Register Offset */
#define LCDC_BASECLUT224_REG_OFST      (0x980)             /**< (LCDC_BASECLUT224) Base CLUT Register Offset */
#define LCDC_BASECLUT225_REG_OFST      (0x984)             /**< (LCDC_BASECLUT225) Base CLUT Register Offset */
#define LCDC_BASECLUT226_REG_OFST      (0x988)             /**< (LCDC_BASECLUT226) Base CLUT Register Offset */
#define LCDC_BASECLUT227_REG_OFST      (0x98C)             /**< (LCDC_BASECLUT227) Base CLUT Register Offset */
#define LCDC_BASECLUT228_REG_OFST      (0x990)             /**< (LCDC_BASECLUT228) Base CLUT Register Offset */
#define LCDC_BASECLUT229_REG_OFST      (0x994)             /**< (LCDC_BASECLUT229) Base CLUT Register Offset */
#define LCDC_BASECLUT230_REG_OFST      (0x998)             /**< (LCDC_BASECLUT230) Base CLUT Register Offset */
#define LCDC_BASECLUT231_REG_OFST      (0x99C)             /**< (LCDC_BASECLUT231) Base CLUT Register Offset */
#define LCDC_BASECLUT232_REG_OFST      (0x9A0)             /**< (LCDC_BASECLUT232) Base CLUT Register Offset */
#define LCDC_BASECLUT233_REG_OFST      (0x9A4)             /**< (LCDC_BASECLUT233) Base CLUT Register Offset */
#define LCDC_BASECLUT234_REG_OFST      (0x9A8)             /**< (LCDC_BASECLUT234) Base CLUT Register Offset */
#define LCDC_BASECLUT235_REG_OFST      (0x9AC)             /**< (LCDC_BASECLUT235) Base CLUT Register Offset */
#define LCDC_BASECLUT236_REG_OFST      (0x9B0)             /**< (LCDC_BASECLUT236) Base CLUT Register Offset */
#define LCDC_BASECLUT237_REG_OFST      (0x9B4)             /**< (LCDC_BASECLUT237) Base CLUT Register Offset */
#define LCDC_BASECLUT238_REG_OFST      (0x9B8)             /**< (LCDC_BASECLUT238) Base CLUT Register Offset */
#define LCDC_BASECLUT239_REG_OFST      (0x9BC)             /**< (LCDC_BASECLUT239) Base CLUT Register Offset */
#define LCDC_BASECLUT240_REG_OFST      (0x9C0)             /**< (LCDC_BASECLUT240) Base CLUT Register Offset */
#define LCDC_BASECLUT241_REG_OFST      (0x9C4)             /**< (LCDC_BASECLUT241) Base CLUT Register Offset */
#define LCDC_BASECLUT242_REG_OFST      (0x9C8)             /**< (LCDC_BASECLUT242) Base CLUT Register Offset */
#define LCDC_BASECLUT243_REG_OFST      (0x9CC)             /**< (LCDC_BASECLUT243) Base CLUT Register Offset */
#define LCDC_BASECLUT244_REG_OFST      (0x9D0)             /**< (LCDC_BASECLUT244) Base CLUT Register Offset */
#define LCDC_BASECLUT245_REG_OFST      (0x9D4)             /**< (LCDC_BASECLUT245) Base CLUT Register Offset */
#define LCDC_BASECLUT246_REG_OFST      (0x9D8)             /**< (LCDC_BASECLUT246) Base CLUT Register Offset */
#define LCDC_BASECLUT247_REG_OFST      (0x9DC)             /**< (LCDC_BASECLUT247) Base CLUT Register Offset */
#define LCDC_BASECLUT248_REG_OFST      (0x9E0)             /**< (LCDC_BASECLUT248) Base CLUT Register Offset */
#define LCDC_BASECLUT249_REG_OFST      (0x9E4)             /**< (LCDC_BASECLUT249) Base CLUT Register Offset */
#define LCDC_BASECLUT250_REG_OFST      (0x9E8)             /**< (LCDC_BASECLUT250) Base CLUT Register Offset */
#define LCDC_BASECLUT251_REG_OFST      (0x9EC)             /**< (LCDC_BASECLUT251) Base CLUT Register Offset */
#define LCDC_BASECLUT252_REG_OFST      (0x9F0)             /**< (LCDC_BASECLUT252) Base CLUT Register Offset */
