virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
#define LCDC_BASECLUT253_REG_OFST      (0x9F4)             /**< (LCDC_BASECLUT253) Base CLUT Register Offset */
#define LCDC_BASECLUT254_REG_OFST      (0x9F8)             /**< (LCDC_BASECLUT254) Base CLUT Register Offset */
#define LCDC_BASECLUT255_REG_OFST      (0x9FC)             /**< (LCDC_BASECLUT255) Base CLUT Register Offset */
#define LCDC_OVR1CLUT_REG_OFST         (0xA00)             /**< (LCDC_OVR1CLUT) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT0_REG_OFST        (0xA00)             /**< (LCDC_OVR1CLUT0) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT1_REG_OFST        (0xA04)             /**< (LCDC_OVR1CLUT1) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT2_REG_OFST        (0xA08)             /**< (LCDC_OVR1CLUT2) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT3_REG_OFST        (0xA0C)             /**< (LCDC_OVR1CLUT3) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT4_REG_OFST        (0xA10)             /**< (LCDC_OVR1CLUT4) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT5_REG_OFST        (0xA14)             /**< (LCDC_OVR1CLUT5) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT6_REG_OFST        (0xA18)             /**< (LCDC_OVR1CLUT6) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT7_REG_OFST        (0xA1C)             /**< (LCDC_OVR1CLUT7) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT8_REG_OFST        (0xA20)             /**< (LCDC_OVR1CLUT8) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT9_REG_OFST        (0xA24)             /**< (LCDC_OVR1CLUT9) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT10_REG_OFST       (0xA28)             /**< (LCDC_OVR1CLUT10) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT11_REG_OFST       (0xA2C)             /**< (LCDC_OVR1CLUT11) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT12_REG_OFST       (0xA30)             /**< (LCDC_OVR1CLUT12) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT13_REG_OFST       (0xA34)             /**< (LCDC_OVR1CLUT13) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT14_REG_OFST       (0xA38)             /**< (LCDC_OVR1CLUT14) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT15_REG_OFST       (0xA3C)             /**< (LCDC_OVR1CLUT15) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT16_REG_OFST       (0xA40)             /**< (LCDC_OVR1CLUT16) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT17_REG_OFST       (0xA44)             /**< (LCDC_OVR1CLUT17) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT18_REG_OFST       (0xA48)             /**< (LCDC_OVR1CLUT18) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT19_REG_OFST       (0xA4C)             /**< (LCDC_OVR1CLUT19) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT20_REG_OFST       (0xA50)             /**< (LCDC_OVR1CLUT20) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT21_REG_OFST       (0xA54)             /**< (LCDC_OVR1CLUT21) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT22_REG_OFST       (0xA58)             /**< (LCDC_OVR1CLUT22) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT23_REG_OFST       (0xA5C)             /**< (LCDC_OVR1CLUT23) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT24_REG_OFST       (0xA60)             /**< (LCDC_OVR1CLUT24) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT25_REG_OFST       (0xA64)             /**< (LCDC_OVR1CLUT25) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT26_REG_OFST       (0xA68)             /**< (LCDC_OVR1CLUT26) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT27_REG_OFST       (0xA6C)             /**< (LCDC_OVR1CLUT27) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT28_REG_OFST       (0xA70)             /**< (LCDC_OVR1CLUT28) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT29_REG_OFST       (0xA74)             /**< (LCDC_OVR1CLUT29) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT30_REG_OFST       (0xA78)             /**< (LCDC_OVR1CLUT30) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT31_REG_OFST       (0xA7C)             /**< (LCDC_OVR1CLUT31) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT32_REG_OFST       (0xA80)             /**< (LCDC_OVR1CLUT32) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT33_REG_OFST       (0xA84)             /**< (LCDC_OVR1CLUT33) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT34_REG_OFST       (0xA88)             /**< (LCDC_OVR1CLUT34) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT35_REG_OFST       (0xA8C)             /**< (LCDC_OVR1CLUT35) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT36_REG_OFST       (0xA90)             /**< (LCDC_OVR1CLUT36) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT37_REG_OFST       (0xA94)             /**< (LCDC_OVR1CLUT37) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT38_REG_OFST       (0xA98)             /**< (LCDC_OVR1CLUT38) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT39_REG_OFST       (0xA9C)             /**< (LCDC_OVR1CLUT39) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT40_REG_OFST       (0xAA0)             /**< (LCDC_OVR1CLUT40) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT41_REG_OFST       (0xAA4)             /**< (LCDC_OVR1CLUT41) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT42_REG_OFST       (0xAA8)             /**< (LCDC_OVR1CLUT42) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT43_REG_OFST       (0xAAC)             /**< (LCDC_OVR1CLUT43) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT44_REG_OFST       (0xAB0)             /**< (LCDC_OVR1CLUT44) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT45_REG_OFST       (0xAB4)             /**< (LCDC_OVR1CLUT45) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT46_REG_OFST       (0xAB8)             /**< (LCDC_OVR1CLUT46) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT47_REG_OFST       (0xABC)             /**< (LCDC_OVR1CLUT47) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT48_REG_OFST       (0xAC0)             /**< (LCDC_OVR1CLUT48) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT49_REG_OFST       (0xAC4)             /**< (LCDC_OVR1CLUT49) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT50_REG_OFST       (0xAC8)             /**< (LCDC_OVR1CLUT50) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT51_REG_OFST       (0xACC)             /**< (LCDC_OVR1CLUT51) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT52_REG_OFST       (0xAD0)             /**< (LCDC_OVR1CLUT52) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT53_REG_OFST       (0xAD4)             /**< (LCDC_OVR1CLUT53) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT54_REG_OFST       (0xAD8)             /**< (LCDC_OVR1CLUT54) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT55_REG_OFST       (0xADC)             /**< (LCDC_OVR1CLUT55) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT56_REG_OFST       (0xAE0)             /**< (LCDC_OVR1CLUT56) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT57_REG_OFST       (0xAE4)             /**< (LCDC_OVR1CLUT57) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT58_REG_OFST       (0xAE8)             /**< (LCDC_OVR1CLUT58) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT59_REG_OFST       (0xAEC)             /**< (LCDC_OVR1CLUT59) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT60_REG_OFST       (0xAF0)             /**< (LCDC_OVR1CLUT60) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT61_REG_OFST       (0xAF4)             /**< (LCDC_OVR1CLUT61) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT62_REG_OFST       (0xAF8)             /**< (LCDC_OVR1CLUT62) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT63_REG_OFST       (0xAFC)             /**< (LCDC_OVR1CLUT63) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT64_REG_OFST       (0xB00)             /**< (LCDC_OVR1CLUT64) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT65_REG_OFST       (0xB04)             /**< (LCDC_OVR1CLUT65) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT66_REG_OFST       (0xB08)             /**< (LCDC_OVR1CLUT66) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT67_REG_OFST       (0xB0C)             /**< (LCDC_OVR1CLUT67) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT68_REG_OFST       (0xB10)             /**< (LCDC_OVR1CLUT68) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT69_REG_OFST       (0xB14)             /**< (LCDC_OVR1CLUT69) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT70_REG_OFST       (0xB18)             /**< (LCDC_OVR1CLUT70) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT71_REG_OFST       (0xB1C)             /**< (LCDC_OVR1CLUT71) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT72_REG_OFST       (0xB20)             /**< (LCDC_OVR1CLUT72) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT73_REG_OFST       (0xB24)             /**< (LCDC_OVR1CLUT73) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT74_REG_OFST       (0xB28)             /**< (LCDC_OVR1CLUT74) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT75_REG_OFST       (0xB2C)             /**< (LCDC_OVR1CLUT75) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT76_REG_OFST       (0xB30)             /**< (LCDC_OVR1CLUT76) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT77_REG_OFST       (0xB34)             /**< (LCDC_OVR1CLUT77) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT78_REG_OFST       (0xB38)             /**< (LCDC_OVR1CLUT78) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT79_REG_OFST       (0xB3C)             /**< (LCDC_OVR1CLUT79) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT80_REG_OFST       (0xB40)             /**< (LCDC_OVR1CLUT80) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT81_REG_OFST       (0xB44)             /**< (LCDC_OVR1CLUT81) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT82_REG_OFST       (0xB48)             /**< (LCDC_OVR1CLUT82) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT83_REG_OFST       (0xB4C)             /**< (LCDC_OVR1CLUT83) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT84_REG_OFST       (0xB50)             /**< (LCDC_OVR1CLUT84) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT85_REG_OFST       (0xB54)             /**< (LCDC_OVR1CLUT85) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT86_REG_OFST       (0xB58)             /**< (LCDC_OVR1CLUT86) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT87_REG_OFST       (0xB5C)             /**< (LCDC_OVR1CLUT87) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT88_REG_OFST       (0xB60)             /**< (LCDC_OVR1CLUT88) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT89_REG_OFST       (0xB64)             /**< (LCDC_OVR1CLUT89) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT90_REG_OFST       (0xB68)             /**< (LCDC_OVR1CLUT90) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT91_REG_OFST       (0xB6C)             /**< (LCDC_OVR1CLUT91) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT92_REG_OFST       (0xB70)             /**< (LCDC_OVR1CLUT92) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT93_REG_OFST       (0xB74)             /**< (LCDC_OVR1CLUT93) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT94_REG_OFST       (0xB78)             /**< (LCDC_OVR1CLUT94) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT95_REG_OFST       (0xB7C)             /**< (LCDC_OVR1CLUT95) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT96_REG_OFST       (0xB80)             /**< (LCDC_OVR1CLUT96) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT97_REG_OFST       (0xB84)             /**< (LCDC_OVR1CLUT97) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT98_REG_OFST       (0xB88)             /**< (LCDC_OVR1CLUT98) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT99_REG_OFST       (0xB8C)             /**< (LCDC_OVR1CLUT99) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT100_REG_OFST      (0xB90)             /**< (LCDC_OVR1CLUT100) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT101_REG_OFST      (0xB94)             /**< (LCDC_OVR1CLUT101) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT102_REG_OFST      (0xB98)             /**< (LCDC_OVR1CLUT102) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT103_REG_OFST      (0xB9C)             /**< (LCDC_OVR1CLUT103) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT104_REG_OFST      (0xBA0)             /**< (LCDC_OVR1CLUT104) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT105_REG_OFST      (0xBA4)             /**< (LCDC_OVR1CLUT105) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT106_REG_OFST      (0xBA8)             /**< (LCDC_OVR1CLUT106) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT107_REG_OFST      (0xBAC)             /**< (LCDC_OVR1CLUT107) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT108_REG_OFST      (0xBB0)             /**< (LCDC_OVR1CLUT108) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT109_REG_OFST      (0xBB4)             /**< (LCDC_OVR1CLUT109) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT110_REG_OFST      (0xBB8)             /**< (LCDC_OVR1CLUT110) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT111_REG_OFST      (0xBBC)             /**< (LCDC_OVR1CLUT111) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT112_REG_OFST      (0xBC0)             /**< (LCDC_OVR1CLUT112) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT113_REG_OFST      (0xBC4)             /**< (LCDC_OVR1CLUT113) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT114_REG_OFST      (0xBC8)             /**< (LCDC_OVR1CLUT114) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT115_REG_OFST      (0xBCC)             /**< (LCDC_OVR1CLUT115) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT116_REG_OFST      (0xBD0)             /**< (LCDC_OVR1CLUT116) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT117_REG_OFST      (0xBD4)             /**< (LCDC_OVR1CLUT117) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT118_REG_OFST      (0xBD8)             /**< (LCDC_OVR1CLUT118) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT119_REG_OFST      (0xBDC)             /**< (LCDC_OVR1CLUT119) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT120_REG_OFST      (0xBE0)             /**< (LCDC_OVR1CLUT120) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT121_REG_OFST      (0xBE4)             /**< (LCDC_OVR1CLUT121) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT122_REG_OFST      (0xBE8)             /**< (LCDC_OVR1CLUT122) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT123_REG_OFST      (0xBEC)             /**< (LCDC_OVR1CLUT123) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT124_REG_OFST      (0xBF0)             /**< (LCDC_OVR1CLUT124) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT125_REG_OFST      (0xBF4)             /**< (LCDC_OVR1CLUT125) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT126_REG_OFST      (0xBF8)             /**< (LCDC_OVR1CLUT126) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT127_REG_OFST      (0xBFC)             /**< (LCDC_OVR1CLUT127) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT128_REG_OFST      (0xC00)             /**< (LCDC_OVR1CLUT128) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT129_REG_OFST      (0xC04)             /**< (LCDC_OVR1CLUT129) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT130_REG_OFST      (0xC08)             /**< (LCDC_OVR1CLUT130) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT131_REG_OFST      (0xC0C)             /**< (LCDC_OVR1CLUT131) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT132_REG_OFST      (0xC10)             /**< (LCDC_OVR1CLUT132) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT133_REG_OFST      (0xC14)             /**< (LCDC_OVR1CLUT133) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT134_REG_OFST      (0xC18)             /**< (LCDC_OVR1CLUT134) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT135_REG_OFST      (0xC1C)             /**< (LCDC_OVR1CLUT135) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT136_REG_OFST      (0xC20)             /**< (LCDC_OVR1CLUT136) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT137_REG_OFST      (0xC24)             /**< (LCDC_OVR1CLUT137) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT138_REG_OFST      (0xC28)             /**< (LCDC_OVR1CLUT138) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT139_REG_OFST      (0xC2C)             /**< (LCDC_OVR1CLUT139) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT140_REG_OFST      (0xC30)             /**< (LCDC_OVR1CLUT140) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT141_REG_OFST      (0xC34)             /**< (LCDC_OVR1CLUT141) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT142_REG_OFST      (0xC38)             /**< (LCDC_OVR1CLUT142) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT143_REG_OFST      (0xC3C)             /**< (LCDC_OVR1CLUT143) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT144_REG_OFST      (0xC40)             /**< (LCDC_OVR1CLUT144) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT145_REG_OFST      (0xC44)             /**< (LCDC_OVR1CLUT145) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT146_REG_OFST      (0xC48)             /**< (LCDC_OVR1CLUT146) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT147_REG_OFST      (0xC4C)             /**< (LCDC_OVR1CLUT147) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT148_REG_OFST      (0xC50)             /**< (LCDC_OVR1CLUT148) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT149_REG_OFST      (0xC54)             /**< (LCDC_OVR1CLUT149) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT150_REG_OFST      (0xC58)             /**< (LCDC_OVR1CLUT150) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT151_REG_OFST      (0xC5C)             /**< (LCDC_OVR1CLUT151) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT152_REG_OFST      (0xC60)             /**< (LCDC_OVR1CLUT152) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT153_REG_OFST      (0xC64)             /**< (LCDC_OVR1CLUT153) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT154_REG_OFST      (0xC68)             /**< (LCDC_OVR1CLUT154) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT155_REG_OFST      (0xC6C)             /**< (LCDC_OVR1CLUT155) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT156_REG_OFST      (0xC70)             /**< (LCDC_OVR1CLUT156) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT157_REG_OFST      (0xC74)             /**< (LCDC_OVR1CLUT157) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT158_REG_OFST      (0xC78)             /**< (LCDC_OVR1CLUT158) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT159_REG_OFST      (0xC7C)             /**< (LCDC_OVR1CLUT159) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT160_REG_OFST      (0xC80)             /**< (LCDC_OVR1CLUT160) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT161_REG_OFST      (0xC84)             /**< (LCDC_OVR1CLUT161) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT162_REG_OFST      (0xC88)             /**< (LCDC_OVR1CLUT162) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT163_REG_OFST      (0xC8C)             /**< (LCDC_OVR1CLUT163) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT164_REG_OFST      (0xC90)             /**< (LCDC_OVR1CLUT164) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT165_REG_OFST      (0xC94)             /**< (LCDC_OVR1CLUT165) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT166_REG_OFST      (0xC98)             /**< (LCDC_OVR1CLUT166) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT167_REG_OFST      (0xC9C)             /**< (LCDC_OVR1CLUT167) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT168_REG_OFST      (0xCA0)             /**< (LCDC_OVR1CLUT168) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT169_REG_OFST      (0xCA4)             /**< (LCDC_OVR1CLUT169) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT170_REG_OFST      (0xCA8)             /**< (LCDC_OVR1CLUT170) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT171_REG_OFST      (0xCAC)             /**< (LCDC_OVR1CLUT171) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT172_REG_OFST      (0xCB0)             /**< (LCDC_OVR1CLUT172) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT173_REG_OFST      (0xCB4)             /**< (LCDC_OVR1CLUT173) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT174_REG_OFST      (0xCB8)             /**< (LCDC_OVR1CLUT174) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT175_REG_OFST      (0xCBC)             /**< (LCDC_OVR1CLUT175) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT176_REG_OFST      (0xCC0)             /**< (LCDC_OVR1CLUT176) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT177_REG_OFST      (0xCC4)             /**< (LCDC_OVR1CLUT177) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT178_REG_OFST      (0xCC8)             /**< (LCDC_OVR1CLUT178) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT179_REG_OFST      (0xCCC)             /**< (LCDC_OVR1CLUT179) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT180_REG_OFST      (0xCD0)             /**< (LCDC_OVR1CLUT180) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT181_REG_OFST      (0xCD4)             /**< (LCDC_OVR1CLUT181) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT182_REG_OFST      (0xCD8)             /**< (LCDC_OVR1CLUT182) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT183_REG_OFST      (0xCDC)             /**< (LCDC_OVR1CLUT183) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT184_REG_OFST      (0xCE0)             /**< (LCDC_OVR1CLUT184) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT185_REG_OFST      (0xCE4)             /**< (LCDC_OVR1CLUT185) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT186_REG_OFST      (0xCE8)             /**< (LCDC_OVR1CLUT186) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT187_REG_OFST      (0xCEC)             /**< (LCDC_OVR1CLUT187) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT188_REG_OFST      (0xCF0)             /**< (LCDC_OVR1CLUT188) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT189_REG_OFST      (0xCF4)             /**< (LCDC_OVR1CLUT189) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT190_REG_OFST      (0xCF8)             /**< (LCDC_OVR1CLUT190) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT191_REG_OFST      (0xCFC)             /**< (LCDC_OVR1CLUT191) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT192_REG_OFST      (0xD00)             /**< (LCDC_OVR1CLUT192) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT193_REG_OFST      (0xD04)             /**< (LCDC_OVR1CLUT193) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT194_REG_OFST      (0xD08)             /**< (LCDC_OVR1CLUT194) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT195_REG_OFST      (0xD0C)             /**< (LCDC_OVR1CLUT195) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT196_REG_OFST      (0xD10)             /**< (LCDC_OVR1CLUT196) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT197_REG_OFST      (0xD14)             /**< (LCDC_OVR1CLUT197) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT198_REG_OFST      (0xD18)             /**< (LCDC_OVR1CLUT198) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT199_REG_OFST      (0xD1C)             /**< (LCDC_OVR1CLUT199) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT200_REG_OFST      (0xD20)             /**< (LCDC_OVR1CLUT200) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT201_REG_OFST      (0xD24)             /**< (LCDC_OVR1CLUT201) Overlay 1 CLUT Register Offset */
