virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
#define LCDC_OVR1CLUT202_REG_OFST      (0xD28)             /**< (LCDC_OVR1CLUT202) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT203_REG_OFST      (0xD2C)             /**< (LCDC_OVR1CLUT203) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT204_REG_OFST      (0xD30)             /**< (LCDC_OVR1CLUT204) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT205_REG_OFST      (0xD34)             /**< (LCDC_OVR1CLUT205) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT206_REG_OFST      (0xD38)             /**< (LCDC_OVR1CLUT206) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT207_REG_OFST      (0xD3C)             /**< (LCDC_OVR1CLUT207) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT208_REG_OFST      (0xD40)             /**< (LCDC_OVR1CLUT208) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT209_REG_OFST      (0xD44)             /**< (LCDC_OVR1CLUT209) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT210_REG_OFST      (0xD48)             /**< (LCDC_OVR1CLUT210) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT211_REG_OFST      (0xD4C)             /**< (LCDC_OVR1CLUT211) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT212_REG_OFST      (0xD50)             /**< (LCDC_OVR1CLUT212) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT213_REG_OFST      (0xD54)             /**< (LCDC_OVR1CLUT213) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT214_REG_OFST      (0xD58)             /**< (LCDC_OVR1CLUT214) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT215_REG_OFST      (0xD5C)             /**< (LCDC_OVR1CLUT215) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT216_REG_OFST      (0xD60)             /**< (LCDC_OVR1CLUT216) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT217_REG_OFST      (0xD64)             /**< (LCDC_OVR1CLUT217) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT218_REG_OFST      (0xD68)             /**< (LCDC_OVR1CLUT218) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT219_REG_OFST      (0xD6C)             /**< (LCDC_OVR1CLUT219) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT220_REG_OFST      (0xD70)             /**< (LCDC_OVR1CLUT220) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT221_REG_OFST      (0xD74)             /**< (LCDC_OVR1CLUT221) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT222_REG_OFST      (0xD78)             /**< (LCDC_OVR1CLUT222) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT223_REG_OFST      (0xD7C)             /**< (LCDC_OVR1CLUT223) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT224_REG_OFST      (0xD80)             /**< (LCDC_OVR1CLUT224) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT225_REG_OFST      (0xD84)             /**< (LCDC_OVR1CLUT225) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT226_REG_OFST      (0xD88)             /**< (LCDC_OVR1CLUT226) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT227_REG_OFST      (0xD8C)             /**< (LCDC_OVR1CLUT227) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT228_REG_OFST      (0xD90)             /**< (LCDC_OVR1CLUT228) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT229_REG_OFST      (0xD94)             /**< (LCDC_OVR1CLUT229) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT230_REG_OFST      (0xD98)             /**< (LCDC_OVR1CLUT230) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT231_REG_OFST      (0xD9C)             /**< (LCDC_OVR1CLUT231) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT232_REG_OFST      (0xDA0)             /**< (LCDC_OVR1CLUT232) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT233_REG_OFST      (0xDA4)             /**< (LCDC_OVR1CLUT233) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT234_REG_OFST      (0xDA8)             /**< (LCDC_OVR1CLUT234) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT235_REG_OFST      (0xDAC)             /**< (LCDC_OVR1CLUT235) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT236_REG_OFST      (0xDB0)             /**< (LCDC_OVR1CLUT236) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT237_REG_OFST      (0xDB4)             /**< (LCDC_OVR1CLUT237) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT238_REG_OFST      (0xDB8)             /**< (LCDC_OVR1CLUT238) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT239_REG_OFST      (0xDBC)             /**< (LCDC_OVR1CLUT239) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT240_REG_OFST      (0xDC0)             /**< (LCDC_OVR1CLUT240) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT241_REG_OFST      (0xDC4)             /**< (LCDC_OVR1CLUT241) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT242_REG_OFST      (0xDC8)             /**< (LCDC_OVR1CLUT242) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT243_REG_OFST      (0xDCC)             /**< (LCDC_OVR1CLUT243) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT244_REG_OFST      (0xDD0)             /**< (LCDC_OVR1CLUT244) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT245_REG_OFST      (0xDD4)             /**< (LCDC_OVR1CLUT245) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT246_REG_OFST      (0xDD8)             /**< (LCDC_OVR1CLUT246) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT247_REG_OFST      (0xDDC)             /**< (LCDC_OVR1CLUT247) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT248_REG_OFST      (0xDE0)             /**< (LCDC_OVR1CLUT248) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT249_REG_OFST      (0xDE4)             /**< (LCDC_OVR1CLUT249) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT250_REG_OFST      (0xDE8)             /**< (LCDC_OVR1CLUT250) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT251_REG_OFST      (0xDEC)             /**< (LCDC_OVR1CLUT251) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT252_REG_OFST      (0xDF0)             /**< (LCDC_OVR1CLUT252) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT253_REG_OFST      (0xDF4)             /**< (LCDC_OVR1CLUT253) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT254_REG_OFST      (0xDF8)             /**< (LCDC_OVR1CLUT254) Overlay 1 CLUT Register Offset */
#define LCDC_OVR1CLUT255_REG_OFST      (0xDFC)             /**< (LCDC_OVR1CLUT255) Overlay 1 CLUT Register Offset */
#define LCDC_OVR2CLUT_REG_OFST         (0xE00)             /**< (LCDC_OVR2CLUT) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT0_REG_OFST        (0xE00)             /**< (LCDC_OVR2CLUT0) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT1_REG_OFST        (0xE04)             /**< (LCDC_OVR2CLUT1) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT2_REG_OFST        (0xE08)             /**< (LCDC_OVR2CLUT2) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT3_REG_OFST        (0xE0C)             /**< (LCDC_OVR2CLUT3) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT4_REG_OFST        (0xE10)             /**< (LCDC_OVR2CLUT4) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT5_REG_OFST        (0xE14)             /**< (LCDC_OVR2CLUT5) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT6_REG_OFST        (0xE18)             /**< (LCDC_OVR2CLUT6) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT7_REG_OFST        (0xE1C)             /**< (LCDC_OVR2CLUT7) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT8_REG_OFST        (0xE20)             /**< (LCDC_OVR2CLUT8) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT9_REG_OFST        (0xE24)             /**< (LCDC_OVR2CLUT9) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT10_REG_OFST       (0xE28)             /**< (LCDC_OVR2CLUT10) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT11_REG_OFST       (0xE2C)             /**< (LCDC_OVR2CLUT11) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT12_REG_OFST       (0xE30)             /**< (LCDC_OVR2CLUT12) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT13_REG_OFST       (0xE34)             /**< (LCDC_OVR2CLUT13) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT14_REG_OFST       (0xE38)             /**< (LCDC_OVR2CLUT14) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT15_REG_OFST       (0xE3C)             /**< (LCDC_OVR2CLUT15) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT16_REG_OFST       (0xE40)             /**< (LCDC_OVR2CLUT16) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT17_REG_OFST       (0xE44)             /**< (LCDC_OVR2CLUT17) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT18_REG_OFST       (0xE48)             /**< (LCDC_OVR2CLUT18) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT19_REG_OFST       (0xE4C)             /**< (LCDC_OVR2CLUT19) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT20_REG_OFST       (0xE50)             /**< (LCDC_OVR2CLUT20) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT21_REG_OFST       (0xE54)             /**< (LCDC_OVR2CLUT21) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT22_REG_OFST       (0xE58)             /**< (LCDC_OVR2CLUT22) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT23_REG_OFST       (0xE5C)             /**< (LCDC_OVR2CLUT23) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT24_REG_OFST       (0xE60)             /**< (LCDC_OVR2CLUT24) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT25_REG_OFST       (0xE64)             /**< (LCDC_OVR2CLUT25) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT26_REG_OFST       (0xE68)             /**< (LCDC_OVR2CLUT26) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT27_REG_OFST       (0xE6C)             /**< (LCDC_OVR2CLUT27) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT28_REG_OFST       (0xE70)             /**< (LCDC_OVR2CLUT28) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT29_REG_OFST       (0xE74)             /**< (LCDC_OVR2CLUT29) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT30_REG_OFST       (0xE78)             /**< (LCDC_OVR2CLUT30) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT31_REG_OFST       (0xE7C)             /**< (LCDC_OVR2CLUT31) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT32_REG_OFST       (0xE80)             /**< (LCDC_OVR2CLUT32) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT33_REG_OFST       (0xE84)             /**< (LCDC_OVR2CLUT33) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT34_REG_OFST       (0xE88)             /**< (LCDC_OVR2CLUT34) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT35_REG_OFST       (0xE8C)             /**< (LCDC_OVR2CLUT35) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT36_REG_OFST       (0xE90)             /**< (LCDC_OVR2CLUT36) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT37_REG_OFST       (0xE94)             /**< (LCDC_OVR2CLUT37) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT38_REG_OFST       (0xE98)             /**< (LCDC_OVR2CLUT38) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT39_REG_OFST       (0xE9C)             /**< (LCDC_OVR2CLUT39) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT40_REG_OFST       (0xEA0)             /**< (LCDC_OVR2CLUT40) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT41_REG_OFST       (0xEA4)             /**< (LCDC_OVR2CLUT41) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT42_REG_OFST       (0xEA8)             /**< (LCDC_OVR2CLUT42) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT43_REG_OFST       (0xEAC)             /**< (LCDC_OVR2CLUT43) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT44_REG_OFST       (0xEB0)             /**< (LCDC_OVR2CLUT44) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT45_REG_OFST       (0xEB4)             /**< (LCDC_OVR2CLUT45) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT46_REG_OFST       (0xEB8)             /**< (LCDC_OVR2CLUT46) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT47_REG_OFST       (0xEBC)             /**< (LCDC_OVR2CLUT47) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT48_REG_OFST       (0xEC0)             /**< (LCDC_OVR2CLUT48) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT49_REG_OFST       (0xEC4)             /**< (LCDC_OVR2CLUT49) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT50_REG_OFST       (0xEC8)             /**< (LCDC_OVR2CLUT50) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT51_REG_OFST       (0xECC)             /**< (LCDC_OVR2CLUT51) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT52_REG_OFST       (0xED0)             /**< (LCDC_OVR2CLUT52) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT53_REG_OFST       (0xED4)             /**< (LCDC_OVR2CLUT53) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT54_REG_OFST       (0xED8)             /**< (LCDC_OVR2CLUT54) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT55_REG_OFST       (0xEDC)             /**< (LCDC_OVR2CLUT55) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT56_REG_OFST       (0xEE0)             /**< (LCDC_OVR2CLUT56) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT57_REG_OFST       (0xEE4)             /**< (LCDC_OVR2CLUT57) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT58_REG_OFST       (0xEE8)             /**< (LCDC_OVR2CLUT58) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT59_REG_OFST       (0xEEC)             /**< (LCDC_OVR2CLUT59) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT60_REG_OFST       (0xEF0)             /**< (LCDC_OVR2CLUT60) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT61_REG_OFST       (0xEF4)             /**< (LCDC_OVR2CLUT61) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT62_REG_OFST       (0xEF8)             /**< (LCDC_OVR2CLUT62) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT63_REG_OFST       (0xEFC)             /**< (LCDC_OVR2CLUT63) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT64_REG_OFST       (0xF00)             /**< (LCDC_OVR2CLUT64) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT65_REG_OFST       (0xF04)             /**< (LCDC_OVR2CLUT65) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT66_REG_OFST       (0xF08)             /**< (LCDC_OVR2CLUT66) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT67_REG_OFST       (0xF0C)             /**< (LCDC_OVR2CLUT67) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT68_REG_OFST       (0xF10)             /**< (LCDC_OVR2CLUT68) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT69_REG_OFST       (0xF14)             /**< (LCDC_OVR2CLUT69) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT70_REG_OFST       (0xF18)             /**< (LCDC_OVR2CLUT70) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT71_REG_OFST       (0xF1C)             /**< (LCDC_OVR2CLUT71) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT72_REG_OFST       (0xF20)             /**< (LCDC_OVR2CLUT72) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT73_REG_OFST       (0xF24)             /**< (LCDC_OVR2CLUT73) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT74_REG_OFST       (0xF28)             /**< (LCDC_OVR2CLUT74) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT75_REG_OFST       (0xF2C)             /**< (LCDC_OVR2CLUT75) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT76_REG_OFST       (0xF30)             /**< (LCDC_OVR2CLUT76) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT77_REG_OFST       (0xF34)             /**< (LCDC_OVR2CLUT77) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT78_REG_OFST       (0xF38)             /**< (LCDC_OVR2CLUT78) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT79_REG_OFST       (0xF3C)             /**< (LCDC_OVR2CLUT79) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT80_REG_OFST       (0xF40)             /**< (LCDC_OVR2CLUT80) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT81_REG_OFST       (0xF44)             /**< (LCDC_OVR2CLUT81) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT82_REG_OFST       (0xF48)             /**< (LCDC_OVR2CLUT82) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT83_REG_OFST       (0xF4C)             /**< (LCDC_OVR2CLUT83) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT84_REG_OFST       (0xF50)             /**< (LCDC_OVR2CLUT84) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT85_REG_OFST       (0xF54)             /**< (LCDC_OVR2CLUT85) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT86_REG_OFST       (0xF58)             /**< (LCDC_OVR2CLUT86) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT87_REG_OFST       (0xF5C)             /**< (LCDC_OVR2CLUT87) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT88_REG_OFST       (0xF60)             /**< (LCDC_OVR2CLUT88) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT89_REG_OFST       (0xF64)             /**< (LCDC_OVR2CLUT89) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT90_REG_OFST       (0xF68)             /**< (LCDC_OVR2CLUT90) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT91_REG_OFST       (0xF6C)             /**< (LCDC_OVR2CLUT91) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT92_REG_OFST       (0xF70)             /**< (LCDC_OVR2CLUT92) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT93_REG_OFST       (0xF74)             /**< (LCDC_OVR2CLUT93) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT94_REG_OFST       (0xF78)             /**< (LCDC_OVR2CLUT94) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT95_REG_OFST       (0xF7C)             /**< (LCDC_OVR2CLUT95) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT96_REG_OFST       (0xF80)             /**< (LCDC_OVR2CLUT96) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT97_REG_OFST       (0xF84)             /**< (LCDC_OVR2CLUT97) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT98_REG_OFST       (0xF88)             /**< (LCDC_OVR2CLUT98) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT99_REG_OFST       (0xF8C)             /**< (LCDC_OVR2CLUT99) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT100_REG_OFST      (0xF90)             /**< (LCDC_OVR2CLUT100) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT101_REG_OFST      (0xF94)             /**< (LCDC_OVR2CLUT101) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT102_REG_OFST      (0xF98)             /**< (LCDC_OVR2CLUT102) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT103_REG_OFST      (0xF9C)             /**< (LCDC_OVR2CLUT103) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT104_REG_OFST      (0xFA0)             /**< (LCDC_OVR2CLUT104) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT105_REG_OFST      (0xFA4)             /**< (LCDC_OVR2CLUT105) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT106_REG_OFST      (0xFA8)             /**< (LCDC_OVR2CLUT106) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT107_REG_OFST      (0xFAC)             /**< (LCDC_OVR2CLUT107) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT108_REG_OFST      (0xFB0)             /**< (LCDC_OVR2CLUT108) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT109_REG_OFST      (0xFB4)             /**< (LCDC_OVR2CLUT109) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT110_REG_OFST      (0xFB8)             /**< (LCDC_OVR2CLUT110) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT111_REG_OFST      (0xFBC)             /**< (LCDC_OVR2CLUT111) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT112_REG_OFST      (0xFC0)             /**< (LCDC_OVR2CLUT112) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT113_REG_OFST      (0xFC4)             /**< (LCDC_OVR2CLUT113) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT114_REG_OFST      (0xFC8)             /**< (LCDC_OVR2CLUT114) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT115_REG_OFST      (0xFCC)             /**< (LCDC_OVR2CLUT115) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT116_REG_OFST      (0xFD0)             /**< (LCDC_OVR2CLUT116) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT117_REG_OFST      (0xFD4)             /**< (LCDC_OVR2CLUT117) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT118_REG_OFST      (0xFD8)             /**< (LCDC_OVR2CLUT118) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT119_REG_OFST      (0xFDC)             /**< (LCDC_OVR2CLUT119) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT120_REG_OFST      (0xFE0)             /**< (LCDC_OVR2CLUT120) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT121_REG_OFST      (0xFE4)             /**< (LCDC_OVR2CLUT121) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT122_REG_OFST      (0xFE8)             /**< (LCDC_OVR2CLUT122) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT123_REG_OFST      (0xFEC)             /**< (LCDC_OVR2CLUT123) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT124_REG_OFST      (0xFF0)             /**< (LCDC_OVR2CLUT124) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT125_REG_OFST      (0xFF4)             /**< (LCDC_OVR2CLUT125) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT126_REG_OFST      (0xFF8)             /**< (LCDC_OVR2CLUT126) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT127_REG_OFST      (0xFFC)             /**< (LCDC_OVR2CLUT127) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT128_REG_OFST      (0x1000)            /**< (LCDC_OVR2CLUT128) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT129_REG_OFST      (0x1004)            /**< (LCDC_OVR2CLUT129) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT130_REG_OFST      (0x1008)            /**< (LCDC_OVR2CLUT130) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT131_REG_OFST      (0x100C)            /**< (LCDC_OVR2CLUT131) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT132_REG_OFST      (0x1010)            /**< (LCDC_OVR2CLUT132) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT133_REG_OFST      (0x1014)            /**< (LCDC_OVR2CLUT133) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT134_REG_OFST      (0x1018)            /**< (LCDC_OVR2CLUT134) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT135_REG_OFST      (0x101C)            /**< (LCDC_OVR2CLUT135) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT136_REG_OFST      (0x1020)            /**< (LCDC_OVR2CLUT136) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT137_REG_OFST      (0x1024)            /**< (LCDC_OVR2CLUT137) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT138_REG_OFST      (0x1028)            /**< (LCDC_OVR2CLUT138) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT139_REG_OFST      (0x102C)            /**< (LCDC_OVR2CLUT139) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT140_REG_OFST      (0x1030)            /**< (LCDC_OVR2CLUT140) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT141_REG_OFST      (0x1034)            /**< (LCDC_OVR2CLUT141) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT142_REG_OFST      (0x1038)            /**< (LCDC_OVR2CLUT142) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT143_REG_OFST      (0x103C)            /**< (LCDC_OVR2CLUT143) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT144_REG_OFST      (0x1040)            /**< (LCDC_OVR2CLUT144) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT145_REG_OFST      (0x1044)            /**< (LCDC_OVR2CLUT145) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT146_REG_OFST      (0x1048)            /**< (LCDC_OVR2CLUT146) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT147_REG_OFST      (0x104C)            /**< (LCDC_OVR2CLUT147) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT148_REG_OFST      (0x1050)            /**< (LCDC_OVR2CLUT148) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT149_REG_OFST      (0x1054)            /**< (LCDC_OVR2CLUT149) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT150_REG_OFST      (0x1058)            /**< (LCDC_OVR2CLUT150) Overlay 2 CLUT Register Offset */
