virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/lcdc.h
#define LCDC_OVR2CLUT151_REG_OFST      (0x105C)            /**< (LCDC_OVR2CLUT151) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT152_REG_OFST      (0x1060)            /**< (LCDC_OVR2CLUT152) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT153_REG_OFST      (0x1064)            /**< (LCDC_OVR2CLUT153) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT154_REG_OFST      (0x1068)            /**< (LCDC_OVR2CLUT154) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT155_REG_OFST      (0x106C)            /**< (LCDC_OVR2CLUT155) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT156_REG_OFST      (0x1070)            /**< (LCDC_OVR2CLUT156) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT157_REG_OFST      (0x1074)            /**< (LCDC_OVR2CLUT157) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT158_REG_OFST      (0x1078)            /**< (LCDC_OVR2CLUT158) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT159_REG_OFST      (0x107C)            /**< (LCDC_OVR2CLUT159) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT160_REG_OFST      (0x1080)            /**< (LCDC_OVR2CLUT160) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT161_REG_OFST      (0x1084)            /**< (LCDC_OVR2CLUT161) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT162_REG_OFST      (0x1088)            /**< (LCDC_OVR2CLUT162) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT163_REG_OFST      (0x108C)            /**< (LCDC_OVR2CLUT163) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT164_REG_OFST      (0x1090)            /**< (LCDC_OVR2CLUT164) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT165_REG_OFST      (0x1094)            /**< (LCDC_OVR2CLUT165) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT166_REG_OFST      (0x1098)            /**< (LCDC_OVR2CLUT166) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT167_REG_OFST      (0x109C)            /**< (LCDC_OVR2CLUT167) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT168_REG_OFST      (0x10A0)            /**< (LCDC_OVR2CLUT168) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT169_REG_OFST      (0x10A4)            /**< (LCDC_OVR2CLUT169) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT170_REG_OFST      (0x10A8)            /**< (LCDC_OVR2CLUT170) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT171_REG_OFST      (0x10AC)            /**< (LCDC_OVR2CLUT171) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT172_REG_OFST      (0x10B0)            /**< (LCDC_OVR2CLUT172) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT173_REG_OFST      (0x10B4)            /**< (LCDC_OVR2CLUT173) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT174_REG_OFST      (0x10B8)            /**< (LCDC_OVR2CLUT174) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT175_REG_OFST      (0x10BC)            /**< (LCDC_OVR2CLUT175) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT176_REG_OFST      (0x10C0)            /**< (LCDC_OVR2CLUT176) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT177_REG_OFST      (0x10C4)            /**< (LCDC_OVR2CLUT177) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT178_REG_OFST      (0x10C8)            /**< (LCDC_OVR2CLUT178) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT179_REG_OFST      (0x10CC)            /**< (LCDC_OVR2CLUT179) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT180_REG_OFST      (0x10D0)            /**< (LCDC_OVR2CLUT180) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT181_REG_OFST      (0x10D4)            /**< (LCDC_OVR2CLUT181) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT182_REG_OFST      (0x10D8)            /**< (LCDC_OVR2CLUT182) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT183_REG_OFST      (0x10DC)            /**< (LCDC_OVR2CLUT183) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT184_REG_OFST      (0x10E0)            /**< (LCDC_OVR2CLUT184) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT185_REG_OFST      (0x10E4)            /**< (LCDC_OVR2CLUT185) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT186_REG_OFST      (0x10E8)            /**< (LCDC_OVR2CLUT186) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT187_REG_OFST      (0x10EC)            /**< (LCDC_OVR2CLUT187) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT188_REG_OFST      (0x10F0)            /**< (LCDC_OVR2CLUT188) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT189_REG_OFST      (0x10F4)            /**< (LCDC_OVR2CLUT189) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT190_REG_OFST      (0x10F8)            /**< (LCDC_OVR2CLUT190) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT191_REG_OFST      (0x10FC)            /**< (LCDC_OVR2CLUT191) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT192_REG_OFST      (0x1100)            /**< (LCDC_OVR2CLUT192) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT193_REG_OFST      (0x1104)            /**< (LCDC_OVR2CLUT193) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT194_REG_OFST      (0x1108)            /**< (LCDC_OVR2CLUT194) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT195_REG_OFST      (0x110C)            /**< (LCDC_OVR2CLUT195) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT196_REG_OFST      (0x1110)            /**< (LCDC_OVR2CLUT196) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT197_REG_OFST      (0x1114)            /**< (LCDC_OVR2CLUT197) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT198_REG_OFST      (0x1118)            /**< (LCDC_OVR2CLUT198) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT199_REG_OFST      (0x111C)            /**< (LCDC_OVR2CLUT199) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT200_REG_OFST      (0x1120)            /**< (LCDC_OVR2CLUT200) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT201_REG_OFST      (0x1124)            /**< (LCDC_OVR2CLUT201) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT202_REG_OFST      (0x1128)            /**< (LCDC_OVR2CLUT202) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT203_REG_OFST      (0x112C)            /**< (LCDC_OVR2CLUT203) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT204_REG_OFST      (0x1130)            /**< (LCDC_OVR2CLUT204) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT205_REG_OFST      (0x1134)            /**< (LCDC_OVR2CLUT205) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT206_REG_OFST      (0x1138)            /**< (LCDC_OVR2CLUT206) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT207_REG_OFST      (0x113C)            /**< (LCDC_OVR2CLUT207) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT208_REG_OFST      (0x1140)            /**< (LCDC_OVR2CLUT208) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT209_REG_OFST      (0x1144)            /**< (LCDC_OVR2CLUT209) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT210_REG_OFST      (0x1148)            /**< (LCDC_OVR2CLUT210) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT211_REG_OFST      (0x114C)            /**< (LCDC_OVR2CLUT211) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT212_REG_OFST      (0x1150)            /**< (LCDC_OVR2CLUT212) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT213_REG_OFST      (0x1154)            /**< (LCDC_OVR2CLUT213) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT214_REG_OFST      (0x1158)            /**< (LCDC_OVR2CLUT214) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT215_REG_OFST      (0x115C)            /**< (LCDC_OVR2CLUT215) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT216_REG_OFST      (0x1160)            /**< (LCDC_OVR2CLUT216) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT217_REG_OFST      (0x1164)            /**< (LCDC_OVR2CLUT217) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT218_REG_OFST      (0x1168)            /**< (LCDC_OVR2CLUT218) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT219_REG_OFST      (0x116C)            /**< (LCDC_OVR2CLUT219) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT220_REG_OFST      (0x1170)            /**< (LCDC_OVR2CLUT220) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT221_REG_OFST      (0x1174)            /**< (LCDC_OVR2CLUT221) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT222_REG_OFST      (0x1178)            /**< (LCDC_OVR2CLUT222) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT223_REG_OFST      (0x117C)            /**< (LCDC_OVR2CLUT223) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT224_REG_OFST      (0x1180)            /**< (LCDC_OVR2CLUT224) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT225_REG_OFST      (0x1184)            /**< (LCDC_OVR2CLUT225) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT226_REG_OFST      (0x1188)            /**< (LCDC_OVR2CLUT226) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT227_REG_OFST      (0x118C)            /**< (LCDC_OVR2CLUT227) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT228_REG_OFST      (0x1190)            /**< (LCDC_OVR2CLUT228) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT229_REG_OFST      (0x1194)            /**< (LCDC_OVR2CLUT229) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT230_REG_OFST      (0x1198)            /**< (LCDC_OVR2CLUT230) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT231_REG_OFST      (0x119C)            /**< (LCDC_OVR2CLUT231) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT232_REG_OFST      (0x11A0)            /**< (LCDC_OVR2CLUT232) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT233_REG_OFST      (0x11A4)            /**< (LCDC_OVR2CLUT233) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT234_REG_OFST      (0x11A8)            /**< (LCDC_OVR2CLUT234) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT235_REG_OFST      (0x11AC)            /**< (LCDC_OVR2CLUT235) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT236_REG_OFST      (0x11B0)            /**< (LCDC_OVR2CLUT236) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT237_REG_OFST      (0x11B4)            /**< (LCDC_OVR2CLUT237) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT238_REG_OFST      (0x11B8)            /**< (LCDC_OVR2CLUT238) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT239_REG_OFST      (0x11BC)            /**< (LCDC_OVR2CLUT239) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT240_REG_OFST      (0x11C0)            /**< (LCDC_OVR2CLUT240) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT241_REG_OFST      (0x11C4)            /**< (LCDC_OVR2CLUT241) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT242_REG_OFST      (0x11C8)            /**< (LCDC_OVR2CLUT242) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT243_REG_OFST      (0x11CC)            /**< (LCDC_OVR2CLUT243) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT244_REG_OFST      (0x11D0)            /**< (LCDC_OVR2CLUT244) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT245_REG_OFST      (0x11D4)            /**< (LCDC_OVR2CLUT245) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT246_REG_OFST      (0x11D8)            /**< (LCDC_OVR2CLUT246) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT247_REG_OFST      (0x11DC)            /**< (LCDC_OVR2CLUT247) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT248_REG_OFST      (0x11E0)            /**< (LCDC_OVR2CLUT248) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT249_REG_OFST      (0x11E4)            /**< (LCDC_OVR2CLUT249) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT250_REG_OFST      (0x11E8)            /**< (LCDC_OVR2CLUT250) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT251_REG_OFST      (0x11EC)            /**< (LCDC_OVR2CLUT251) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT252_REG_OFST      (0x11F0)            /**< (LCDC_OVR2CLUT252) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT253_REG_OFST      (0x11F4)            /**< (LCDC_OVR2CLUT253) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT254_REG_OFST      (0x11F8)            /**< (LCDC_OVR2CLUT254) Overlay 2 CLUT Register Offset */
#define LCDC_OVR2CLUT255_REG_OFST      (0x11FC)            /**< (LCDC_OVR2CLUT255) Overlay 2 CLUT Register Offset */
#define LCDC_HEOCLUT_REG_OFST          (0x1200)            /**< (LCDC_HEOCLUT) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT0_REG_OFST         (0x1200)            /**< (LCDC_HEOCLUT0) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT1_REG_OFST         (0x1204)            /**< (LCDC_HEOCLUT1) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT2_REG_OFST         (0x1208)            /**< (LCDC_HEOCLUT2) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT3_REG_OFST         (0x120C)            /**< (LCDC_HEOCLUT3) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT4_REG_OFST         (0x1210)            /**< (LCDC_HEOCLUT4) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT5_REG_OFST         (0x1214)            /**< (LCDC_HEOCLUT5) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT6_REG_OFST         (0x1218)            /**< (LCDC_HEOCLUT6) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT7_REG_OFST         (0x121C)            /**< (LCDC_HEOCLUT7) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT8_REG_OFST         (0x1220)            /**< (LCDC_HEOCLUT8) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT9_REG_OFST         (0x1224)            /**< (LCDC_HEOCLUT9) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT10_REG_OFST        (0x1228)            /**< (LCDC_HEOCLUT10) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT11_REG_OFST        (0x122C)            /**< (LCDC_HEOCLUT11) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT12_REG_OFST        (0x1230)            /**< (LCDC_HEOCLUT12) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT13_REG_OFST        (0x1234)            /**< (LCDC_HEOCLUT13) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT14_REG_OFST        (0x1238)            /**< (LCDC_HEOCLUT14) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT15_REG_OFST        (0x123C)            /**< (LCDC_HEOCLUT15) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT16_REG_OFST        (0x1240)            /**< (LCDC_HEOCLUT16) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT17_REG_OFST        (0x1244)            /**< (LCDC_HEOCLUT17) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT18_REG_OFST        (0x1248)            /**< (LCDC_HEOCLUT18) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT19_REG_OFST        (0x124C)            /**< (LCDC_HEOCLUT19) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT20_REG_OFST        (0x1250)            /**< (LCDC_HEOCLUT20) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT21_REG_OFST        (0x1254)            /**< (LCDC_HEOCLUT21) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT22_REG_OFST        (0x1258)            /**< (LCDC_HEOCLUT22) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT23_REG_OFST        (0x125C)            /**< (LCDC_HEOCLUT23) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT24_REG_OFST        (0x1260)            /**< (LCDC_HEOCLUT24) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT25_REG_OFST        (0x1264)            /**< (LCDC_HEOCLUT25) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT26_REG_OFST        (0x1268)            /**< (LCDC_HEOCLUT26) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT27_REG_OFST        (0x126C)            /**< (LCDC_HEOCLUT27) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT28_REG_OFST        (0x1270)            /**< (LCDC_HEOCLUT28) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT29_REG_OFST        (0x1274)            /**< (LCDC_HEOCLUT29) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT30_REG_OFST        (0x1278)            /**< (LCDC_HEOCLUT30) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT31_REG_OFST        (0x127C)            /**< (LCDC_HEOCLUT31) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT32_REG_OFST        (0x1280)            /**< (LCDC_HEOCLUT32) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT33_REG_OFST        (0x1284)            /**< (LCDC_HEOCLUT33) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT34_REG_OFST        (0x1288)            /**< (LCDC_HEOCLUT34) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT35_REG_OFST        (0x128C)            /**< (LCDC_HEOCLUT35) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT36_REG_OFST        (0x1290)            /**< (LCDC_HEOCLUT36) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT37_REG_OFST        (0x1294)            /**< (LCDC_HEOCLUT37) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT38_REG_OFST        (0x1298)            /**< (LCDC_HEOCLUT38) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT39_REG_OFST        (0x129C)            /**< (LCDC_HEOCLUT39) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT40_REG_OFST        (0x12A0)            /**< (LCDC_HEOCLUT40) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT41_REG_OFST        (0x12A4)            /**< (LCDC_HEOCLUT41) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT42_REG_OFST        (0x12A8)            /**< (LCDC_HEOCLUT42) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT43_REG_OFST        (0x12AC)            /**< (LCDC_HEOCLUT43) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT44_REG_OFST        (0x12B0)            /**< (LCDC_HEOCLUT44) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT45_REG_OFST        (0x12B4)            /**< (LCDC_HEOCLUT45) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT46_REG_OFST        (0x12B8)            /**< (LCDC_HEOCLUT46) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT47_REG_OFST        (0x12BC)            /**< (LCDC_HEOCLUT47) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT48_REG_OFST        (0x12C0)            /**< (LCDC_HEOCLUT48) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT49_REG_OFST        (0x12C4)            /**< (LCDC_HEOCLUT49) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT50_REG_OFST        (0x12C8)            /**< (LCDC_HEOCLUT50) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT51_REG_OFST        (0x12CC)            /**< (LCDC_HEOCLUT51) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT52_REG_OFST        (0x12D0)            /**< (LCDC_HEOCLUT52) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT53_REG_OFST        (0x12D4)            /**< (LCDC_HEOCLUT53) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT54_REG_OFST        (0x12D8)            /**< (LCDC_HEOCLUT54) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT55_REG_OFST        (0x12DC)            /**< (LCDC_HEOCLUT55) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT56_REG_OFST        (0x12E0)            /**< (LCDC_HEOCLUT56) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT57_REG_OFST        (0x12E4)            /**< (LCDC_HEOCLUT57) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT58_REG_OFST        (0x12E8)            /**< (LCDC_HEOCLUT58) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT59_REG_OFST        (0x12EC)            /**< (LCDC_HEOCLUT59) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT60_REG_OFST        (0x12F0)            /**< (LCDC_HEOCLUT60) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT61_REG_OFST        (0x12F4)            /**< (LCDC_HEOCLUT61) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT62_REG_OFST        (0x12F8)            /**< (LCDC_HEOCLUT62) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT63_REG_OFST        (0x12FC)            /**< (LCDC_HEOCLUT63) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT64_REG_OFST        (0x1300)            /**< (LCDC_HEOCLUT64) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT65_REG_OFST        (0x1304)            /**< (LCDC_HEOCLUT65) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT66_REG_OFST        (0x1308)            /**< (LCDC_HEOCLUT66) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT67_REG_OFST        (0x130C)            /**< (LCDC_HEOCLUT67) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT68_REG_OFST        (0x1310)            /**< (LCDC_HEOCLUT68) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT69_REG_OFST        (0x1314)            /**< (LCDC_HEOCLUT69) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT70_REG_OFST        (0x1318)            /**< (LCDC_HEOCLUT70) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT71_REG_OFST        (0x131C)            /**< (LCDC_HEOCLUT71) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT72_REG_OFST        (0x1320)            /**< (LCDC_HEOCLUT72) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT73_REG_OFST        (0x1324)            /**< (LCDC_HEOCLUT73) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT74_REG_OFST        (0x1328)            /**< (LCDC_HEOCLUT74) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT75_REG_OFST        (0x132C)            /**< (LCDC_HEOCLUT75) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT76_REG_OFST        (0x1330)            /**< (LCDC_HEOCLUT76) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT77_REG_OFST        (0x1334)            /**< (LCDC_HEOCLUT77) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT78_REG_OFST        (0x1338)            /**< (LCDC_HEOCLUT78) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT79_REG_OFST        (0x133C)            /**< (LCDC_HEOCLUT79) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT80_REG_OFST        (0x1340)            /**< (LCDC_HEOCLUT80) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT81_REG_OFST        (0x1344)            /**< (LCDC_HEOCLUT81) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT82_REG_OFST        (0x1348)            /**< (LCDC_HEOCLUT82) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT83_REG_OFST        (0x134C)            /**< (LCDC_HEOCLUT83) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT84_REG_OFST        (0x1350)            /**< (LCDC_HEOCLUT84) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT85_REG_OFST        (0x1354)            /**< (LCDC_HEOCLUT85) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT86_REG_OFST        (0x1358)            /**< (LCDC_HEOCLUT86) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT87_REG_OFST        (0x135C)            /**< (LCDC_HEOCLUT87) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT88_REG_OFST        (0x1360)            /**< (LCDC_HEOCLUT88) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT89_REG_OFST        (0x1364)            /**< (LCDC_HEOCLUT89) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT90_REG_OFST        (0x1368)            /**< (LCDC_HEOCLUT90) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT91_REG_OFST        (0x136C)            /**< (LCDC_HEOCLUT91) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT92_REG_OFST        (0x1370)            /**< (LCDC_HEOCLUT92) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT93_REG_OFST        (0x1374)            /**< (LCDC_HEOCLUT93) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT94_REG_OFST        (0x1378)            /**< (LCDC_HEOCLUT94) High-End Overlay CLUT Register Offset */
